
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>المخططات · استكشف فلاسك</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="templates.html" />
    
    
    <link rel="prev" href="views.html" />
    

    
        <link rel="shortcut icon" href='../images/flask.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/flask.png' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    المقدمة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="coding_conventions.html">
            
                <a href="coding_conventions.html">
            
                    
                    أعراف كتابة الشيفرة البرمجية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="environment.html">
            
                <a href="environment.html">
            
                    
                    بيئة العمل
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="organizing.html">
            
                <a href="organizing.html">
            
                    
                    تنظيم المشروع
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="configuration.html">
            
                <a href="configuration.html">
            
                    
                    الإعداد
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="views.html">
            
                <a href="views.html">
            
                    
                    استخدامات متقدمة لدوال العرض والتوجيه
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="blueprints.html">
            
                <a href="blueprints.html">
            
                    
                    المخططات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="templates.html">
            
                <a href="templates.html">
            
                    
                    القوالب
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="static.html">
            
                <a href="static.html">
            
                    
                    الملفات الساكنة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="storing.html">
            
                <a href="storing.html">
            
                    
                    تخزين البيانات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    التعامل مع الاستمارات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="users.html">
            
                <a href="users.html">
            
                    
                    أساليب للتعامل مع المُستخدمين
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="deployment.html">
            
                <a href="deployment.html">
            
                    
                    النشر
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    الخاتمة
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >المخططات</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;">&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;</h1>
<p><img src="../images/blueprints.png"></p>
<h2 id="&#x645;&#x627;-&#x647;&#x64A;-&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;">&#x645;&#x627; &#x647;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;</h2>
<p>&#x64A;&#x64F;&#x639;&#x631;&#x651;&#x650;&#x641; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x645;&#x646; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;&#x60C; &#x648;&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; (Static Files) &#x648;&#x63A;&#x64A;&#x631;&#x647;&#x627; &#x645;&#x646; &#x627;&#x644;&#x639;&#x646;&#x627;&#x635;&#x631; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x64F;&#x645;&#x643;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;. &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x62F;&#x639;&#x646;&#x627; &#x646;&#x62A;&#x62E;&#x64A;&#x644; &#x623;&#x646;&#x646;&#x627; &#x646;&#x645;&#x644;&#x643; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x644;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x645;&#x634;&#x631;&#x641;. &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x633;&#x64A;&#x64F;&#x639;&#x631;&#x651;&#x650;&#x641; &#x62F;&#x648;&#x627;&#x644; &#x639;&#x631;&#x636; &#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x645;&#x62B;&#x644; <em>admin/login/</em> &#x648; <em>admin/dashboard/</em>. &#x642;&#x62F; &#x64A;&#x64F;&#x636;&#x645;&#x651;&#x650;&#x646; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x647;&#x627; &#x641;&#x64A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A;. &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x628;&#x639;&#x62F; &#x630;&#x644;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x644;&#x648;&#x62D;&#x629; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x62A;&#x644;&#x643; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627;&#x60C; &#x633;&#x648;&#x627;&#x621;&#x64B; &#x643;&#x627;&#x646; &#x647;&#x630;&#x627; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x634;&#x628;&#x643;&#x629; &#x62A;&#x648;&#x627;&#x635;&#x644; &#x627;&#x62C;&#x62A;&#x645;&#x627;&#x639;&#x64A; &#x644;&#x631;&#x648;&#x627;&#x62F; &#x627;&#x644;&#x641;&#x636;&#x627;&#x621; &#x623;&#x648; &#x645;&#x648;&#x642;&#x639; &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x645;&#x628;&#x64A;&#x639;&#x627;&#x62A; &#x627;&#x644;&#x635;&#x648;&#x627;&#x631;&#x64A;&#x62E;.</p>
<h2 id="&#x644;&#x650;&#x645;&#x64E;-&#x639;&#x644;&#x64A;&#x643;-&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;-&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;">&#x644;&#x650;&#x645;&#x64E; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;</h2>
<p>&#x62D;&#x627;&#x644;&#x629; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x623;&#x643;&#x62B;&#x631; &#x634;&#x639;&#x628;&#x64A;&#x629; &#x644;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x647;&#x64A; &#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x625;&#x644;&#x649; &#x645;&#x643;&#x648;&#x646;&#x627;&#x62A; &#x645;&#x633;&#x62A;&#x642;&#x644;&#x629;. &#x641;&#x645;&#x62B;&#x644;&#x627;&#x64B; &#x644;&#x645;&#x648;&#x642;&#x639; &#x634;&#x628;&#x64A;&#x647; &#x628;&#x62A;&#x648;&#x64A;&#x62A;&#x631;&#x60C; &#x642;&#x62F; &#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x644;&#x635;&#x641;&#x62D;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x648;&#x642;&#x639; (&#x645;&#x62B;&#x644; &#x635;&#x641;&#x62D;&#x629; <em>index.html</em> &#x648; <em>about.html</em>). &#x648;&#x645;&#x646; &#x62B;&#x645; &#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x625;&#x644;&#x649; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x622;&#x62E;&#x631; &#x645;&#x646; &#x623;&#x62C;&#x644; &#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62C;&#x644; &#x62D;&#x64A;&#x62B; &#x633;&#x62A;&#x639;&#x631;&#x636; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x646;&#x634;&#x648;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;&#x629; &#x647;&#x646;&#x627;&#x643;&#x60C; &#x643;&#x645;&#x627; &#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x648;&#x627;&#x62D;&#x62F; &#x622;&#x62E;&#x631; &#x645;&#x646; &#x623;&#x62C;&#x644; &#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x634;&#x631;&#x650;&#x641;. &#x62D;&#x64A;&#x62B; &#x643;&#x644; &#x642;&#x633;&#x645; &#x645;&#x633;&#x62A;&#x642;&#x644; &#x645;&#x646; &#x627;&#x644;&#x645;&#x648;&#x642;&#x639; &#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x623;&#x646; &#x64A;&#x64F;&#x62C;&#x632;&#x651;&#x64E;&#x623; &#x625;&#x644;&#x649; &#x642;&#x633;&#x645; &#x645;&#x633;&#x62A;&#x642;&#x644; &#x645;&#x646; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x623;&#x64A;&#x636;&#x627;&#x64B;. &#x645;&#x645;&#x627; &#x64A;&#x62A;&#x64A;&#x62D; &#x644;&#x646;&#x627; &#x62A;&#x646;&#x638;&#x64A;&#x645; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x648;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x647; &#x625;&#x644;&#x649; &quot;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A;&quot; &#x645;&#x64F;&#x635;&#x63A;&#x631;&#x629; &#x643;&#x644;&#x64C; &#x645;&#x646;&#x647;&#x627; &#x64A;&#x624;&#x62F;&#x64A; &#x648;&#x638;&#x64A;&#x641;&#x629; &#x645;&#x639;&#x64A;&#x646;&#x629;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x645;&#x643;&#x646;&#x643; &#x642;&#x631;&#x627;&#x621;&#x629; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x62D;&#x648;&#x644; &#x641;&#x648;&#x627;&#x626;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x641;&#x64A; &#x642;&#x633;&#x645; <a href="http://flask.pocoo.org/docs/blueprints/#why-blueprints" target="_blank">&quot;&#x644;&#x650;&#x645;&#x64E; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&quot;</a> &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x627;&#x644;&#x631;&#x633;&#x645;&#x64A; &#x644;&#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643;.
</blockquote>

<h2 id="&#x623;&#x64A;&#x646;-&#x64A;&#x62C;&#x628;-&#x623;&#x646;-&#x62A;&#x648;&#x636;&#x639;-&#x647;&#x630;&#x647;-&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;">&#x623;&#x64A;&#x646; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x62A;&#x648;&#x636;&#x639; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;</h2>
<p>&#x643;&#x643;&#x644; &#x634;&#x64A;&#x621; &#x641;&#x64A; &#x641;&#x644;&#x627;&#x633;&#x643;&#x60C; &#x64A;&#x648;&#x62C;&#x62F; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x637;&#x631;&#x642; &#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;. &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62A;&#x642;&#x646;&#x64A;&#x629; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x644;&#x627;&#x62E;&#x62A;&#x64A;&#x627;&#x631; &#x645;&#x627; &#x628;&#x64A;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A; &#x623;&#x648; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;.</p>
<h3 id="&#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;-&#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;">&#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;</h3>
<p>&#x641;&#x64A; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;&#x60C; &#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x623;&#x62C;&#x632;&#x627;&#x621; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x645;&#x627; &#x62A;&#x641;&#x639;&#x644;&#x647;. &#x628;&#x62D;&#x64A;&#x62B; &#x62A;&#x64F;&#x62C;&#x645;&#x64E;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x641;&#x64A; &#x622;&#x62E;&#x631;&#x60C; &#x648;&#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x641;&#x64A; &#x62B;&#x627;&#x644;&#x62B;.</p>
<pre><code>yourapp/
    __init__.py
    static/
    templates/
        home/
        control_panel/
        admin/
    views/
        __init__.py
        home.py
        control_panel.py
        admin.py
    models.py
</code></pre><p>&#x628;&#x627;&#x633;&#x62A;&#x62B;&#x646;&#x627;&#x621; &#x627;&#x644;&#x645;&#x644;&#x641; <em>yourapp/views/__init__.py</em>&#x60C; &#x643;&#x644; &#x645;&#x644;&#x641; &#x64A;&#x62D;&#x645;&#x644; &#x627;&#x644;&#x644;&#x627;&#x62D;&#x642;&#x629; <em>py.</em> &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>yourapp/views/</em> (&#x643;&#x645;&#x627; &#x647;&#x648; &#x645;&#x648;&#x636;&#x62D; &#x623;&#x639;&#x644;&#x627;&#x647;) &#x64A;&#x64F;&#x645;&#x64E;&#x62B;&#x650;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;. &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>yourapp/__init__.py</em> &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x627;&#x633;&#x62A;&#x64A;&#x631;&#x627;&#x62F; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x648;<strong>&#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x647;&#x645;</strong> &#x641;&#x64A; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646; <code>()Flask</code>. &#x633;&#x646;&#x62A;&#x639;&#x645;&#x642; &#x623;&#x643;&#x62B;&#x631; &#x642;&#x644;&#x64A;&#x644;&#x627;&#x64B; &#x62D;&#x648;&#x644; &#x643;&#x64A;&#x641;&#x64A;&#x629; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;&#x64A;&#x629; &#x647;&#x630;&#x647; &#x644;&#x627;&#x62D;&#x642;&#x627;&#x64B; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x641;&#x635;&#x644;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x641;&#x64A; &#x623;&#x62B;&#x646;&#x627;&#x621; &#x643;&#x62A;&#x627;&#x628;&#x629; &#x647;&#x630;&#x647; &#x627;&#x644;&#x643;&#x644;&#x645;&#x627;&#x62A;&#x60C; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; <a href="http://flask.pocoo.org/" target="_blank">&#x645;&#x648;&#x642;&#x639; &#x641;&#x644;&#x627;&#x633;&#x643;</a> &#x647;&#x630;&#x647; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;&#x64A;&#x629;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x623;&#x62E;&#x630; &#x646;&#x638;&#x631;&#x629; &#x628;&#x646;&#x641;&#x633;&#x643; &#x641;&#x64A; <a href="https://github.com/mitsuhiko/flask-website/tree/master/flask_website" target="_blank">&#x645;&#x648;&#x642;&#x639; &#x62C;&#x64A;&#x62A;&#x647;&#x627;&#x628;</a>.
</blockquote>

<h3 id="&#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;-&#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;">&#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;</h3>
<p>&#x641;&#x64A; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x60C; &#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x623;&#x62C;&#x632;&#x627;&#x621; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x623;&#x64A; &#x62C;&#x632;&#x621; &#x645;&#x646; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x62A;&#x633;&#x627;&#x647;&#x645; &#x641;&#x64A;&#x647; (&#x62A;&#x62F;&#x62E;&#x644; &#x641;&#x64A; &#x62A;&#x631;&#x643;&#x64A;&#x628;&#x62A;&#x647;). &#x628;&#x62D;&#x64A;&#x62B; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x648;&#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629; &#x628;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x634;&#x631;&#x650;&#x641; &#x633;&#x62A;&#x648;&#x636;&#x639; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x648;&#x627;&#x62D;&#x62F;&#x60C; &#x648;&#x646;&#x638;&#x64A;&#x631;&#x627;&#x62A;&#x647;&#x627; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629; &#x628;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x633;&#x62A;&#x648;&#x636;&#x639; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x622;&#x62E;&#x631;.</p>
<pre><code>yourapp/
    __init__.py
    admin/
        __init__.py
        views.py
        static/
        templates/
    home/
        __init__.py
        views.py
        static/
        templates/
    control_panel/
        __init__.py
        views.py
        static/
        templates/
    models.py
</code></pre><p>&#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A; (&#x643;&#x645;&#x627; &#x647;&#x648; &#x645;&#x648;&#x636;&#x62D; &#x623;&#x639;&#x644;&#x627;&#x647;)&#x60C; &#x643;&#x644; &#x62F;&#x644;&#x64A;&#x644; &#x645;&#x64F;&#x62D;&#x62A;&#x648;&#x649; &#x628;&#x62F;&#x627;&#x62E;&#x644; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>yourapp/</em> &#x64A;&#x64F;&#x645;&#x62B;&#x650;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x64B; &#x645;&#x64F;&#x646;&#x641;&#x635;&#x650;&#x644;&#x627;&#x64B;. &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x633;&#x64A;&#x62A;&#x645; &#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <i>init</i><i>__</i><i>.py</i><i>__</i> (&#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x62C;&#x630;&#x631;).</p>
<h3 id="&#x623;&#x64A;&#x647;&#x645;-&#x623;&#x641;&#x636;&#x644;&#x61F;">&#x623;&#x64A;&#x647;&#x645; &#x623;&#x641;&#x636;&#x644;&#x61F;</h3>
<p>&#x64A;&#x639;&#x62F; &#x627;&#x62E;&#x62A;&#x64A;&#x627;&#x631; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;&#x64A;&#x629; &#x644;&#x645;&#x634;&#x631;&#x648;&#x639;&#x643; &#x62E;&#x64A;&#x627;&#x631; &#x634;&#x62E;&#x635;&#x64A; &#x628;&#x62D;&#x62A;. &#x641;&#x627;&#x644;&#x641;&#x631;&#x642; &#x627;&#x644;&#x648;&#x62D;&#x64A;&#x62F; &#x647;&#x648; &#x628;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x62A;&#x645;&#x62B;&#x64A;&#x644; &#x627;&#x644;&#x62A;&#x633;&#x644;&#x633;&#x644; &#x627;&#x644;&#x647;&#x631;&#x645;&#x64A; - &#x623;&#x64A; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x647;&#x646;&#x62F;&#x633;&#x629; (&#x62A;&#x646;&#x638;&#x64A;&#x645;) &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x628;&#x643;&#x644;&#x627; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x62A;&#x64A;&#x646; - &#x644;&#x630;&#x644;&#x643; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x62A;&#x62E;&#x62A;&#x627;&#x631; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x623;&#x643;&#x62B;&#x631; &#x645;&#x646;&#x637;&#x642;&#x64A;&#x629; &#x628;&#x627;&#x644;&#x646;&#x633;&#x628;&#x629; &#x644;&#x643;.</p>
<p>&#x625;&#x630;&#x627; &#x643;&#x627;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x64A;&#x645;&#x644;&#x643; &#x623;&#x62C;&#x632;&#x627;&#x621; &#x645;&#x633;&#x62A;&#x642;&#x644;&#x629; &#x648;&#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x62A;&#x634;&#x627;&#x631;&#x643; &#x641;&#x642;&#x637; &#x623;&#x634;&#x64A;&#x627;&#x621; &#x645;&#x62B;&#x644; &#x627;&#x644;&#x646;&#x645;&#x627;&#x630;&#x62C; (Models) &#x648;&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x641;&#x642;&#x62F; &#x62A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629; &#x647;&#x64A; &#x627;&#x644;&#x645;&#x646;&#x627;&#x633;&#x628;&#x629;. &#x62F;&#x639;&#x646;&#x627; &#x646;&#x623;&#x62E;&#x630; &#x62A;&#x637;&#x628;&#x64A;&#x642; (SaaS) &#x64A;&#x62A;&#x64A;&#x62D; &#x644;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x646; &#x628;&#x646;&#x627;&#x621; &#x645;&#x648;&#x627;&#x642;&#x639; &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x644;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A;&#x629;&#x60C; &#x648;&#x644;&#x648;&#x62D;&#x629; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645;&#x60C; &#x648;&#x645;&#x648;&#x642;&#x639; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x60C; &#x648;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x634;&#x631;&#x650;&#x641; &#x648;&#x62A;&#x646;&#x638;&#x64A;&#x645;&#x647;&#x627; &#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x627;&#x64B;. &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x642;&#x633;&#x627;&#x645; &#x642;&#x62F; &#x62A;&#x645;&#x644;&#x643; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x633;&#x627;&#x643;&#x646;&#x629; &#x648;&#x646;&#x645;&#x627;&#x630;&#x62C; (layouts) &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629; &#x639;&#x646; &#x628;&#x639;&#x636;&#x647;&#x627; &#x644;&#x62D;&#x62F;&#x64D; &#x643;&#x628;&#x64A;&#x631;. &#x625;&#x630;&#x627; &#x643;&#x646;&#x62A; &#x62A;&#x641;&#x643;&#x631; &#x628;&#x641;&#x635;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x648;&#x62A;&#x62D;&#x648;&#x64A;&#x644;&#x647;&#x627; &#x625;&#x644;&#x649; &#x625;&#x636;&#x627;&#x641;&#x627;&#x62A; &#x623;&#x648; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x641;&#x64A; &#x645;&#x634;&#x627;&#x631;&#x64A;&#x639; &#x623;&#x62E;&#x631;&#x649; &#x641;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A; &#x633;&#x64A;&#x643;&#x648;&#x646; &#x623;&#x641;&#x636;&#x644; &#x648;&#x623;&#x633;&#x647;&#x644; &#x628;&#x643;&#x62B;&#x64A;&#x631;.</p>
<p>&#x645;&#x646; &#x646;&#x627;&#x62D;&#x64A;&#x629; &#x623;&#x62E;&#x631;&#x649;&#x60C; &#x625;&#x630;&#x627; &#x643;&#x627;&#x646;&#x62A; &#x645;&#x643;&#x648;&#x646;&#x627;&#x62A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x62A;&#x62A;&#x634;&#x627;&#x631;&#x643; &#x645;&#x639;&#x627;&#x64B; &#x623;&#x643;&#x62B;&#x631; &#x628;&#x642;&#x644;&#x64A;&#x644; &#x641;&#x645;&#x646; &#x627;&#x644;&#x623;&#x641;&#x636;&#x644; &#x62A;&#x645;&#x62B;&#x64A;&#x644;&#x647;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;&#x629;. &#x644;&#x646;&#x623;&#x62E;&#x630; &#x627;&#x644;&#x641;&#x64A;&#x633; &#x628;&#x648;&#x643; &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;. &#x625;&#x630;&#x627; &#x643;&#x627;&#x646; &#x627;&#x644;&#x641;&#x64A;&#x633; &#x628;&#x648;&#x643; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x644;&#x627;&#x633;&#x643; &#x641;&#x645;&#x646; &#x627;&#x644;&#x645;&#x645;&#x643;&#x646; &#x623;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x647;&#x646;&#x627;&#x643; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x644;&#x644;&#x635;&#x641;&#x62D;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; (&#x623;&#x64A; &#x644;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A;&#x629;&#x60C; &#x648;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x60C; &#x648;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x62D;&#x648;&#x644;&#x60C; ... &#x625;&#x644;&#x62E;.)&#x60C; &#x648;&#x644;&#x644;&#x648;&#x62D;&#x629; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; (&#x623;&#x64A; &#x644;&#x635;&#x641;&#x62D;&#x629; &#x622;&#x62E;&#x631; &#x627;&#x644;&#x623;&#x62E;&#x628;&#x627;&#x631;)&#x60C; &#x648;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A;&#x629; (<em>robert/about/</em> &#x648; <em>robert/photos/</em>)&#x60C; &#x648;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; (<em>settings/security/</em> &#x648; <em>settings/privacy/</em>)&#x60C; &#x648;&#x644;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x635;&#x641;&#x62D;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62E;&#x631;&#x649;. &#x627;&#x644;&#x645;&#x643;&#x648;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x628;&#x642;&#x629; &#x62A;&#x634;&#x62A;&#x631;&#x643; &#x628;&#x627;&#x644;&#x62A;&#x62E;&#x637;&#x64A;&#x637; (layout) &#x648;&#x628;&#x627;&#x644;&#x62A;&#x646;&#x633;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x639;&#x627;&#x645;&#x629;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x644;&#x643;&#x644; &#x645;&#x646;&#x647;&#x627; &#x62A;&#x62E;&#x637;&#x64A;&#x637;&#x647;&#x627; (&#x62A;&#x635;&#x645;&#x64A;&#x645;&#x647;&#x627;) &#x627;&#x644;&#x62E;&#x627;&#x635; &#x623;&#x64A;&#x636;&#x627;&#x64B;. &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x64A;&#x648;&#x636;&#x62D; &#x643;&#x64A;&#x641; &#x633;&#x62A;&#x628;&#x62F;&#x648; &#x627;&#x644;&#x646;&#x633;&#x62E;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x62A;&#x635;&#x631;&#x629; &#x645;&#x646; &#x641;&#x64A;&#x633; &#x628;&#x648;&#x643; &#x644;&#x648; &#x643;&#x627;&#x646; &#x645;&#x628;&#x646;&#x64A; &#x628;&#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643;.</p>
<pre><code>facebook/
    __init__.py
    templates/
        layout.html
        home/
            layout.html
            index.html
            about.html
            signup.html
            login.html
        dashboard/
            layout.html
            news_feed.html
            welcome.html
            find_friends.html
        profile/
            layout.html
            timeline.html
            about.html
            photos.html
            friends.html
            edit.html
        settings/
            layout.html
            privacy.html
            security.html
            general.html
    views/
        __init__.py
        home.py
        dashboard.py
        profile.py
        settings.py
    static/
        style.css
        logo.png
    models.py
</code></pre><p>&#x633;&#x62A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>/facebook/views</em> &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x645;&#x646; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x645;&#x643;&#x648;&#x646;&#x627;&#x62A; &#x645;&#x633;&#x62A;&#x642;&#x644;&#x629; &#x643;&#x627;&#x645;&#x644;&#x629;. &#x633;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x639;&#x638;&#x645; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x646;&#x641;&#x633; &#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629;. &#x633;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; (&#x633;&#x62A;&#x633;&#x62A;&#x645;&#x62F;) &#x645;&#x639;&#x638;&#x645; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x646;&#x645;&#x648;&#x630;&#x62C; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A; (&#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>/templates</em> &#x628;&#x627;&#x633;&#x645; <em>layout.html</em>). &#x644;&#x630;&#x644;&#x643; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629; &#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;&#x64A;&#x629; &#x648;&#x633;&#x64A;&#x644;&#x629; &#x631;&#x627;&#x626;&#x639;&#x629; &#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x645;&#x634;&#x627;&#x631;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x634;&#x627;&#x628;&#x647;&#x629;.</p>
<h2 id="&#x643;&#x64A;&#x641;-&#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x64E;&#x645;-&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;">&#x643;&#x64A;&#x641; &#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x64E;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;&#x61F;</h2>
<h3 id="&#x627;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;-&#x627;&#x644;&#x645;&#x628;&#x62F;&#x626;&#x64A;">&#x627;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x628;&#x62F;&#x626;&#x64A;</h3>
<p>&#x62F;&#x639;&#x646;&#x627; &#x646;&#x644;&#x642;&#x64A; &#x646;&#x638;&#x631;&#x629; &#x639;&#x644;&#x649; &#x634;&#x64A;&#x641;&#x631;&#x629; &#x625;&#x62D;&#x62F;&#x649; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x645;&#x646; &#x645;&#x62B;&#x627;&#x644; &quot;&#x627;&#x644;&#x641;&#x64A;&#x633; &#x628;&#x648;&#x643;&quot; &#x627;&#x644;&#x633;&#x627;&#x628;&#x642;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># facebook/views/profile.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Blueprint, render_template

profile = Blueprint(<span class="hljs-string">&apos;profile&apos;</span>, __name__)

<span class="hljs-meta">@profile.route(&apos;/&lt;user_url_slug&gt;&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">timeline</span><span class="hljs-params">(user_url_slug)</span>:</span>
    <span class="hljs-comment"># &#x646;&#x646;&#x641;&#x630; &#x628;&#x639;&#x636; &#x627;&#xFEF7;&#x634;&#x64A;&#x627;&#x621; &#x647;&#x646;&#x627;</span>
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;profile/timeline.html&apos;</span>)

<span class="hljs-meta">@profile.route(&apos;/&lt;user_url_slug&gt;/photos&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">photos</span><span class="hljs-params">(user_url_slug)</span>:</span>
    <span class="hljs-comment"># &#x646;&#x646;&#x641;&#x630; &#x628;&#x639;&#x636; &#x627;&#xFEF7;&#x634;&#x64A;&#x627;&#x621; &#x647;&#x646;&#x627;</span>
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;profile/photos.html&apos;</span>)

<span class="hljs-meta">@profile.route(&apos;/&lt;user_url_slug&gt;/about&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">about</span><span class="hljs-params">(user_url_slug)</span>:</span>
    <span class="hljs-comment"># &#x646;&#x646;&#x641;&#x630; &#x628;&#x639;&#x636; &#x627;&#xFEF7;&#x634;&#x64A;&#x627;&#x621; &#x647;&#x646;&#x627;</span>
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;profile/about.html&apos;</span>)
</code></pre>
<p>&#x644;&#x625;&#x646;&#x634;&#x627;&#x621; &#x643;&#x627;&#x626;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x60C; &#x646;&#x642;&#x648;&#x645; &#x628;&#x627;&#x633;&#x62A;&#x64A;&#x631;&#x627;&#x62F; &#x627;&#x644;&#x635;&#x646;&#x641; <code>()Blueprint</code> &#x648;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x647;&#x64A;&#x626;&#x62A;&#x647; &#x628;&#x627;&#x644;&#x645;&#x639;&#x627;&#x645;&#x644;&#x627;&#x62A; <code>name</code> &#x648; <code>import_name</code>. &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x62A;&#x64F;&#x633;&#x646;&#x64E;&#x62F; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; <code>__name__</code> &#x644;&#x644;&#x645;&#x639;&#x627;&#x645;&#x644; <code>import_name</code> &#x648;&#x62D;&#x633;&#x628;. &#x62A;&#x64F;&#x639;&#x64E;&#x62F; &#x647;&#x630;&#x647; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; &#x645;&#x62A;&#x63A;&#x64A;&#x651;&#x631; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x645;&#x646; &#x627;&#x644;&#x646;&#x648;&#x639; &#x627;&#x644;&#x62E;&#x627;&#x635; &#x64A;&#x62D;&#x648;&#x64A; &#x627;&#x633;&#x645; &#x627;&#x644;&#x648;&#x62D;&#x62F;&#x629; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A;&#x629;.</p>
<p>&#x644;&#x642;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x646;&#x627; &#x641;&#x64A; &#x645;&#x62B;&#x627;&#x644; &quot;&#x627;&#x644;&#x641;&#x64A;&#x633; &#x628;&#x648;&#x643;&quot; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;&#x629;. &#x641;&#x625;&#x630;&#x627; &#x643;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x646;&#x627; &#x627;&#x644;&#x647;&#x64A;&#x644;&#x643;&#x629; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629; &#x644;&#x643;&#x64F;&#x646;&#x651;&#x627; &#x623;&#x62E;&#x628;&#x631;&#x646;&#x627; &#x641;&#x644;&#x627;&#x633;&#x643; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x64A;&#x645;&#x62A;&#x644;&#x643; &#x62F;&#x644;&#x64A;&#x644; &#x644;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x648;&#x622;&#x62E;&#x631; &#x644;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x62E;&#x627;&#x635; &#x628;&#x647;. &#x62A;&#x638;&#x647;&#x631; &#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x643;&#x64A;&#x641; &#x64A;&#x62A;&#x645; &#x630;&#x644;&#x643;.</p>
<pre><code class="lang-python">profile = Blueprint(<span class="hljs-string">&apos;profile&apos;</span>, __name__,
                    template_folder=<span class="hljs-string">&apos;templates&apos;</span>,
                    static_folder=<span class="hljs-string">&apos;static&apos;</span>)
</code></pre>
<p>&#x628;&#x639;&#x62F; &#x623;&#x646; &#x642;&#x645;&#x646;&#x627; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x60C; &#x64A;&#x62C;&#x628; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x647; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># facebook/__init__.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask
<span class="hljs-keyword">from</span> .views.profile <span class="hljs-keyword">import</span> profile

app = Flask(__name__)
app.register_blueprint(profile)
</code></pre>
<p>&#x627;&#xFEF5;&#x646; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x631;&#x64E;&#x641;&#x650;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>facebook/views/profile.py</em> (&#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; <code>&lt;user_url_slug&gt;/</code>) &#x623;&#x635;&#x628;&#x62D;&#x62A; &#x645;&#x64F;&#x633;&#x62C;&#x644;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x648;&#x633;&#x62A;&#x639;&#x645;&#x644; &#x643;&#x645;&#x627; &#x644;&#x648; &#x643;&#x627;&#x646;&#x62A; &#x645;&#x64F;&#x639;&#x631;&#x641;&#x650;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x632;&#x62E;&#x631;&#x650;&#x641; <code>()app.route@</code>.</p>
<h3 id="&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;-&#x628;&#x627;&#x62F;&#x650;&#x626;&#x629;-&#x631;&#x648;&#x627;&#x628;&#x637;-&#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629;">&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x628;&#x627;&#x62F;&#x650;&#x626;&#x629; &#x631;&#x648;&#x627;&#x628;&#x637; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629;</h3>
<p>&#x628;&#x627;&#x644;&#x625;&#x643;&#x645;&#x627;&#x644; &#x645;&#x639; &#x645;&#x62B;&#x627;&#x644; &#x627;&#x644;&#x641;&#x64A;&#x633; &#x628;&#x648;&#x643;&#x60C; &#x646;&#x644;&#x627;&#x62D;&#x638; &#x643;&#x64A;&#x641; &#x623;&#x646; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62A;&#x639;&#x644;&#x642;&#x629; &#x628;&#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A; &#x62A;&#x628;&#x62F;&#x623; &#x628;&#x627;&#x644;&#x62C;&#x632;&#x621; <code>&lt;user_url_slug&gt;</code> &#x648;&#x62A;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x645;&#x631;&#x64A;&#x631; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; &#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x639;&#x631;&#x636;. &#x646;&#x631;&#x64A;&#x62F; &#x627;&#xFEF5;&#x646; &#x623;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x642;&#x627;&#x62F;&#x631;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x644;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x627;&#x644;&#x630;&#x647;&#x627;&#x628; &#x625;&#x644;&#x649; &#x639;&#x646;&#x648;&#x627;&#x646; &#x645;&#x62B;&#x644; <em><a href="https://facebo-ok.com/john.doe" target="_blank">https://facebo-ok.com/john.doe</a></em>. &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x644;&#x62A;&#x648;&#x642;&#x641; &#x639;&#x646; &#x62A;&#x643;&#x631;&#x627;&#x631; &#x630;&#x644;&#x643; &#x627;&#x644;&#x62C;&#x632;&#x621; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x628;&#x627;&#x62F;&#x626;&#x629; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629; &#x644;&#x62C;&#x645;&#x64A;&#x639; &#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;.</p>
<p>&#x62A;&#x62A;&#x64A;&#x62D; &#x644;&#x646;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x628;&#x627;&#x62F;&#x626;&#x627;&#x62A; &#x62B;&#x627;&#x628;&#x62A;&#x629; &#x648;&#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629;. &#x62D;&#x64A;&#x62B; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x625;&#x62E;&#x628;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643; &#x623;&#x646; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x623;&#x646; &#x62A;&#x628;&#x62F;&#x623; &#x628;&#x640; <em>profile/</em> &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x648;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A; &#x62A;&#x633;&#x645;&#x649; &#x647;&#x630;&#x647; &#x627;&#x644;&#x628;&#x627;&#x626;&#x62F;&#x629; &#x628;&#x627;&#x644;&#x62B;&#x627;&#x628;&#x62A;&#x629;. &#x641;&#x64A; &#x62D;&#x627;&#x644;&#x629; &#x645;&#x62B;&#x627;&#x644; &#x627;&#x644;&#x641;&#x64A;&#x633; &#x628;&#x648;&#x643;&#x60C; &#x633;&#x62A;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x629; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x62A;&#x635;&#x641;&#x62D;&#x647;. &#x628;&#x62D;&#x64A;&#x62B; &#x623;&#x64A;&#x627;&#x64B; &#x643;&#x627;&#x646; &#x627;&#x644;&#x646;&#x635; &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x62E;&#x62A;&#x627;&#x631;&#x647; &#x641;&#x647;&#x648; &#x633;&#x628;&#x64A;&#x643;&#x629; &#x631;&#x627;&#x628;&#x637; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x646;&#x639;&#x631;&#x636;&#x647;&#x60C; &#x648;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A; &#x62A;&#x633;&#x645;&#x649; &#x647;&#x630;&#x647; &#x628;&#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x629; &#x627;&#x644;&#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629;.</p>
<p>&#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; &#x645;&#x62A;&#x631;&#x648;&#x643; &#x644;&#x646;&#x627; &#x641;&#x64A; &#x645;&#x643;&#x627;&#x646; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x629;. &#x62D;&#x64A;&#x62B; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x631;&#x64A;&#x641;&#x647;&#x627; &#x641;&#x64A; &#x645;&#x648;&#x636;&#x639; &#x645;&#x646; &#x625;&#x62B;&#x646;&#x64A;&#x646;: &#x625;&#x645;&#x627; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x647;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x635;&#x646;&#x641; <code>()Blueprint</code> &#x623;&#x648; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x647; &#x641;&#x64A; <code>()app.register_blueprint</code>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># facebook/views/profile.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Blueprint, render_template

profile = Blueprint(<span class="hljs-string">&apos;profile&apos;</span>, __name__, url_prefix=<span class="hljs-string">&apos;/&lt;user_url_slug&gt;&apos;</span>)

<span class="hljs-comment"># [...]</span>
</code></pre>
<pre><code class="lang-python"><span class="hljs-comment"># facebook/__init__.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask
<span class="hljs-keyword">from</span> .views.profile <span class="hljs-keyword">import</span> profile

app = Flask(__name__)
app.register_blueprint(profile, url_prefix=<span class="hljs-string">&apos;/&lt;user_url_slug&gt;&apos;</span>)
</code></pre>
<p>&#x641;&#x64A; &#x62D;&#x64A;&#x646; &#x623;&#x646;&#x647; &#x644;&#x627; &#x62A;&#x648;&#x62C;&#x62F; &#x623;&#x64A;&#x629; &#x62D;&#x62F;&#x648;&#x62F; &#x62A;&#x642;&#x646;&#x64A;&#x651;&#x64E;&#x629; &#x644;&#x643;&#x644;&#x62A;&#x627; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x62A;&#x64A;&#x646;&#x60C; &#x641;&#x645;&#x646; &#x627;&#x644;&#x62C;&#x645;&#x64A;&#x644; &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62A;&#x648;&#x641;&#x631;&#x629; &#x641;&#x64A; &#x646;&#x641;&#x633; &#x627;&#x644;&#x645;&#x644;&#x641;. &#x647;&#x630;&#x627; &#x64A;&#x62C;&#x639;&#x644; &#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x644; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621; &#x645;&#x646; &#x645;&#x633;&#x62A;&#x648;&#x649; &#x639;&#x627;&#x644;&#x64D; (&#x645;&#x643;&#x627;&#x646; &#x648;&#x627;&#x62D;&#x62F; &#x644;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x643;&#x644; &#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x627;&#x62A;). &#x644;&#x647;&#x630;&#x627; &#x627;&#x644;&#x633;&#x628;&#x628;&#x60C; &#x623;&#x646;&#x635;&#x62D; &#x628;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x628;&#x627;&#x62F;&#x650;&#x626;&#x627;&#x62A; &#x639;&#x646;&#x62F; &#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;.</p>
<p>&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x62D;&#x648;&#x644;&#x627;&#x62A; &#x644;&#x625;&#x646;&#x634;&#x627;&#x621; &#x628;&#x627;&#x62F;&#x626;&#x629; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629;&#x60C; &#x643;&#x645;&#x627; &#x643;&#x64F;&#x646;&#x651;&#x64E;&#x627; &#x646;&#x641;&#x639;&#x644; &#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x627;&#x644;&#x645;&#x64F;&#x632;&#x62E;&#x631;&#x650;&#x641; <code>()route</code>. &#x647;&#x630;&#x627; &#x64A;&#x62A;&#x636;&#x645;&#x646; &#x623;&#x64A; &#x645;&#x62D;&#x648;&#x644; &#x645;&#x64F;&#x62E;&#x635;&#x635; &#x642;&#x645;&#x646;&#x627; &#x628;&#x625;&#x646;&#x634;&#x627;&#x621;&#x647;. &#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x62D;&#x648;&#x644;&#x627;&#x62A;&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x645;&#x639;&#x627;&#x644;&#x62C;&#x629; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x637;&#x627;&#x629; &#x642;&#x628;&#x644; &#x62A;&#x633;&#x644;&#x64A;&#x645;&#x647;&#x627; &#x625;&#x644;&#x649; &#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x639;&#x631;&#x636;. &#x641;&#x64A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; &#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x625;&#x644;&#x649; &#x62A;&#x62D;&#x62F;&#x64A;&#x62F; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x643;&#x629; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x645;&#x631;&#x631;&#x629; &#x625;&#x644;&#x649; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x627;&#x644;&#x62E;&#x627;&#x635; &#x628;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A;&#x629;. &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647;&#x630;&#x627; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x632;&#x62E;&#x631;&#x64E;&#x641;&#x650;&#x629; &#x62F;&#x627;&#x644;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>()url_value_preprocessor</code>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># facebook/views/profile.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Blueprint, render_template, g

<span class="hljs-keyword">from</span> ..models <span class="hljs-keyword">import</span> User

<span class="hljs-comment"># facebook/__init__.py &#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x629; &#x645;&#x639;&#x631;&#x641;&#x629; &#x639;&#x646;&#x62F; &#x627;&#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x641;&#x64A; &#x645;&#x644;&#x641;</span>
profile = Blueprint(<span class="hljs-string">&apos;profile&apos;</span>, __name__)

<span class="hljs-meta">@profile.url_value_preprocessor</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">get_profile_owner</span><span class="hljs-params">(endpoint, values)</span>:</span>
    query = User.query.filter_by(url_slug=values.pop(<span class="hljs-string">&apos;user_url_slug&apos;</span>))
    g.profile_owner = query.first_or_404()

<span class="hljs-meta">@profile.route(&apos;/&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">timeline</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;profile/timeline.html&apos;</span>)

<span class="hljs-meta">@profile.route(&apos;/photos&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">photos</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;profile/photos.html&apos;</span>)

<span class="hljs-meta">@profile.route(&apos;/about&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">about</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;profile/about.html&apos;</span>)
</code></pre>
<p>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x646;&#x627; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646; <code>g</code> &#x644;&#x62A;&#x62E;&#x632;&#x64A;&#x646; &#x645;&#x627;&#x644;&#x643; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A;. &#x64A;&#x62A;&#x648;&#x641;&#x631; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646; <code>g</code> &#x641;&#x64A; &#x633;&#x64A;&#x627;&#x642; &#x642;&#x627;&#x644;&#x628; (Template Context) &#x62C;&#x64A;&#x646;&#x62C;&#x627;2. &#x645;&#x645;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x623;&#x646; &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647; &#x647;&#x648; &#x639;&#x631;&#x636; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x648;&#x633;&#x62A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x646;&#x62D;&#x62A;&#x627;&#x62C;&#x647;&#x627; &#x641;&#x64A;&#x647;.</p>
<pre><code class="lang-python">{<span class="hljs-comment"># facebook/templates/profile/photos.html #}</span>

{% extends <span class="hljs-string">&quot;profile/layout.html&quot;</span> %}

{% <span class="hljs-keyword">for</span> photo <span class="hljs-keyword">in</span> g.profile_owner.photos.all() %}
    &lt;img src=<span class="hljs-string">&quot;{{ photo.source_url }}&quot;</span> alt=<span class="hljs-string">&quot;{{ photo.alt_text }}&quot;</span> /&gt;
{% endfor %}
</code></pre>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x648;&#x62C;&#x62F; &#x641;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643; <a href="http://flask.pocoo.org/docs/patterns/urlprocessors/#internationalized-blueprint-urls" target="_blank">&#x62F;&#x631;&#x633; &#x631;&#x627;&#x626;&#x639;</a> &#x62D;&#x648;&#x644; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x627;&#x62A; &#x644;&#x62A;&#x62F;&#x648;&#x64A;&#x644; &#x627;&#x644;&#x631;&#x648;&#x627;&#x628;&#x637;.
</blockquote>

<h3 id="&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;-&#x646;&#x637;&#x627;&#x642;-&#x641;&#x631;&#x639;&#x64A;-&#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;">&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x646;&#x637;&#x627;&#x642; &#x641;&#x631;&#x639;&#x64A; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;</h3>
<p>&#x62A;&#x648;&#x641;&#x631; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; SaaS (&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x643;&#x62E;&#x62F;&#x645;&#x629;) &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x64A;&#x627;&#x645; &#x646;&#x637;&#x627;&#x642; &#x641;&#x631;&#x639;&#x64A; &#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x647;&#x627; &#x644;&#x64A;&#x62A;&#x645;&#x643;&#x646;&#x648;&#x627; &#x645;&#x646; &#x627;&#x644;&#x648;&#x635;&#x648;&#x644; &#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A;&#x647;&#x645;. &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x647;&#x627;&#x631;&#x641;&#x633;&#x62A; (Harvest) &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x648;&#x627;&#x644;&#x630;&#x64A; &#x647;&#x648; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x645;&#x631;&#x627;&#x642;&#x628;&#x629; (&#x62A;&#x62A;&#x628;&#x639;) &#x627;&#x644;&#x648;&#x642;&#x62A; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x634;&#x627;&#x631;&#x64A;&#x64A;&#x646;&#x60C; &#x64A;&#x633;&#x645;&#x62D; &#x644;&#x643; &#x628;&#x627;&#x644;&#x648;&#x635;&#x648;&#x644; &#x644;&#x644;&#x648;&#x62D;&#x629; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x645;&#x646; &#x627;&#x644;&#x631;&#x627;&#x628;&#x637; yourname.harvestapp.com. &#x633;&#x646;&#x639;&#x631;&#x636; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x642;&#x633;&#x645; &#x643;&#x64A;&#x641;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x646;&#x637;&#x627;&#x642; &#x641;&#x631;&#x639;&#x64A; &#x645;&#x648;&#x651;&#x64E;&#x644;&#x62F; &#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x627;&#x64B; &#x643;&#x647;&#x630;&#x627;.</p>
<p>&#x633;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x641;&#x635;&#x644; &#x645;&#x62B;&#x627;&#x644; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x64A;&#x62A;&#x64A;&#x62D; &#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x647; &#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x648;&#x627;&#x642;&#x639; &#x62E;&#x627;&#x635;&#x629; &#x628;&#x647;&#x645;. &#x62A;&#x62E;&#x64A;&#x644; &#x623;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x630;&#x644;&#x643; &#x641;&#x64A;&#x647; &#x62B;&#x644;&#x627;&#x62B; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x644;&#x623;&#x642;&#x633;&#x627;&#x645; &#x645;&#x633;&#x62A;&#x642;&#x644;&#x629;: &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A;&#x629; &#x62D;&#x64A;&#x62B; &#x64A;&#x644;&#x650;&#x62C; (&#x64A;&#x642;&#x648;&#x645;&#x648;&#x646; &#x628;&#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644;) &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x648;&#x646;&#x60C; &#x648;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x62D;&#x64A;&#x62B; &#x64A;&#x628;&#x646;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x648;&#x646; &#x645;&#x648;&#x627;&#x642;&#x639;&#x647;&#x645; &#x648;&#x62D;&#x64A;&#x62B; &#x62A;&#x64F;&#x633;&#x62A;&#x636;&#x627;&#x641;. &#x648;&#x628;&#x645;&#x627; &#x623;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x642;&#x633;&#x627;&#x645; &#x63A;&#x64A;&#x631; &#x645;&#x631;&#x62A;&#x628;&#x637;&#x629; &#x628;&#x628;&#x639;&#x636;&#x647;&#x627;&#x60C; &#x641;&#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x645;&#x648;&#x642;&#x639; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629;.</p>
<pre><code>sitemaker/
    __init__.py
    home/
        __init__.py
        views.py
        templates/
            home/
        static/
            home/
    dash/
        __init__.py
        views.py
        templates/
            dash/
        static/
            dash/
    site/
        __init__.py
        views.py
        templates/
            site/
        static/
            site/
    models.py
</code></pre><p>&#x64A;&#x634;&#x631;&#x62D; &#x627;&#x644;&#x62C;&#x62F;&#x648;&#x644; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x629; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;.</p>
<table>
<thead>
<tr>
<th>&#x627;&#x644;&#x631;&#x627;&#x628;&#x637;</th>
<th>&#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;</th>
<th>&#x627;&#x644;&#x634;&#x631;&#x62D;</th>
</tr>
</thead>
<tbody>
<tr>
<td>sitemaker.com</td>
<td><em>sitemaker/home</em></td>
<td>&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x639;&#x627;&#x62F;&#x64A;. &#x64A;&#x62D;&#x648;&#x64A; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;&#x60C; &#x648;&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x644;&#x635;&#x641;&#x62D;&#x629; <em>index.html</em>&#x60C; &#x648; <em>about.html</em> &#x648;&#x644;&#x635;&#x641;&#x62D;&#x629; <em>pricing.html</em>.</td>
</tr>
<tr>
<td>bigdaddy.sitemaker.com</td>
<td><em>sitemaker/site</em></td>
<td>&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x646;&#x637;&#x627;&#x642; &#x641;&#x631;&#x639;&#x64A; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A; &#x648;&#x64A;&#x64F;&#x636;&#x645;&#x651;&#x650;&#x646; &#x639;&#x646;&#x627;&#x635;&#x631; &#x645;&#x648;&#x642;&#x639; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645;. &#x633;&#x646;&#x62A;&#x643;&#x644;&#x645; &#x644;&#x627;&#x62D;&#x642;&#x627;&#x64B; &#x639;&#x646; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x629; &#x644;&#x62A;&#x646;&#x641;&#x64A;&#x630; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;.</td>
</tr>
<tr>
<td>bigdaddy.sitemaker.com/admin</td>
<td><em>sitemaker/dash</em></td>
<td>&#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x623;&#x646; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x643;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x637;&#x627;&#x642; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A; &#x627;&#x644;&#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A; &#x648;&#x628;&#x627;&#x62F;&#x626;&#x629; &#x627;&#x644;&#x631;&#x627;&#x628;&#x637; &#x645;&#x646; &#x62E;&#x644;&#x627;&#x644; &#x62F;&#x645;&#x62C; &#x627;&#x644;&#x62A;&#x642;&#x646;&#x64A;&#x627;&#x62A; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x642;&#x633;&#x645; &#x645;&#x639; &#x627;&#x644;&#x62A;&#x642;&#x646;&#x64A;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x633;&#x645; &#x627;&#x644;&#x633;&#x627;&#x628;&#x642;.</td>
</tr>
</tbody>
</table>
<p>&#x646;&#x633;&#x62A;&#x637;&#x64A;&#x639; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x646;&#x637;&#x627;&#x642; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A; &#x628;&#x646;&#x641;&#x633; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x639;&#x631;&#x641;&#x646;&#x627; &#x628;&#x647;&#x627; &#x627;&#x644;&#x628;&#x648;&#x627;&#x62F;&#x626; &#x633;&#x627;&#x628;&#x642;&#x627;&#x64B;. &#x643;&#x644;&#x627; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631;&#x64A;&#x646; &#x645;&#x62A;&#x627;&#x62D;&#x64A;&#x646; (&#x633;&#x648;&#x627;&#x621;&#x64B; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x627;&#x644;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x623;&#x648; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <i>init</i><i>__</i><i>.py</i><i>__</i> &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x62C;&#x630;&#x631;)&#x60C; &#x648;&#x644;&#x643;&#x646; &#x645;&#x62C;&#x62F;&#x62F;&#x627;&#x64B; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x627;&#x644;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>sitemaker/__init__.py</em>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># sitemaker/__init__.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask
<span class="hljs-keyword">from</span> .site <span class="hljs-keyword">import</span> site

app = Flask(__name__)
app.register_blueprint(site, subdomain=<span class="hljs-string">&apos;&lt;site_subdomain&gt;&apos;</span>)
</code></pre>
<p>&#x648;&#x641;&#x64A; &#x62D;&#x64A;&#x646; &#x623;&#x646;&#x646;&#x627; &#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629;&#x60C; &#x641;&#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>sitemaker/site/__init__.py</em>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># sitemaker/site/__init__py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Blueprint

<span class="hljs-keyword">from</span> ..models <span class="hljs-keyword">import</span> Site

site = Blueprint(<span class="hljs-string">&apos;site&apos;</span>, __name__)

<span class="hljs-meta">@site.url_value_preprocessor</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">get_site</span><span class="hljs-params">(endpoint, values)</span>:</span>
    query = Site.query.filter_by(subdomain=values.pop(<span class="hljs-string">&apos;site_subdomain&apos;</span>))
    g.site = query.first_or_404()

<span class="hljs-keyword">from</span> . <span class="hljs-keyword">import</span> views
</code></pre>
<p>&#x627;&#x644;&#x622;&#x646; &#x646;&#x62D;&#x646; &#x646;&#x645;&#x644;&#x643; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x645;&#x646; &#x642;&#x627;&#x639;&#x62F; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x647;&#x627; &#x644;&#x639;&#x631;&#x636; &#x645;&#x648;&#x642;&#x639; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x644;&#x632;&#x648;&#x627;&#x631; &#x627;&#x644;&#x630;&#x64A;&#x646; &#x64A;&#x642;&#x648;&#x645;&#x648;&#x646; &#x628;&#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x625;&#x644;&#x649; &#x627;&#x644;&#x646;&#x637;&#x627;&#x642; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A;.</p>
<p>&#x644;&#x64A;&#x62A;&#x645;&#x643;&#x646; &#x641;&#x644;&#x627;&#x633;&#x643; &#x645;&#x646; &#x627;&#x644;&#x639;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x646;&#x637;&#x627;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A;&#x629;&#x60C; &#x64A;&#x62C;&#x628; &#x639;&#x644;&#x64A;&#x643; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; <code>SERVER_NAME</code>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># config.py</span>

SERVER_NAME = <span class="hljs-string">&apos;sitemaker.com&apos;</span>
</code></pre>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x645;&#x646;&#x630; &#x628;&#x636;&#x639;&#x629; &#x62F;&#x642;&#x627;&#x626;&#x642;&#x60C; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x643;&#x646;&#x62A; &#x623;&#x635;&#x64A;&#x63A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x642;&#x633;&#x645;&#x60C; &#x642;&#x627;&#x644; &#x623;&#x62D;&#x62F;&#x647;&#x645; &#x641;&#x64A; &#x642;&#x646;&#x627;&#x629; IRC &#x623;&#x646; &#x646;&#x637;&#x627;&#x642;&#x627;&#x62A;&#x647; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A;&#x629; &#x643;&#x627;&#x646;&#x62A; &#x62A;&#x639;&#x645;&#x644; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x648;&#x644;&#x643;&#x646;&#x647;&#x627; &#x62A;&#x648;&#x642;&#x641;&#x62A; &#x639;&#x646; &#x627;&#x644;&#x639;&#x645;&#x644; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x633;&#x623;&#x644;&#x62A;&#x647; &#x639;&#x645;&#x651;&#x64E;&#x627; &#x625;&#x630;&#x627; &#x642;&#x627;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631; <code>SERVER_NAME</code>&#x60C; &#x641;&#x62A;&#x628;&#x64A;&#x651;&#x646; &#x623;&#x646;&#x647; &#x643;&#x627;&#x646; &#x642;&#x62F; &#x639;&#x631;&#x651;&#x64E;&#x641; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x648;&#x644;&#x643;&#x646;&#x647; &#x644;&#x645; &#x64A;&#x641;&#x639;&#x644; &#x630;&#x644;&#x643; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x648;&#x628;&#x639;&#x62F;&#x647;&#x627; &#x642;&#x627;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641;&#x647; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C; &#x648;&#x627;&#x646;&#x62A;&#x647;&#x62A; &#x627;&#x644;&#x645;&#x634;&#x643;&#x644;&#x629;.
<br><br>
&#x64A;&#x645;&#x643;&#x646;&#x643; &#x631;&#x624;&#x64A;&#x629; &#x627;&#x644;&#x645;&#x62D;&#x627;&#x62F;&#x62B;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62F;&#x627;&#x631;&#x62A; &#x628;&#x64A;&#x646;&#x64A; (&#x627;&#x633;&#x645;&#x64A; imrobert &#x641;&#x64A; &#x627;&#x644;&#x633;&#x62C;&#x644;) &#x648;&#x628;&#x64A;&#x646; aplavin (&#x627;&#x644;&#x627;&#x633;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x639;&#x627;&#x631; &#x644;&#x635;&#x627;&#x62D;&#x628; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x641;&#x633;&#x627;&#x631;) <a href="http://dev.pocoo.org/irclogs/%23pocoo.2013-07-30.log" target="_blank">&#x645;&#x646; &#x647;&#x646;&#x627;</a>.
<br><br>
&#x643;&#x627;&#x646;&#x62A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x635;&#x627;&#x62F;&#x641;&#x629; &#x643;&#x627;&#x641;&#x64A;&#x629; &#x644;&#x62C;&#x639;&#x644;&#x64A; &#x623;&#x638;&#x646; &#x623;&#x646;&#x647; &#x64A;&#x62C;&#x628; &#x625;&#x62F;&#x631;&#x627;&#x62C; &#x647;&#x630;&#x647; &#x627;&#x644;&#x646;&#x642;&#x637;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x641;&#x635;&#x644;.
</blockquote>

<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x645;&#x643;&#x646;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x643;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x637;&#x627;&#x642; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A; &#x648;&#x627;&#x644;&#x628;&#x627;&#x62F;&#x626;&#x629; &#x645;&#x639;&#x627;&#x64B;. &#x641;&#x643;&#x651;&#x64E;&#x631; &#x641;&#x64A; &#x643;&#x64A;&#x641; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <i>sitemaker/dash</i> &#x644;&#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x628;&#x646;&#x64A;&#x651;&#x64E;&#x629; &#x627;&#x644;&#x631;&#x627;&#x628;&#x637; &#x627;&#x644;&#x645;&#x628;&#x64A;&#x651;&#x646;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x62C;&#x62F;&#x648;&#x644; &#x627;&#x644;&#x633;&#x627;&#x628;&#x642;.
</blockquote>

<h2 id="&#x625;&#x639;&#x627;&#x62F;&#x629;-&#x647;&#x64A;&#x643;&#x644;&#x629;-&#x62A;&#x646;&#x638;&#x64A;&#x645;-&#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A;-&#x627;&#x644;&#x635;&#x63A;&#x64A;&#x631;&#x629;-&#x644;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645;-&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;">&#x625;&#x639;&#x627;&#x62F;&#x629; &#x647;&#x64A;&#x643;&#x644;&#x629; (&#x62A;&#x646;&#x638;&#x64A;&#x645;) &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x635;&#x63A;&#x64A;&#x631;&#x629; &#x644;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;</h2>
<p>&#x623;&#x648;&#x62F; &#x623;&#x646; &#x623;&#x62A;&#x642;&#x62F;&#x645; &#x628;&#x645;&#x62B;&#x627;&#x644; &#x645;&#x64F;&#x62E;&#x62A;&#x635;&#x64E;&#x631; &#x639;&#x646; &#x627;&#x644;&#x62E;&#x637;&#x648;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x62A;&#x62E;&#x627;&#x630;&#x647;&#x627; &#x644;&#x62A;&#x62D;&#x648;&#x64A;&#x644; &#x623;&#x62D;&#x62F; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x644;&#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;. &#x633;&#x646;&#x628;&#x62F;&#x623; &#x645;&#x639; &#x625;&#x639;&#x627;&#x62F;&#x629; &#x647;&#x64A;&#x643;&#x644;&#x629; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x641;&#x644;&#x627;&#x633;&#x643; &#x646;&#x645;&#x648;&#x630;&#x62C;&#x64A; (&#x639;&#x627;&#x62F;&#x64A;).</p>
<pre><code>config.txt
requirements.txt
run.py
U2FtIEJsYWNr/
  __init__.py
  views.py
  models.py
  templates/
  static/
tests/
</code></pre><p>&#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x645;&#x644;&#x641; <em>views.py</em> &#x639;&#x644;&#x649; &#x645;&#x627; &#x64A;&#x632;&#x64A;&#x62F; &#x639;&#x646; 10,000 &#x633;&#x637;&#x631; &#x645;&#x646; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;! &#x644;&#x642;&#x62F; &#x642;&#x645;&#x646;&#x627; &#x628;&#x62A;&#x623;&#x62E;&#x64A;&#x631; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x625;&#x639;&#x627;&#x62F;&#x629; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x627;&#x644;&#x648;&#x642;&#x62A; &#x642;&#x62F; &#x62D;&#x627;&#x646;. &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; &#x639;&#x644;&#x649; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x644;&#x643;&#x644; &#x62C;&#x632;&#x621; &#x645;&#x646; &#x627;&#x644;&#x645;&#x648;&#x642;&#x639;. &#x627;&#x644;&#x623;&#x642;&#x633;&#x627;&#x645; &#x647;&#x64A;: &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A;&#x629;&#x60C; &#x648;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x60C; &#x648;&#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x634;&#x631;&#x650;&#x641;&#x60C; &#x648;&#x627;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; (API)&#x60C; &#x648;&#x645;&#x62F;&#x648;&#x646;&#x629; &#x627;&#x644;&#x634;&#x631;&#x643;&#x629;.</p>
<h3 id="&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629;-&#x627;&#x644;&#x623;&#x648;&#x644;&#x649;-&#x647;&#x644;-&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645;-&#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629;-&#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;&#x629;-&#x623;&#x645;-&#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629;&#x61F;">&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x627;&#x644;&#x623;&#x648;&#x644;&#x649;: &#x647;&#x644; &#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;&#x629; &#x623;&#x645; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629;&#x61F;</h3>
<p>&#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x645;&#x635;&#x646;&#x648;&#x639; &#x645;&#x646; &#x623;&#x62C;&#x632;&#x627;&#x621; &#x645;&#x646;&#x641;&#x635;&#x644;&#x629; &#x639;&#x646; &#x628;&#x639;&#x636;&#x647;&#x627; &#x628;&#x634;&#x643;&#x644; &#x643;&#x628;&#x64A;&#x631;. &#x62D;&#x64A;&#x62B; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x645;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x631;&#x62C;&#x651;&#x64E;&#x62D; &#x623;&#x646;&#x647;&#x627; &#x644;&#x646; &#x64A;&#x62A;&#x64F;&#x645; &#x645;&#x64F;&#x634;&#x627;&#x631;&#x643;&#x62A;&#x64F;&#x647;&#x627; &#x628;&#x64A;&#x646; &#x644;&#x648;&#x62D;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x648;&#x645;&#x62F;&#x648;&#x646;&#x629; &#x627;&#x644;&#x634;&#x631;&#x643;&#x629;&#x60C; &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;. &#x644;&#x630;&#x644;&#x643; &#x633;&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x629; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629;.</p>
<h3 id="&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629;-&#x627;&#x644;&#x62B;&#x627;&#x646;&#x64A;&#x629;-&#x646;&#x642;&#x644;-&#x628;&#x639;&#x636;-&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A;">&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x627;&#x644;&#x62B;&#x627;&#x646;&#x64A;&#x629;: &#x646;&#x642;&#x644; &#x628;&#x639;&#x636; &#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A;</h3>
<blockquote>
<b>&#x62A;&#x62D;&#x630;&#x64A;&#x631;</b><br>
&#x642;&#x645; &#x628;&#x625;&#x64A;&#x62F;&#x627;&#x639; &#x643;&#x644; &#x634;&#x64A;&#x621; &#x625;&#x644;&#x649; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x642;&#x628;&#x644; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x623;&#x64A;&#x629; &#x62A;&#x63A;&#x64A;&#x64A;&#x631;&#x627;&#x62A; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;&#x60C; &#x641;&#x623;&#x646;&#x62A; &#x644;&#x627; &#x62A;&#x631;&#x64A;&#x62F; &#x62D;&#x630;&#x641; &#x623;&#x64A; &#x634;&#x64A;&#x621; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x627;&#x644;&#x62E;&#x637;&#x623;.
</blockquote>

<p>&#x633;&#x646;&#x642;&#x648;&#x645; &#x627;&#x644;&#x622;&#x646; &#x628;&#x625;&#x646;&#x634;&#x627;&#x621; &#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62F;&#x644;&#x627;&#x626;&#x644; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;. &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x644;&#x628;&#x62F;&#x621; &#x628;&#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x62C;&#x644;&#x62F; &#x644;&#x643;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x628;&#x62F;&#x627;&#x62E;&#x644; &#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629;. &#x648;&#x645;&#x646; &#x62B;&#x645; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x646;&#x633;&#x62E; &#x627;&#x644;&#x645;&#x644;&#x641; <em>views.py</em> &#x648;&#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>/static</em> &#x648; <em>/templates</em> &#x625;&#x644;&#x649; &#x643;&#x644; &#x62F;&#x644;&#x64A;&#x644; &#x645;&#x646; &#x627;&#x644;&#x630;&#x64A;&#x646; &#x623;&#x646;&#x634;&#x623;&#x646;&#x627;&#x647;&#x645;. &#x648;&#x628;&#x639;&#x62F;&#x647;&#x627; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62D;&#x630;&#x641;&#x647;&#x645; &#x645;&#x646; &#x62C;&#x630;&#x631; &#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629;.</p>
<pre><code>config.txt
requirements.txt
run.py
U2FtIEJsYWNr/
  __init__.py
  home/
    views.py
    static/
    templates/
  dash/
    views.py
    static/
    templates/
  admin/
    views.py
    static/
    templates/
  api/
    views.py
    static/
    templates/
  blog/
    views.py
    static/
    templates/
  models.py
tests/
</code></pre><h3 id="&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629;-&#x627;&#x644;&#x62B;&#x627;&#x644;&#x62B;&#x629;-&#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644;-&#x641;&#x64A;-&#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x651;&#x64E;&#x629;">&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x627;&#x644;&#x62B;&#x627;&#x644;&#x62B;&#x629;: &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x641;&#x64A; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x651;&#x64E;&#x629;</h3>
<p>&#x627;&#x644;&#x622;&#x646; &#x633;&#x646;&#x62F;&#x62E;&#x644; &#x625;&#x644;&#x649; &#x643;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x648;&#x633;&#x646;&#x62D;&#x630;&#x641; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x648;&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x627;&#x644;&#x63A;&#x64A;&#x631; &#x645;&#x62A;&#x639;&#x644;&#x642;&#x629; &#x628;&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;. &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x645;&#x639;&#x62A;&#x645;&#x62F;&#x629; &#x628;&#x634;&#x643;&#x644; &#x643;&#x628;&#x64A;&#x631; &#x639;&#x644;&#x649; &#x643;&#x64A;&#x641;&#x64A;&#x629; &#x642;&#x64A;&#x627;&#x645;&#x643; &#x628;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x645;&#x646;&#x630; &#x627;&#x644;&#x628;&#x62F;&#x627;&#x64A;&#x629;.</p>
<p>&#x641;&#x64A; &#x627;&#x644;&#x646;&#x647;&#x627;&#x64A;&#x629; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x643;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x639;&#x644;&#x649; &#x645;&#x644;&#x641; <em>views.py</em> &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x62C;&#x645;&#x64A;&#x639; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x627;&#x644;&#x645;&#x62A;&#x639;&#x644;&#x642;&#x629; &#x628;&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;. &#x644;&#x627; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x623;&#x646; &#x64A;&#x64F;&#x639;&#x631;&#x650;&#x641; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x646; &#x62F;&#x627;&#x644;&#x629; &#x639;&#x631;&#x636; &#x644;&#x646;&#x641;&#x633; &#x627;&#x644;&#x645;&#x64F;&#x648;&#x62C;&#x650;&#x647;. &#x643;&#x644; &#x62F;&#x644;&#x64A;&#x644; <em>/templates</em> &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x641;&#x642;&#x637; &#x639;&#x644;&#x649; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629; &#x628;&#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;. &#x643;&#x644; &#x62F;&#x644;&#x64A;&#x644; <em>/static</em> &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x641;&#x642;&#x637; &#x639;&#x644;&#x649; &#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x62A;&#x64F;&#x639;&#x631;&#x64E;&#x636; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x642;&#x645; &#x641;&#x64A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x631;&#x62D;&#x644;&#x629; &#x628;&#x625;&#x632;&#x627;&#x644;&#x629; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x64A;&#x631;&#x627;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x63A;&#x64A;&#x631; &#x636;&#x631;&#x648;&#x631;&#x64A;&#x629;. &#x641;&#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x644; &#x646;&#x633;&#x64A;&#x627;&#x646;&#x647;&#x645;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x641;&#x64A; &#x623;&#x641;&#x636;&#x644; &#x627;&#x644;&#x623;&#x62D;&#x648;&#x627;&#x644; &#x633;&#x64A;&#x642;&#x648;&#x645;&#x648;&#x646; &#x628;&#x62A;&#x644;&#x648;&#x64A;&#x62B; &#x634;&#x64A;&#x641;&#x631;&#x62A;&#x643; &#x648;&#x641;&#x64A; &#x623;&#x633;&#x648;&#x626;&#x647;&#x627; &#x633;&#x64A;&#x642;&#x648;&#x645;&#x648;&#x646; &#x628;&#x625;&#x628;&#x637;&#x627;&#x621; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;.
</blockquote>

<h3 id="&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629;-&#x627;&#x644;&#x631;&#x627;&#x628;&#x639;&#x629;-&#x62A;&#x639;&#x631;&#x64A;&#x641;-&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;">&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x627;&#x644;&#x631;&#x627;&#x628;&#x639;&#x629;: &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;</h3>
<p>&#x641;&#x64A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x631;&#x62D;&#x644;&#x629; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x62D;&#x648;&#x64A;&#x644; &#x627;&#x644;&#x62F;&#x644;&#x627;&#x626;&#x644; &#x627;&#x644;&#x62A;&#x64A; &#x623;&#x646;&#x634;&#x623;&#x646;&#x627;&#x647;&#x627; &#x625;&#x644;&#x649; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A;. &#x628;&#x62F;&#x627;&#x64A;&#x629;&#x64B;&#x60C; &#x62F;&#x639;&#x646;&#x627; &#x646;&#x644;&#x642;&#x64A; &#x646;&#x638;&#x631;&#x629; &#x639;&#x644;&#x649; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x627;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># U2FtIEJsYWNr/api/__init__.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Blueprint

api = Blueprint(
    <span class="hljs-string">&apos;site&apos;</span>,
    __name__,
    template_folder=<span class="hljs-string">&apos;templates&apos;</span>,
    static_folder=<span class="hljs-string">&apos;static&apos;</span>
)

<span class="hljs-keyword">from</span> . <span class="hljs-keyword">import</span> views
</code></pre>
<p>&#x628;&#x639;&#x62F; &#x630;&#x644;&#x643; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <i>init</i><i>__</i><i>.py</i><i>__</i> &#x627;&#x644;&#x62C;&#x630;&#x631; &#x644;&#x644;&#x62D;&#x632;&#x645;&#x629; U2FtIEJsYWNr.</p>
<pre><code class="lang-python"><span class="hljs-comment"># U2FtIEJsYWNr/__init__.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask
<span class="hljs-keyword">from</span> .api <span class="hljs-keyword">import</span> api

app = Flask(__name__)

<span class="hljs-comment"># &#x646;&#x646;&#x634;&#x626; &#x646;&#x637;&#x627;&#x642; &#x641;&#x631;&#x639;&#x64A; &#x644;&#x648;&#x636;&#x639; &#x627;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x644;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x639;&#x644;&#x649; &#x627;&#x644;&#x631;&#x627;&#x628;&#x637; api.U2FtIEJsYWNr.com</span>
app.register_blueprint(api, subdomain=<span class="hljs-string">&apos;api&apos;</span>)
</code></pre>
<p>&#x62A;&#x623;&#x643;&#x62F; &#x623;&#x646; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x622;&#x646; &#x645;&#x64F;&#x633;&#x62C;&#x644;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646; <code>app</code> (&#x623;&#x648; &#x623;&#x64A;&#x627;&#x64B; &#x64A;&#x643;&#x646; &#x645;&#x627; &#x633;&#x645;&#x64A;&#x62A; &#x643;&#x627;&#x626;&#x646; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;).</p>
<pre><code class="lang-python"><span class="hljs-comment"># U2FtIEJsYWNr/views.py</span>

<span class="hljs-keyword">from</span> . <span class="hljs-keyword">import</span> app

<span class="hljs-meta">@app.route(&apos;/search&apos;, subdomain=&apos;api&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">api_search</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">pass</span>
</code></pre>
<pre><code class="lang-python"><span class="hljs-comment"># U2FtIEJsYWNr/api/views.py</span>

<span class="hljs-keyword">from</span> . <span class="hljs-keyword">import</span> api

<span class="hljs-meta">@api.route(&apos;/search&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">search</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">pass</span>
</code></pre>
<h3 id="&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629;-&#x627;&#x644;&#x62E;&#x627;&#x645;&#x633;&#x629;-&#x627;&#x633;&#x62A;&#x645;&#x62A;&#x639;">&#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x627;&#x644;&#x62E;&#x627;&#x645;&#x633;&#x629;: &#x627;&#x633;&#x62A;&#x645;&#x62A;&#x639;</h3>
<p>&#x627;&#x644;&#x622;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x623;&#x643;&#x62B;&#x631; &#x645;&#x639;&#x64A;&#x627;&#x631;&#x64A;&#x651;&#x64E;&#x629; &#x628;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x645;&#x627; &#x643;&#x627;&#x646; &#x639;&#x644;&#x64A;&#x647; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x643;&#x627;&#x646; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x644;&#x641; views.py &#x648;&#x627;&#x62D;&#x62F; &#x636;&#x62E;&#x645;. &#x62A;&#x639;&#x631;&#x64A;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x622;&#x646; &#x623;&#x643;&#x62B;&#x631; &#x628;&#x633;&#x627;&#x637;&#x629;&#x61B; &#x644;&#x623;&#x646;&#x647; &#x628;&#x625;&#x645;&#x643;&#x627;&#x646;&#x646;&#x627; &#x62C;&#x645;&#x639;&#x647;&#x627; &#x645;&#x639;&#x627;&#x64B; &#x641;&#x64A; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x648;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x623;&#x634;&#x64A;&#x627;&#x621; &#x645;&#x62B;&#x644; &#x627;&#x644;&#x646;&#x637;&#x627;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A;&#x629; &#x648;&#x628;&#x648;&#x627;&#x62F;&#x626; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x64A;&#x646; &#x641;&#x64A; &#x643;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;.</p>
<h2 id="&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;">&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;</h2>
<ul style="list-style-type: disc; list-style-position: inside;">
  <li>&#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x647;&#x64A; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x645;&#x646; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;&#x60C; &#x648;&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629;&#x60C; &#x648;&#x63A;&#x64A;&#x631;&#x647;&#x627; &#x645;&#x646; &#x627;&#x644;&#x645;&#x644;&#x62D;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62E;&#x631;&#x649; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x645;&#x643;&#x646; &#x625;&#x636;&#x627;&#x641;&#x62A;&#x647;&#x627; &#x644;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;.</li>
  <li>&#x62A;&#x639;&#x62F; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x631;&#x627;&#x626;&#x639;&#x629; &#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;.</li>
  <li>&#x641;&#x64A; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x642;&#x633;&#x64A;&#x645;&#x64A;&#x629;&#x60C; &#x643;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x647;&#x648; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x645;&#x646; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;&#x60C; &#x648;&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x64F;&#x634;&#x643;&#x650;&#x644; &#x642;&#x633;&#x645; &#x645;&#x639;&#x64A;&#x646; &#x645;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;.</li>
  <li>&#x641;&#x64A; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x64A;&#x629;&#x60C; &#x643;&#x644; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637; &#x647;&#x648; &#x645;&#x62C;&#x631;&#x62F; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x645;&#x646; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;. &#x641;&#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x62A;&#x648;&#x636;&#x639; &#x645;&#x639;&#x627;&#x64B;&#x60C; &#x643;&#x645;&#x627; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x627;&#x643;&#x646;&#x629;.</li>
  <li>&#x644;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x60C; &#x639;&#x644;&#x64A;&#x643; &#x62A;&#x639;&#x631;&#x64A;&#x641;&#x647; &#x648;&#x645;&#x646; &#x62B;&#x645; &#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x647; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; <code>()Flask.register_blueprint</code>.</li>
  <li>&#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x628;&#x648;&#x627;&#x62F;&#x626; &#x631;&#x648;&#x627;&#x628;&#x637; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x629; &#x648;&#x627;&#x644;&#x62A;&#x64A; &#x633;&#x64A;&#x62A;&#x645; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x647;&#x627; &#x639;&#x644;&#x649; &#x62C;&#x645;&#x64A;&#x639; &#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;.</li>
  <li>&#x64A;&#x645;&#x643;&#x646;&#x643; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x646;&#x637;&#x627;&#x642; &#x641;&#x631;&#x639;&#x64A; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A; &#x644;&#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;.</li>
  <li>&#x64A;&#x62A;&#x645; &#x625;&#x639;&#x627;&#x62F;&#x629; &#x647;&#x64A;&#x643;&#x644;&#x629; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x637;&#x651;&#x637;&#x627;&#x62A; &#x641;&#x64A; &#x62E;&#x645;&#x633; &#x62E;&#x637;&#x648;&#x627;&#x62A; &#x635;&#x63A;&#x64A;&#x631;&#x629; &#x646;&#x633;&#x628;&#x64A;&#x627;&#x64B;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="views.html" class="navigation navigation-prev " aria-label="Previous page: استخدامات متقدمة لدوال العرض والتوجيه">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="templates.html" class="navigation navigation-next " aria-label="Next page: القوالب">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"المخططات","level":"1.8","depth":1,"next":{"title":"القوالب","level":"1.9","depth":1,"path":"docs/templates.md","ref":"docs/templates.md","articles":[]},"previous":{"title":"استخدامات متقدمة لدوال العرض والتوجيه","level":"1.7","depth":1,"path":"docs/views.md","ref":"docs/views.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"images/flask.png","bookmark":"images/flask.png"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"استكشف فلاسك","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/blueprints.md","mtime":"2018-05-27T18:26:52.065Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-28T11:23:12.323Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

