
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>الإعداد · استكشف فلاسك</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="views.html" />
    
    
    <link rel="prev" href="organizing.html" />
    

    
        <link rel="shortcut icon" href='../images/flask.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/flask.png' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    المقدمة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="coding_conventions.html">
            
                <a href="coding_conventions.html">
            
                    
                    أعراف كتابة الشيفرة البرمجية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="environment.html">
            
                <a href="environment.html">
            
                    
                    بيئة العمل
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="organizing.html">
            
                <a href="organizing.html">
            
                    
                    تنظيم المشروع
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="configuration.html">
            
                <a href="configuration.html">
            
                    
                    الإعداد
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="views.html">
            
                <a href="views.html">
            
                    
                    استخدامات متقدمة لدوال العرض والتوجيه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="blueprints.html">
            
                <a href="blueprints.html">
            
                    
                    المخططات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="templates.html">
            
                <a href="templates.html">
            
                    
                    القوالب
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="static.html">
            
                <a href="static.html">
            
                    
                    الملفات الساكنة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="storing.html">
            
                <a href="storing.html">
            
                    
                    تخزين البيانات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    التعامل مع الاستمارات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="users.html">
            
                <a href="users.html">
            
                    
                    أساليب للتعامل مع المُستخدمين
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="deployment.html">
            
                <a href="deployment.html">
            
                    
                    النشر
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    الخاتمة
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >الإعداد</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;">&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;</h1>
<p><img src="../images/configuration.png"></p>
<p>&#x639;&#x646;&#x62F;&#x645;&#x627; &#x633;&#x62A;&#x628;&#x62F;&#x623; &#x628;&#x62A;&#x639;&#x644;&#x645; &#x641;&#x644;&#x627;&#x633;&#x643;&#x60C; &#x633;&#x62A;&#x62C;&#x62F; &#x623;&#x646; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x64A;&#x628;&#x62F;&#x648; &#x633;&#x647;&#x644;&#x627;&#x64B; &#x644;&#x644;&#x63A;&#x627;&#x64A;&#x629;. &#x641;&#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x643; &#x641;&#x639;&#x644;&#x647; &#x647;&#x648; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x628;&#x639;&#x636; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>config.py</em> &#x648;&#x643;&#x644; &#x634;&#x64A;&#x621; &#x633;&#x64A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x645;&#x627; &#x64A;&#x631;&#x627;&#x645;. &#x647;&#x630;&#x627; &#x627;&#x644;&#x633;&#x647;&#x648;&#x644;&#x629; &#x633;&#x631;&#x639;&#x627;&#x646; &#x645;&#x627; &#x62A;&#x632;&#x648;&#x644; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x62A;&#x628;&#x62F;&#x623; &#x628;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x644;&#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x641;&#x642;&#x62F; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x62D;&#x645;&#x627;&#x64A;&#x629; &#x627;&#x644;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629; &#x644;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x623;&#x648; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x636;&#x628;&#x637; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629; &#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629; (&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x648;&#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C; &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;). &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x641;&#x635;&#x644; &#x633;&#x646;&#x62A;&#x62D;&#x62F;&#x62B; &#x639;&#x646; &#x628;&#x639;&#x636; &#x645;&#x64A;&#x632;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643; &#x627;&#x644;&#x645;&#x64F;&#x62A;&#x642;&#x62F;&#x645;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x62C;&#x639;&#x644; &#x625;&#x62F;&#x627;&#x631;&#x629; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x623;&#x633;&#x647;&#x644;.</p>
<h2 id="&#x627;&#x644;&#x62D;&#x627;&#x644;&#x629;-&#x627;&#x644;&#x628;&#x633;&#x64A;&#x637;&#x629;">&#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; &#x627;&#x644;&#x628;&#x633;&#x64A;&#x637;&#x629;</h2>
<p>&#x642;&#x62F; &#x644;&#x627; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x633;&#x64A;&#x637;&#x629; &#x625;&#x644;&#x649; &#x623;&#x64A; &#x645;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x64A;&#x632;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x639;&#x642;&#x62F;&#x629;. &#x642;&#x62F; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x641;&#x642;&#x637; &#x644;&#x648;&#x636;&#x639; &#x627;&#x644;&#x645;&#x644;&#x641; <em>config.py</em> &#x641;&#x64A; &#x62C;&#x630;&#x631; &#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639;&#x643; &#x648;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621;&#x647; &#x645;&#x646; &#x645;&#x644;&#x641; <em>app.py</em> &#x623;&#x648; &#x645;&#x646; <em>yourapp/__init__.py</em> (&#x628;&#x62D;&#x633;&#x628; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x62A;&#x646;&#x638;&#x64A;&#x645;&#x643; &#x644;&#x644;&#x645;&#x634;&#x631;&#x648;&#x639;).</p>
<p>&#x64A;&#x62C;&#x628; &#x623;&#x646; &#x64A;&#x62D;&#x648;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>config.py</em> &#x639;&#x644;&#x649; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x625;&#x633;&#x646;&#x627;&#x62F; &#x642;&#x64A;&#x645;&#x629; &#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x641;&#x64A; &#x643;&#x644; &#x633;&#x637;&#x631;. &#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x647;&#x644;&#x627;&#x644; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x60C; &#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x644;&#x636;&#x628;&#x637; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x641;&#x644;&#x627;&#x633;&#x643; &#x648;&#x645;&#x644;&#x62D;&#x642;&#x627;&#x62A;&#x647;&#x60C; &#x648;&#x64A;&#x645;&#x643;&#x646; &#x627;&#x644;&#x648;&#x635;&#x648;&#x644; &#x625;&#x644;&#x64A;&#x647;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x642;&#x627;&#x645;&#x648;&#x633; <code>app.config</code>&#x60C;  &#x645;&#x62B;&#x627;&#x644;: <code>[&quot;app.config[&quot;DEBUG</code>.</p>
<pre><code class="lang-python">DEBUG = <span class="hljs-keyword">True</span> <span class="hljs-comment"># &#x62A;&#x645;&#x643;&#x64A;&#x646; &#x645;&#x64A;&#x632;&#x629; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;</span>
BCRYPT_LOG_ROUNDS = <span class="hljs-number">12</span> <span class="hljs-comment"># Flask-Bcrypt &#x62E;&#x64A;&#x627;&#x631; &#x644;&#x625;&#x636;&#x627;&#x641;&#x629;</span>
MAIL_FROM_EMAIL = <span class="hljs-string">&quot;robert@example.com&quot;</span> <span class="hljs-comment"># &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x641;&#x64A; &#x631;&#x633;&#x627;&#x626;&#x644; &#x627;&#x644;&#x628;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x625;&#x644;&#x643;&#x62A;&#x631;&#x648;&#x646;&#x64A; &#x644;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;</span>
</code></pre>
<p>&#x64A;&#x64F;&#x645;&#x643;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x636;&#x628;&#x637; (&#x627;&#x644;&#x62A;&#x643;&#x648;&#x64A;&#x646;) &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643;&#x60C; &#x623;&#x648; &#x627;&#x644;&#x645;&#x644;&#x62D;&#x642;&#x627;&#x62A;&#x60C; &#x623;&#x648; &#x62D;&#x62A;&#x649; &#x628;&#x648;&#x627;&#x633;&#x637;&#x62A;&#x643;. &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>app.config[&quot;MAIL_FROM_EMAIL&quot;]</code> &#x643;&#x644;&#x645;&#x627; &#x627;&#x62D;&#x62A;&#x62C;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; &#x627;&#xFEF9;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x644;&#x639;&#x646;&#x648;&#x627;&#x646; &quot;&#x627;&#x644;&#x645;&#x631;&#x633;&#x644;&quot; &#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x639;&#x627;&#x645;&#x644;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x64A;&#x62F;&#x64A;&#x629;&#x60C; &#x645;&#x62B;&#x627;&#x644;: &#x625;&#x639;&#x627;&#x62F;&#x629; &#x62A;&#x639;&#x64A;&#x64A;&#x646; &#x643;&#x644;&#x645;&#x629; &#x627;&#x644;&#x645;&#x631;&#x648;&#x631;. &#x648;&#x636;&#x639; &#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x643;&#x647;&#x630;&#x647; &#x641;&#x64A; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x64A;&#x62C;&#x639;&#x644; &#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x644; &#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x642;&#x64A;&#x645;&#x62A;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># app.py &#x623;&#x648; app/__init__.py</span>
<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask

app = Flask(__name__)
app.config.from_object(<span class="hljs-string">&apos;config&apos;</span>)

<span class="hljs-comment"># app.config[&quot;VAR_NAME&quot;] &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x644;&#x622;&#x646; &#x627;&#x644;&#x648;&#x635;&#x648;&#x644; &#x644;&#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;.</span>
</code></pre>
<table>
<thead>
<tr>
<th>&#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;</th>
<th>&#x627;&#x644;&#x634;&#x631;&#x62D;</th>
<th>&#x646;&#x635;&#x64A;&#x62D;&#x629;</th>
</tr>
</thead>
<tbody>
<tr>
<td>DEBUG</td>
<td>&#x64A;&#x639;&#x637;&#x64A;&#x643; &#x647;&#x630;&#x627; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; &#x628;&#x639;&#x636; &#x627;&#x644;&#x623;&#x62F;&#x648;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x641;&#x64A;&#x62F;&#x629; &#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D; &#x627;&#x644;&#x623;&#x62E;&#x637;&#x627;&#x621;. &#x647;&#x630;&#x627; &#x64A;&#x62A;&#x636;&#x645;&#x646; &#x631;&#x635;&#x629; &#x62A;&#x62A;&#x628;&#x639; &#x648;&#x648;&#x62D;&#x62F;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x62A;&#x641;&#x627;&#x639;&#x644;&#x64A;&#x629; &#x645;&#x628;&#x646;&#x64A;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x648;&#x64A;&#x628;.</td>
<td>&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x625;&#x633;&#x646;&#x627;&#x62F; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; <code>True</code> &#x644;&#x647; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x648;&#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; <code>Flase</code> &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;.</td>
</tr>
<tr>
<td>SECRET_KEY</td>
<td>&#x647;&#x630;&#x627; &#x647;&#x648; &#x627;&#x644;&#x645;&#x641;&#x62A;&#x627;&#x62D; &#x627;&#x644;&#x633;&#x631;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x646; &#x641;&#x644;&#x627;&#x633;&#x643; &#x644;&#x62A;&#x648;&#x642;&#x64A;&#x639; &#x627;&#x644;&#x643;&#x639;&#x643;&#x627;&#x62A;. &#x643;&#x645;&#x627; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x645;&#x646; &#x625;&#x636;&#x627;&#x641;&#x627;&#x62A; &#x645;&#x62B;&#x644; Flask-Bcrypt. &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x639;&#x644;&#x64A;&#x643; &#x62A;&#x639;&#x631;&#x64A;&#x641;&#x647; &#x62F;&#x627;&#x62E;&#x644; &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; <code>instance</code> &#x644;&#x625;&#x628;&#x642;&#x627;&#x621;&#x647; &#x62E;&#x627;&#x631;&#x62C; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x642;&#x631;&#x627;&#x621;&#x629; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x62D;&#x648;&#x644; &#x645;&#x62C;&#x644;&#x62F; <code>instance</code> &#x641;&#x64A; &#x627;&#x644;&#x641;&#x642;&#x631;&#x629; &#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A;&#x629;.</td>
<td>&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x623;&#x646; &#x64A;&#x64F;&#x633;&#x646;&#x62F; &#x644;&#x647;&#x630;&#x627; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; &#x642;&#x64A;&#x645;&#x629; &#x639;&#x634;&#x648;&#x627;&#x626;&#x64A;&#x629; &#x645;&#x639;&#x642;&#x62F;&#x629;.</td>
</tr>
<tr>
<td>BCRYPT_LOG_ROUNDS</td>
<td>&#x625;&#x630;&#x627; &#x643;&#x646;&#x62A; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; Flask-Bcrypt &#x644;&#x62A;&#x647;&#x634;&#x64A;&#x631; &#x643;&#x644;&#x645;&#x627;&#x62A; &#x645;&#x631;&#x648;&#x631; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x646; &#x641;&#x639;&#x644;&#x64A;&#x643; &#x62A;&#x62D;&#x62F;&#x64A;&#x62F; &#x639;&#x62F;&#x62F; &#x627;&#x644;&#x645;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x64A;&#x62A;&#x645; &#x62A;&#x646;&#x641;&#x64A;&#x630; &#x641;&#x64A;&#x647;&#x627; &#x627;&#x644;&#x62E;&#x648;&#x627;&#x631;&#x632;&#x645;&#x64A;&#x629; &#x639;&#x644;&#x649; &#x643;&#x644;&#x645;&#x629; &#x627;&#x644;&#x645;&#x631;&#x648;&#x631;. &#x625;&#x646; &#x644;&#x645; &#x62A;&#x643;&#x646; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x641;&#x639;&#x644;&#x64A;&#x643; &#x627;&#x644;&#x628;&#x62F;&#x621; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627;. &#x641;&#x643;&#x644;&#x645;&#x627; &#x632;&#x627;&#x62F;&#x62A; &#x639;&#x62F;&#x62F; &#x627;&#x644;&#x62C;&#x648;&#x644;&#x627;&#x62A;&#x60C; &#x632;&#x627;&#x62F;&#x62A; &#x645;&#x639;&#x647;&#x627; &#x635;&#x639;&#x648;&#x628;&#x629; &#x62A;&#x62E;&#x645;&#x64A;&#x646; &#x643;&#x644;&#x645;&#x629; &#x627;&#x644;&#x645;&#x631;&#x648;&#x631; &#x645;&#x646; &#x642;&#x628;&#x644; &#x627;&#x644;&#x645;&#x64F;&#x647;&#x627;&#x62C;&#x645;. &#x648;&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x627;&#x632;&#x62F;&#x64A;&#x627;&#x62F; &#x639;&#x62F;&#x62F; &#x627;&#x644;&#x62F;&#x648;&#x631;&#x627;&#x62A; &#x628;&#x645;&#x631;&#x648;&#x631; &#x627;&#x644;&#x648;&#x642;&#x62A; &#x628;&#x632;&#x64A;&#x627;&#x62F;&#x629; &#x627;&#x644;&#x642;&#x62F;&#x631;&#x629; &#x627;&#x644;&#x62D;&#x627;&#x633;&#x648;&#x628;&#x64A;&#x629;.</td>
<td>&#x633;&#x646;&#x646;&#x627;&#x642;&#x634; &#x644;&#x627;&#x62D;&#x642;&#x627;&#x64B; &#x641;&#x64A; &#x627;&#x644;&#x643;&#x62A;&#x627;&#x628; &#x623;&#x641;&#x636;&#x644; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x627;&#x62A; &#x644;&#x647;&#x630;&#x647; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;.</td>
</tr>
</tbody>
</table>
<blockquote>
<b>&#x62A;&#x62D;&#x630;&#x64A;&#x631;</b><br>
&#x62A;&#x623;&#x643;&#x62F; &#x645;&#x646; &#x62A;&#x639;&#x64A;&#x64A;&#x646; &#x642;&#x64A;&#x645;&#x629; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631; <code>DEBUG</code> &#x625;&#x644;&#x649; <code>False</code> &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x641;&#x62A;&#x631;&#x643;&#x647; &#x645;&#x64F;&#x641;&#x639;&#x644;&#x627;&#x64B; &#x64A;&#x633;&#x645;&#x62D; &#x644;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x646; &#x628;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x62A;&#x639;&#x644;&#x64A;&#x645;&#x627;&#x62A; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x62A;&#x639;&#x633;&#x641;&#x64A;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645;&#x643;.
</blockquote>

<h2 id="&#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F;-&#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A;">&#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A;</h2>
<p>&#x633;&#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x623;&#x62D;&#x64A;&#x627;&#x646;&#x627;&#x64B; &#x644;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x62A;&#x643;&#x648;&#x64A;&#x646; &#x62A;&#x62D;&#x62A;&#x648;&#x64A; &#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x62D;&#x633;&#x627;&#x633;&#x629;&#x60C; &#x648;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A; &#x633;&#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x641;&#x635;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x639;&#x646; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>config.py</em> &#x648;&#x625;&#x628;&#x642;&#x627;&#x626;&#x647;&#x627; &#x62E;&#x627;&#x631;&#x62C; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639;. &#x62D;&#x64A;&#x62B; &#x631;&#x628;&#x645;&#x627; &#x623;&#x646;&#x62A; &#x62A;&#x642;&#x648;&#x645; &#x628;&#x625;&#x62E;&#x641;&#x627;&#x621; &#x628;&#x639;&#x636; &#x627;&#x644;&#x623;&#x645;&#x648;&#x631; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x651;&#x629; &#x645;&#x62B;&#x644; &#x643;&#x644;&#x645;&#x627;&#x62A; &#x645;&#x631;&#x648;&#x631; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x648;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x627;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;&#x60C; &#x623;&#x648; &#x631;&#x628;&#x645;&#x627; &#x62A;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x645;&#x62E;&#x635;&#x635;&#x629; &#x644;&#x62C;&#x647;&#x627;&#x632; &#x645;&#x639;&#x64A;&#x646;. &#x644;&#x62C;&#x639;&#x644; &#x627;&#x644;&#x623;&#x645;&#x631; &#x633;&#x647;&#x644;&#x60C; &#x64A;&#x648;&#x641;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643; &#x62E;&#x627;&#x635;&#x64A;&#x629; &#x62A;&#x62F;&#x639;&#x649; <strong>&#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A;&#x629;</strong>. &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A; (instance folder) &#x647;&#x648; &#x62F;&#x644;&#x64A;&#x644; &#x641;&#x631;&#x639;&#x64A; &#x645;&#x646; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639; &#x627;&#x644;&#x62C;&#x630;&#x631; &#x64A;&#x62D;&#x648;&#x64A; &#x639;&#x644;&#x649; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x645;&#x62E;&#x635;&#x635;&#x629; &#x644;&#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A;. &#x641;&#x646;&#x62D;&#x646; &#x644;&#x627; &#x646;&#x631;&#x64A;&#x62F; &#x625;&#x64A;&#x62F;&#x627;&#x639; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x641;&#x64A; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;.</p>
<pre><code>config.py
requirements.txt
run.py
instance/
  config.py
yourapp/
  __init__.py
  models.py
  views.py
  templates/
  static/
</code></pre><h3 id="&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;-&#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F;-&#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A;">&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A;</h3>
<p>&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629; <code>()app.config.from_pyfile</code> &#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x643;&#x648;&#x64A;&#x646; &#x645;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F;&#x627;&#x62A;. &#x625;&#x630;&#x627; &#x642;&#x645;&#x646;&#x627; &#x628;&#x62A;&#x639;&#x64A;&#x64A;&#x646; <code>instance_relative_config=True</code> &#x639;&#x646;&#x62F; &#x625;&#x646;&#x634;&#x627;&#x621; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x627;&#x644;&#x635;&#x646;&#x641; <code>()Flask</code> &#x633;&#x62A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629; <code>()app.config.from_pyfile</code> &#x628;&#x634;&#x62D;&#x646; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x645;&#x64F;&#x62D;&#x62F;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>/instance</em>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># app.py &#x623;&#x648; app/__init__.py</span>

app = Flask(__name__, instance_relative_config=<span class="hljs-keyword">True</span>)
app.config.from_object(<span class="hljs-string">&apos;config&apos;</span>)
app.config.from_pyfile(<span class="hljs-string">&apos;config.py&apos;</span>)
</code></pre>
<p>&#x627;&#x644;&#x622;&#x646; &#x623;&#x635;&#x628;&#x62D; &#x628;&#x625;&#x645;&#x643;&#x627;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>instance/config.py</em> &#x643;&#x645;&#x627; &#x643;&#x646;&#x627; &#x646;&#x641;&#x639;&#x644; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>config.py</em>. &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x639;&#x644;&#x64A;&#x643; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x625;&#x636;&#x627;&#x641;&#x629; &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A; &#x625;&#x644;&#x649; &#x642;&#x627;&#x626;&#x645;&#x629; &#x627;&#x644;&#x62A;&#x62C;&#x627;&#x647;&#x644; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629; &#x628;&#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x644;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647;&#x630;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x62C;&#x64A;&#x62A;&#x60C; &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x643; &#x647;&#x648; &#x625;&#x636;&#x627;&#x641;&#x629; <code>/instance</code> &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; <em>gitignore.</em></p>
<h3 id="&#x627;&#x644;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D;-&#x627;&#x644;&#x633;&#x631;&#x64A;&#x629;">&#x627;&#x644;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629;</h3>
<p>&#x627;&#x644;&#x637;&#x628;&#x64A;&#x639;&#x629; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629; &#x644;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A; &#x62A;&#x62C;&#x639;&#x644;&#x647; &#x645;&#x643;&#x627;&#x646;&#x627;&#x64B; &#x645;&#x646;&#x627;&#x633;&#x628;&#x627;&#x64B; &#x644;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x627;&#x644;&#x62A;&#x64A; &#x644;&#x627; &#x62A;&#x631;&#x64A;&#x62F; &#x62A;&#x62A;&#x628;&#x639;&#x647;&#x627; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x642;&#x62F; &#x62A;&#x62A;&#x636;&#x645;&#x646; &#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629; &#x623;&#x648; &#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x648;&#x627;&#x62C;&#x647;&#x627;&#x62A; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x644;&#x637;&#x631;&#x641; &#x62B;&#x627;&#x644;&#x62B;. &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x637;&#x648;&#x629; &#x645;&#x647;&#x645;&#x629; &#x62C;&#x62F;&#x627;&#x64B; &#x62E;&#x627;&#x635;&#x629;&#x64B; &#x625;&#x646; &#x643;&#x627;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x645;&#x641;&#x62A;&#x648;&#x62D; &#x627;&#x644;&#x645;&#x635;&#x62F;&#x631;&#x60C; &#x623;&#x648; &#x633;&#x64A;&#x635;&#x628;&#x62D; &#x645;&#x641;&#x62A;&#x648;&#x62D; &#x627;&#x644;&#x645;&#x635;&#x62F;&#x631; &#x641;&#x64A; &#x645;&#x631;&#x62D;&#x644;&#x629; &#x645;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x642;&#x628;&#x644;. &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x646;&#x637;&#x644;&#x628; &#x645;&#x646; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x646; &#x648;&#x627;&#x644;&#x645;&#x633;&#x627;&#x647;&#x645;&#x64A;&#x646; &#x627;&#x644;&#x622;&#x62E;&#x631;&#x64A;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D;&#x647;&#x645; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># instance/config.py</span>

SECRET_KEY = <span class="hljs-string">&apos;Sm9obiBTY2hyb20ga2lja3MgYXNz&apos;</span>
STRIPE_API_KEY = <span class="hljs-string">&apos;SmFjb2IgS2FwbGFuLU1vc3MgaXMgYSBoZXJv&apos;</span>
SQLALCHEMY_DATABASE_URI= \
<span class="hljs-string">&quot;postgresql://user:TWljaGHFgiBCYXJ0b3N6a2lld2ljeiEh@localhost/databasename&quot;</span>
</code></pre>
<h3 id="&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;-&#x627;&#x644;&#x642;&#x627;&#x626;&#x645;-&#x639;&#x644;&#x649;-&#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;-&#x627;&#x644;&#x635;&#x63A;&#x631;&#x649;">&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x642;&#x627;&#x626;&#x645; &#x639;&#x644;&#x649; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x635;&#x63A;&#x631;&#x649;</h3>
<p>&#x625;&#x630;&#x627; &#x643;&#x627;&#x646; &#x627;&#x644;&#x641;&#x631;&#x642; &#x628;&#x64A;&#x646; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C; &#x648;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x628;&#x633;&#x64A;&#x637; &#x641;&#x642;&#x62F; &#x62A;&#x631;&#x63A;&#x628; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A; &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A;. &#x62D;&#x64A;&#x62B; &#x623;&#x646; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x631;&#x641;&#x629; &#x641;&#x64A; <em>instance/config.py</em> &#x64A;&#x645;&#x643;&#x646; &#x623;&#x646; &#x62A;&#x633;&#x62A;&#x628;&#x62F;&#x644; &#x642;&#x64A;&#x645; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x645;&#x639;&#x631;&#x641;&#x629; &#x641;&#x64A; <em>config.py</em>. &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647; &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; <code>()app.config.from_pyfile</code> &#x628;&#x639;&#x62F; <code>()app.config.from_object</code>. &#x625;&#x62D;&#x62F;&#x649; &#x627;&#x644;&#x637;&#x631;&#x642; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x629; &#x641;&#x64A;&#x647;&#x627; &#x645;&#x646; &#x647;&#x630;&#x627; &#x647;&#x64A; &#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x639;&#x644;&#x649; &#x627;&#x644;&#x623;&#x62C;&#x647;&#x632;&#x629; &#x627;&#x644;&#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># config.py</span>

DEBUG = <span class="hljs-keyword">False</span>
SQLALCHEMY_ECHO = <span class="hljs-keyword">False</span>


<span class="hljs-comment"># instance/config.py</span>
DEBUG = <span class="hljs-keyword">True</span>
SQLALCHEMY_ECHO = <span class="hljs-keyword">True</span>
</code></pre>
<p>&#x628;&#x647;&#x630;&#x647; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629;&#x60C; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x631;&#x643; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x643;&#x645;&#x627; &#x647;&#x64A; &#x641;&#x64A; <em>instance/config.py</em> &#x641;&#x633;&#x62A;&#x633;&#x62A;&#x628;&#x62F;&#x644; &#x642;&#x64A;&#x645;&#x62A;&#x647;&#x627; &#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x627;&#x64B; &#x628;&#x62A;&#x644;&#x643; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x631;&#x641;&#x629; &#x641;&#x64A; <em>config.py</em>.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
<ul style="list-style-type: disc; list-style-position: inside;">
  <li>&#x627;&#x642;&#x631;&#x623; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x62D;&#x648;&#x644; <a href="http://flask-sqlalchemy.pocoo.org/latest/config/#configuration-keys" target="_blank">&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x625;&#x639;&#x62F;&#x627;&#x62F;</a> &#x625;&#x636;&#x627;&#x641;&#x629; Flask-SQLAlchemy.</li>
</ul>
</blockquote>

<h2 id="&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;-&#x628;&#x646;&#x627;&#x621;&#x64B;-&#x639;&#x644;&#x649;-&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A;-&#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;">&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;</h2>
<p>&#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A; &#x644;&#x627; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x623;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x641;&#x64A; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x647;&#x630;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x623;&#x646;&#x643; &#x644;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x642;&#x627;&#x62F;&#x631;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x62A;&#x62A;&#x628;&#x639; &#x627;&#x644;&#x62A;&#x63A;&#x64A;&#x64A;&#x631;&#x627;&#x62A; &#x641;&#x64A; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x636;&#x628;&#x637; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F;. &#x642;&#x62F; &#x644;&#x627; &#x64A;&#x628;&#x62F;&#x648; &#x627;&#x644;&#x623;&#x645;&#x631; &#x645;&#x647;&#x645;&#x627;&#x64B; &#x644;&#x648; &#x643;&#x646;&#x62A; &#x62A;&#x645;&#x644;&#x643; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x623;&#x648; &#x625;&#x62B;&#x646;&#x64A;&#x646;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x625;&#x646; &#x643;&#x646;&#x62A; &#x62A;&#x645;&#x644;&#x643; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x645;&#x636;&#x628;&#x648;&#x637;&#x629; &#x628;&#x62F;&#x642;&#x629; &#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629; (&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;&#x60C; &#x648;&#x627;&#x644;&#x62A;&#x647;&#x64A;&#x626;&#x629;&#x60C; &#x648;&#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;&#x60C; &#x625;&#x644;&#x62E;.) &#x641;&#x623;&#x646;&#x62A; &#x628;&#x627;&#x644;&#x62A;&#x623;&#x643;&#x64A;&#x62F; &#x644;&#x627; &#x62A;&#x631;&#x64A;&#x62F; &#x62D;&#x62F;&#x648;&#x62B; &#x630;&#x644;&#x643;.</p>
<p>&#x64A;&#x639;&#x637;&#x64A;&#x646;&#x627; &#x641;&#x644;&#x627;&#x633;&#x643; &#x627;&#x644;&#x642;&#x62F;&#x631;&#x629; &#x639;&#x644;&#x649; &#x627;&#x62E;&#x62A;&#x64A;&#x627;&#x631; &#x645;&#x644;&#x641; &#x627;&#x644;&#x62A;&#x643;&#x648;&#x64A;&#x646; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x642;&#x64A;&#x645;&#x629; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x641;&#x64A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;. &#x647;&#x630;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x623;&#x646;&#x647; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x645;&#x62A;&#x644;&#x627;&#x643; &#x639;&#x62F;&#x629; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639; &#x648;&#x627;&#x62E;&#x62A;&#x64A;&#x627;&#x631; &#x627;&#x644;&#x645;&#x646;&#x627;&#x633;&#x628; &#x62F;&#x627;&#x626;&#x645;&#x627;&#x64B;. &#x637;&#x627;&#x644;&#x645;&#x627; &#x623;&#x646;&#x646;&#x627; &#x646;&#x645;&#x644;&#x643; &#x639;&#x62F;&#x629; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x60C; &#x641;&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x646;&#x642;&#x644;&#x647;&#x645; &#x625;&#x644;&#x649; &#x62F;&#x644;&#x64A;&#x644; <code>config</code> &#x645;&#x62E;&#x635;&#x635; &#x644;&#x647;&#x645;.</p>
<pre><code>requirements.txt
run.py
config/
  __init__.py # &#x645;&#x644;&#x641; &#x641;&#x627;&#x631;&#x63A;&#x60C; &#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x642;&#x637; &#x644;&#x625;&#x62E;&#x628;&#x627;&#x631; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x623;&#x646; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; &#x647;&#x630;&#x627; &#x62D;&#x632;&#x645;&#x629;
  default.py
  production.py
  development.py
  staging.py
instance/
  config.py
yourapp/
  __init__.py
  models.py
  views.py
  static/
  templates/
</code></pre><p>&#x641;&#x64A; &#x627;&#x644;&#x62C;&#x62F;&#x648;&#x644; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x64A;&#x648;&#x62C;&#x62F; &#x634;&#x631;&#x62D; &#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x643;&#x648;&#x64A;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x629;.</p>
<table>
<thead>
<tr>
<th>&#x645;&#x644;&#x641; &#x627;&#x644;&#x62A;&#x643;&#x648;&#x64A;&#x646;</th>
<th>&#x627;&#x644;&#x634;&#x631;&#x62D;</th>
</tr>
</thead>
<tbody>
<tr>
<td>config/default.py</td>
<td>&#x64A;&#x62D;&#x648;&#x64A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x642;&#x64A;&#x645; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629;&#x60C; &#x644;&#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x639;&#x644;&#x649; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x623;&#x648; &#x64A;&#x62A;&#x645; &#x627;&#x633;&#x62A;&#x628;&#x62F;&#x627;&#x644;&#x647;&#x627; &#x628;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x645;&#x646;&#x627;&#x633;&#x628;&#x629;. &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x642;&#x62F; &#x64A;&#x62A;&#x645; &#x62A;&#x639;&#x64A;&#x64A;&#x646; <code>DEBUG = False</code> &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; config/default.py &#x648;&#x64A;&#x62A;&#x645; &#x627;&#x633;&#x62A;&#x628;&#x62F;&#x627;&#x644;&#x647; &#x628; <code>DEBUG = True</code> &#x641;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; config/development.py.</td>
</tr>
<tr>
<td>config/development.py</td>
<td>&#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x642;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x64A; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;. &#x641;&#x642;&#x62F; &#x62A;&#x636;&#x639; &#x647;&#x646;&#x627; &#x639;&#x646;&#x648;&#x627;&#x646; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x644;&#x64A;&#x634;&#x64A;&#x631; &#x625;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x645;&#x62D;&#x644;&#x64A;.</td>
</tr>
<tr>
<td>config/production.py</td>
<td>&#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x642;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x641;&#x642;&#x62F; &#x62A;&#x636;&#x639; &#x647;&#x646;&#x627; &#x639;&#x646;&#x648;&#x627;&#x646; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x644;&#x64A;&#x634;&#x64A;&#x631; &#x625;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x628;&#x639;&#x64A;&#x62F;&#x60C; &#x639;&#x644;&#x649; &#x639;&#x643;&#x633; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;.</td>
</tr>
<tr>
<td>config/staging.py</td>
<td>&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x646;&#x634;&#x631;&#x60C; &#x641;&#x642;&#x62F; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x62E;&#x637;&#x648;&#x629; &#x62A;&#x647;&#x64A;&#x626;&#x629; &#x62D;&#x64A;&#x62B; &#x62A;&#x642;&#x648;&#x645; &#x628;&#x627;&#x62E;&#x62A;&#x628;&#x627;&#x631; &#x627;&#x644;&#x62A;&#x63A;&#x64A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62C;&#x631;&#x627;&#x629; &#x639;&#x644;&#x649; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x639;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x64A;&#x62D;&#x627;&#x643;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x639;&#x644;&#x649; &#x627;&#x644;&#x623;&#x631;&#x62C;&#x62D; &#x633;&#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629;&#x60C; &#x643;&#x645;&#x627; &#x642;&#x62F; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x627;&#x633;&#x62A;&#x628;&#x62F;&#x627;&#x644; &#x642;&#x64A;&#x645; &#x623;&#x62E;&#x631;&#x649;.</td>
</tr>
</tbody>
</table>
<p>&#x646;&#x642;&#x648;&#x645; &#x628;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629; <code>()app.config.from_envvar</code> &#x644;&#x627;&#x62E;&#x62A;&#x64A;&#x627;&#x631; &#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x630;&#x64A; &#x646;&#x631;&#x64A;&#x62F; &#x62A;&#x62D;&#x645;&#x64A;&#x644;&#x647;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># yourapp/__init__.py</span>

app = Flask(__name__, instance_relative_config=<span class="hljs-keyword">True</span>)

<span class="hljs-comment"># &#x62A;&#x62D;&#x645;&#x64A;&#x644; &#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;</span>
app.config.from_object(<span class="hljs-string">&apos;config.default&apos;</span>)

<span class="hljs-comment"># &#x62A;&#x62D;&#x645;&#x64A;&#x644; &#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x650;&#x64A;</span>
app.config.from_pyfile(<span class="hljs-string">&apos;config.py&apos;</span>)

<span class="hljs-comment"># APP_CONFIG_FILE &#x62A;&#x62D;&#x645;&#x64A;&#x644; &#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x645;&#x62D;&#x62F;&#x62F; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;</span>
<span class="hljs-comment"># &#x633;&#x64A;&#x62A;&#x645; &#x627;&#x633;&#x62A;&#x628;&#x62F;&#x627;&#x644; &#x627;&#x644;&#x642;&#x64A;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x631;&#x641;&#x629; &#x641;&#x64A; &#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A; &#x628;&#x62A;&#x644;&#x643; &#x627;&#x644;&#x645;&#x639;&#x631;&#x641;&#x629; &#x641;&#x64A; &#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x645;&#x64F;&#x62D;&#x62F;&#x62F; &#x628;&#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;</span>
app.config.from_envvar(<span class="hljs-string">&apos;APP_CONFIG_FILE&apos;</span>)
</code></pre>
<p>&#x64A;&#x62C;&#x628; &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; &#x627;&#x644;&#x645;&#x633;&#x646;&#x62F;&#x629; &#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x647;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631; &#x627;&#x644;&#x643;&#x627;&#x645;&#x644; &#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;.</p>
<p>&#x62A;&#x639;&#x64A;&#x64A;&#x646; &#x642;&#x64A;&#x645;&#x629; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x64A;&#x639;&#x62A;&#x645;&#x62F; &#x639;&#x644;&#x649; &#x627;&#x644;&#x645;&#x646;&#x635;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x64A;&#x647;&#x627; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;. &#x641;&#x625;&#x630;&#x627; &#x643;&#x646;&#x627; &#x646;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x644;&#x64A;&#x646;&#x64F;&#x643;&#x633; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x643;&#x62A;&#x627;&#x628;&#x629; &#x645;&#x644;&#x641; &#x646;&#x635;&#x64A; (shell script) &#x644;&#x62A;&#x639;&#x64A;&#x64A;&#x646; &#x642;&#x64A;&#x645;&#x629; &#x645;&#x62A;&#x63A;&#x64A;&#x631; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x648;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x644;&#x641; <em>run.py</em>.</p>
<pre><code># start.sh

export APP_CONFIG_FILE=/var/www/yourapp/config/production.py
python run.py
</code></pre><p>&#x64A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x645;&#x644;&#x641; <em>start.sh</em> &#x645;&#x64F;&#x62A;&#x63A;&#x64A;&#x651;&#x631; &#x62A;&#x628;&#x639;&#x627;&#x64B; &#x644;&#x644;&#x628;&#x64A;&#x626;&#x629;. &#x644;&#x630;&#x644;&#x643; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x639;&#x62F;&#x645; &#x62A;&#x62A;&#x628;&#x639;&#x647; &#x628;&#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x639;&#x644;&#x649; &#x645;&#x646;&#x635;&#x629; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648;&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x623;&#x62F;&#x627;&#x629; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648; &#x644;&#x62A;&#x639;&#x64A;&#x64A;&#x646; &#x642;&#x64A;&#x645;&#x629; &#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;. &#x646;&#x641;&#x633; &#x627;&#x644;&#x634;&#x64A;&#x621; &#x64A;&#x64F;&#x645;&#x643;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x647; &#x639;&#x644;&#x649; &#x645;&#x646;&#x635;&#x627;&#x62A; PaaS (&#x645;&#x646;&#x635;&#x629; &#x643;&#x62E;&#x62F;&#x645;&#x629;) &#x627;&#x644;&#x623;&#x62E;&#x631;&#x649;.</p>
<h2 id="&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;">&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;</h2>
<ul style="list-style-type: disc; list-style-position: inside;">
  <li>&#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x628;&#x633;&#x64A;&#x637; &#x642;&#x62F; &#x64A;&#x62D;&#x62A;&#x627;&#x62C; &#x641;&#x642;&#x637; &#x625;&#x644;&#x649; &#x645;&#x644;&#x641; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x648;&#x627;&#x62D;&#x62F;: <i>config.py</i>.</li>
  <li>&#x645;&#x62C;&#x644;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; &#x62A;&#x633;&#x627;&#x639;&#x62F;&#x646;&#x627; &#x639;&#x644;&#x649; &#x625;&#x62E;&#x641;&#x627;&#x621; &#x642;&#x64A;&#x645; &#x627;&#x644;&#x62A;&#x643;&#x648;&#x64A;&#x646; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629;.</li>
  <li>&#x645;&#x62C;&#x644;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; &#x64A;&#x64F;&#x645;&#x643;&#x646; &#x623;&#x646; &#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x627;&#x633;&#x62A;&#x628;&#x62F;&#x627;&#x644; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x645;&#x62D;&#x62F;&#x62F;&#x629;.</li>
  <li>&#x64A;&#x62C;&#x628; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x648; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629; <code>()app.config.from_envvar</code> &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x646;&#x638;&#x627;&#x645; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x623;&#x643;&#x62B;&#x631; &#x62A;&#x639;&#x642;&#x64A;&#x62F;&#x627;&#x64B; &#x642;&#x627;&#x626;&#x645; &#x639;&#x644;&#x649; &#x646;&#x648;&#x639; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="organizing.html" class="navigation navigation-prev " aria-label="Previous page: تنظيم المشروع">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="views.html" class="navigation navigation-next " aria-label="Next page: استخدامات متقدمة لدوال العرض والتوجيه">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"الإعداد","level":"1.6","depth":1,"next":{"title":"استخدامات متقدمة لدوال العرض والتوجيه","level":"1.7","depth":1,"path":"docs/views.md","ref":"docs/views.md","articles":[]},"previous":{"title":"تنظيم المشروع","level":"1.5","depth":1,"path":"docs/organizing.md","ref":"docs/organizing.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"images/flask.png","bookmark":"images/flask.png"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"استكشف فلاسك","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/configuration.md","mtime":"2018-05-21T16:32:35.442Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-21T16:37:24.111Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

