
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>النشر · استكشف فلاسك</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="conclusion.html" />
    
    
    <link rel="prev" href="users.html" />
    

    
        <link rel="shortcut icon" href='../images/flask.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/flask.png' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    المقدمة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="coding_conventions.html">
            
                <a href="coding_conventions.html">
            
                    
                    أعراف كتابة الشيفرة البرمجية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="environment.html">
            
                <a href="environment.html">
            
                    
                    بيئة العمل
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="organizing.html">
            
                <a href="organizing.html">
            
                    
                    تنظيم المشروع
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="configuration.html">
            
                <a href="configuration.html">
            
                    
                    الإعداد
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="views.html">
            
                <a href="views.html">
            
                    
                    استخدامات متقدمة لدوال العرض والتوجيه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="blueprints.html">
            
                <a href="blueprints.html">
            
                    
                    المخططات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="templates.html">
            
                <a href="templates.html">
            
                    
                    القوالب
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="static.html">
            
                <a href="static.html">
            
                    
                    الملفات الساكنة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="storing.html">
            
                <a href="storing.html">
            
                    
                    تخزين البيانات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    التعامل مع الاستمارات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="users.html">
            
                <a href="users.html">
            
                    
                    أساليب للتعامل مع المُستخدمين
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="deployment.html">
            
                <a href="deployment.html">
            
                    
                    النشر
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    الخاتمة
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >النشر</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x627;&#x644;&#x646;&#x634;&#x631;">&#x627;&#x644;&#x646;&#x634;&#x631;</h2>
<p><img src="../images/deployment.png"></p>
<p>&#x623;&#x635;&#x628;&#x62D;&#x646;&#x627;&#x60C; &#x648;&#x623;&#x62E;&#x64A;&#x631;&#x627;&#x64B;&#x60C; &#x645;&#x633;&#x62A;&#x639;&#x62F;&#x64A;&#x646; &#x644;&#x639;&#x631;&#x636; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x62A;&#x646;&#x627; &#x644;&#x644;&#x639;&#x627;&#x644;&#x645; &#x623;&#x62C;&#x645;&#x639;&#x60C; &#x625;&#x646;&#x651;&#x64E;&#x647; &#x648;&#x642;&#x62A; &#x627;&#x644;&#x646;&#x634;&#x631;! &#x64A;&#x645;&#x643;&#x646; &#x644;&#x647;&#x630;&#x647; &#x627;&#x644;&#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x635;&#x639;&#x628;&#x629; &#x648;&#x645;&#x62A;&#x639;&#x628;&#x629; &#x644;&#x648;&#x62C;&#x648;&#x62F; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x623;&#x645;&#x648;&#x631; &#x627;&#x644;&#x645;&#x639;&#x642;&#x62F;&#x629;&#x60C; &#x643;&#x645;&#x627; &#x648;&#x62A;&#x648;&#x62C;&#x64E;&#x62F; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x62A;&#x62E;&#x627;&#x630;&#x647;&#x627; &#x62D;&#x64A;&#x627;&#x644; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x639;&#x645;&#x644;&#x629; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x62A;&#x643; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;&#x64A;&#x651;&#x629;. &#x633;&#x646;&#x62A;&#x62D;&#x62F;&#x62B; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x641;&#x635;&#x644; &#x639;&#x646; &#x628;&#x639;&#x636; &#x627;&#x644;&#x646;&#x642;&#x627;&#x637; &#x627;&#x644;&#x645;&#x647;&#x645;&#x629; &#x648;&#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62A;&#x627;&#x62D;&#x629; &#x644;&#x627;&#x62A;&#x62E;&#x627;&#x630;&#x647;&#x627;.</p>
<h2 id="&#x627;&#x644;&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629;">&#x627;&#x644;&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629;</h2>
<p>&#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x641;&#x64A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x625;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x644;&#x646;&#x636;&#x639; &#x639;&#x644;&#x64A;&#x647; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x62A;&#x646;&#x627;. &#x64A;&#x648;&#x62C;&#x62F; &#x627;&#x644;&#x622;&#x644;&#x627;&#x641; &#x645;&#x646; &#x645;&#x632;&#x648;&#x62F;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x646;&#x648;&#x639; &#x645;&#x646; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x627;&#x62A;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x647;&#x646;&#x627;&#x643; &#x62B;&#x644;&#x627;&#x62B;&#x629; &#x641;&#x642;&#x637; &#x623;&#x648;&#x635;&#x64A; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x645;. &#x644;&#x646; &#x623;&#x642;&#x648;&#x645; &#x628;&#x627;&#x644;&#x62A;&#x639;&#x645;&#x642; &#x641;&#x64A; &#x62A;&#x641;&#x627;&#x635;&#x64A;&#x644; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x627;&#x62A;&#x60C; &#x641;&#x647;&#x630;&#x627; &#x62E;&#x627;&#x631;&#x62C; &#x646;&#x637;&#x627;&#x642; &#x643;&#x62A;&#x627;&#x628;&#x646;&#x627;. &#x641;&#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x630;&#x644;&#x643; &#x633;&#x623;&#x62A;&#x643;&#x644;&#x645; &#x639;&#x646; &#x627;&#x644;&#x641;&#x648;&#x627;&#x626;&#x62F; &#x648;&#x627;&#x644;&#x645;&#x632;&#x627;&#x64A;&#x627; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x642;&#x62F;&#x645;&#x647;&#x627; &#x643;&#x644; &#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x645;&#x639; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x643;&#x62A;&#x648;&#x628;&#x629; &#x628;&#x641;&#x644;&#x627;&#x633;&#x643;.</p>
<h3 id="&#x645;&#x62C;&#x645;&#x648;&#x639;&#x629;-&#x62E;&#x62F;&#x645;&#x627;&#x62A;-&#x627;&#x644;&#x648;&#x64A;&#x628;-&#x645;&#x646;-&#x623;&#x645;&#x627;&#x632;&#x648;&#x646;-ec2">&#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x648;&#x64A;&#x628; &#x645;&#x646; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; (EC2)</h3>
<p>&#x62A;&#x642;&#x62F;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x645;&#x646; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x642;&#x62F;&#x645;&#x629; &#x645;&#x646; &#x634;&#x631;&#x643;&#x629; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x627;&#x644;&#x639;&#x627;&#x644;&#x645;&#x64A;&#x651;&#x629;. &#x647;&#x646;&#x627;&#x643; &#x627;&#x62D;&#x62A;&#x645;&#x627;&#x644; &#x644;&#x633;&#x645;&#x627;&#x639;&#x643; &#x628;&#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x645;&#x646; &#x642;&#x64E;&#x628;&#x644;&#x61B; &#x643;&#x648;&#x646;&#x647;&#x627; &#x645;&#x646; &#x623;&#x643;&#x62B;&#x631; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631;&#x627;&#x62A; &#x634;&#x639;&#x628;&#x64A;&#x651;&#x629;&#x64B; &#x644;&#x644;&#x634;&#x631;&#x643;&#x627;&#x62A; &#x648;&#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x646;&#x627;&#x634;&#x626;&#x629; &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x64A;&#x627;&#x645;. &#x633;&#x646;&#x62A;&#x62D;&#x62F;&#x62B; &#x647;&#x646;&#x627; &#x639;&#x646; &#x62E;&#x62F;&#x645;&#x629; EC2 &#x628;&#x648;&#x62C;&#x647; &#x627;&#x644;&#x62A;&#x62D;&#x62F;&#x64A;&#x62F;&#x60C; &#x648;&#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x639;&#x646;&#x64A;: &quot;&#x62E;&#x62F;&#x645;&#x629; &#x627;&#x644;&#x62D;&#x648;&#x633;&#x628;&#x629; &#x627;&#x644;&#x633;&#x62D;&#x627;&#x628;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x645;&#x631;&#x646;&#x629;&quot; (Elastic Compute Cloud). &#x627;&#x644;&#x646;&#x642;&#x637;&#x629; &#x627;&#x644;&#x645;&#x62B;&#x64A;&#x631;&#x629; &#x628;&#x634;&#x623;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x62E;&#x648;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x642;&#x62F;&#x645;&#x647;&#x627;&#x60C; &#x623;&#x648; <strong>&#x627;&#x644;&#x646;&#x645;&#x627;&#x630;&#x650;&#x62C;</strong> (instances) &#x643;&#x645;&#x627; &#x62A;&#x64F;&#x633;&#x645;&#x64A;&#x647;&#x645; &#x627;&#x644;&#x634;&#x631;&#x643;&#x629;&#x60C; &#x62A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x645;&#x628;&#x62F;&#x623; &#x627;&#x644;&#x62B;&#x648;&#x627;&#x646;&#x64A;. &#x645;&#x645;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x623;&#x646;&#x651;&#x64E;&#x647; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x648;&#x633;&#x64A;&#x639; &#x625;&#x645;&#x643;&#x627;&#x646;&#x64A;&#x627;&#x62A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x639;&#x628;&#x631; &#x632;&#x64A;&#x627;&#x62F;&#x629; &#x639;&#x62F;&#x62F; &#x627;&#x644;&#x646;&#x645;&#x627;&#x630;&#x62C; &#x648;&#x631;&#x628;&#x637;&#x647;&#x645; &#x628;&#x645;&#x648;&#x632;&#x651;&#x650;&#x639; &#x62D;&#x645;&#x644; (load balancer) &#x648;&#x62D;&#x633;&#x628; (&#x64A;&#x645;&#x643;&#x646;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x648;&#x632;&#x651;&#x650;&#x639; &#x627;&#x644;&#x62D;&#x645;&#x644; &#x627;&#x644;&#x645;&#x64F;&#x642;&#x62F;&#x64E;&#x645; &#x645;&#x646; &#x627;&#x644;&#x634;&#x631;&#x643;&#x629; &#x646;&#x641;&#x633;&#x647;&#x627; &#x625;&#x646; &#x623;&#x631;&#x62F;&#x62A;).</p>
<p>&#x644;&#x627; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x623;&#x64A; &#x634;&#x64A;&#x621; &#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x645;&#x639; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x643;&#x62A;&#x648;&#x628;&#x629; &#x628;&#x641;&#x644;&#x627;&#x633;&#x643;. &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x643; &#x647;&#x648; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x646;&#x645;&#x648;&#x630;&#x62C; &#x64A;&#x639;&#x645;&#x644; &#x628;&#x62A;&#x648;&#x632;&#x64A;&#x639;&#x62A;&#x643; &#x627;&#x644;&#x644;&#x64A;&#x646;&#x643;&#x633;&#x627;&#x648;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x645;&#x641;&#x636;&#x644;&#x629; &#x628;&#x634;&#x643;&#x644; &#x62A;&#x642;&#x644;&#x64A;&#x62F;&#x64A; &#x648;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x645;&#x648;&#x642;&#x639;&#x643; &#x648;&#x62D;&#x632;&#x645;&#x629; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x62E;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x648;&#x64A;&#x628; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x631;&#x64A;&#x62F;&#x647;&#x627; &#x628;&#x62F;&#x648;&#x646; &#x623;&#x64A; &#x62A;&#x639;&#x642;&#x64A;&#x62F;&#x627;&#x62A;&#x60C; &#x645;&#x645;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x623;&#x646;&#x651;&#x64E;&#x647; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x62A;&#x645;&#x644;&#x643; &#x645;&#x647;&#x627;&#x631;&#x627;&#x62A; &#x625;&#x62F;&#x627;&#x631;&#x629; &#x627;&#x644;&#x623;&#x646;&#x638;&#x645;&#x629; &#x627;&#x644;&#x644;&#x64A;&#x646;&#x643;&#x633;&#x627;&#x648;&#x64A;&#x651;&#x629; &#x644;&#x62A;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x646;&#x638;&#x627;&#x645;&#x643;.</p>
<h3 id="&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629;-&#x647;&#x64A;&#x631;&#x648;&#x643;&#x648;">&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648;</h3>
<p>&#x647;&#x64A;&#x631;&#x648;&#x643;&#x648; &#x647;&#x64A; &#x62E;&#x62F;&#x645;&#x629; &#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x62A;&#x639;&#x62A;&#x645;&#x62F; &#x639;&#x644;&#x649; &#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x643;&#x62E;&#x62F;&#x645;&#x629; EC2. &#x645;&#x645;&#x627; &#x64A;&#x62A;&#x64A;&#x62D; &#x644;&#x646;&#x627; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x629; &#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x648;&#x644;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x648;&#x641;&#x631;&#x647;&#x627; &#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x648;&#x628;&#x62F;&#x648;&#x646; &#x627;&#x644;&#x62D;&#x627;&#x62C;&#x629; &#x644;&#x627;&#x645;&#x62A;&#x644;&#x627;&#x643; &#x62E;&#x628;&#x631;&#x629; &#x641;&#x64A; &#x625;&#x62F;&#x627;&#x631;&#x629; &#x627;&#x644;&#x623;&#x646;&#x638;&#x645;&#x629;.</p>
<p>&#x62D;&#x64A;&#x62B; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x646;&#x634;&#x631; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x628;&#x633;&#x644;&#x627;&#x633;&#x629; &#x639;&#x628;&#x631; &#x62F;&#x641;&#x639; &#x627;&#x644;&#x62A;&#x62D;&#x62F;&#x64A;&#x62B;&#x627;&#x62A; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x645;&#x62F;&#x64A;&#x631; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x62C;&#x64A;&#x62A; &#x625;&#x644;&#x649; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645;. &#x633;&#x64A;&#x648;&#x641;&#x631; &#x647;&#x630;&#x627; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x627;&#x644;&#x639;&#x646;&#x627;&#x621; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x644;&#x627; &#x62A;&#x643;&#x648;&#x646; &#x631;&#x627;&#x63A;&#x628;&#x627;&#x64B; &#x628;&#x625;&#x646;&#x62C;&#x627;&#x632; &#x627;&#x644;&#x645;&#x647;&#x627;&#x645; &#x627;&#x644;&#x635;&#x639;&#x628;&#x629; &#x64A;&#x62F;&#x648;&#x64A;&#x627;&#x64B;&#x60C; &#x643;&#x627;&#x644;&#x625;&#x62A;&#x635;&#x627;&#x644; &#x628;&#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645;&#x60C; &#x648;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x648;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x647;&#x627;&#x60C; &#x648;&#x627;&#x628;&#x62A;&#x643;&#x627;&#x631; &#x627;&#x633;&#x62A;&#x631;&#x627;&#x62A;&#x64A;&#x62C;&#x64A;&#x651;&#x629; &#x62D;&#x643;&#x64A;&#x645;&#x629; &#x644;&#x644;&#x646;&#x634;&#x631;. &#x643;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x633;&#x644;&#x627;&#x633;&#x629; &#x62A;&#x623;&#x62A;&#x64A; &#x628;&#x633;&#x639;&#x631;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648; &#x648;&#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x62A;&#x64F;&#x642;&#x62F;&#x650;&#x645; &#x628;&#x639;&#x636; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62C;&#x627;&#x646;&#x64A;&#x651;&#x629; &#x623;&#x64A;&#x636;&#x627;&#x64B;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x645;&#x648;&#x642;&#x639; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648; &#x639;&#x644;&#x649; &#x62F;&#x631;&#x633; <a href="https://devcenter.heroku.com/articles/getting-started-with-python" target="_blank">&#x64A;&#x634;&#x631;&#x62D; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x646;&#x634;&#x631; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643;</a> &#x639;&#x628;&#x631; &#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x62A;&#x647;&#x645;.
</blockquote>

<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x625;&#x62F;&#x627;&#x631;&#x629; &#x642;&#x648;&#x627;&#x639;&#x62F; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;&#x643; &#x64A;&#x62F;&#x648;&#x64A;&#x627;&#x64B; &#x64A;&#x645;&#x643;&#x646; &#x623;&#x646; &#x62A;&#x633;&#x62A;&#x63A;&#x631;&#x642; &#x648;&#x642;&#x62A;&#x627;&#x64B; &#x637;&#x648;&#x64A;&#x644;&#x627;&#x64B; &#x643;&#x645;&#x627; &#x648;&#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x625;&#x644;&#x649; &#x628;&#x639;&#x636; &#x627;&#x644;&#x62E;&#x628;&#x631;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x62C;&#x627;&#x644;. &#x625;&#x646;&#x651;&#x64E;&#x647;&#x627; &#x644;&#x641;&#x643;&#x631;&#x629; &#x633;&#x62F;&#x64A;&#x62F;&#x629; &#x623;&#x646; &#x62A;&#x639;&#x631;&#x641; &#x627;&#x644;&#x642;&#x644;&#x64A;&#x644; &#x62D;&#x648;&#x644; &#x625;&#x62F;&#x627;&#x631;&#x629; &#x642;&#x648;&#x627;&#x639;&#x62F; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x645;&#x634;&#x627;&#x631;&#x64A;&#x639;&#x643; &#x627;&#x644;&#x62C;&#x627;&#x646;&#x628;&#x64A;&#x651;&#x629;&#x60C; &#x648;&#x644;&#x643;&#x646;&#x643; &#x642;&#x62F; &#x62A;&#x631;&#x63A;&#x628; &#x623;&#x62D;&#x64A;&#x627;&#x646;&#x627;&#x64B; &#x628;&#x62A;&#x648;&#x641;&#x64A;&#x631; &#x627;&#x644;&#x648;&#x642;&#x62A; &#x648;&#x627;&#x644;&#x62C;&#x647;&#x62F; &#x639;&#x628;&#x631; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x639;&#x627;&#x646;&#x629; &#x628;&#x645;&#x62D;&#x62A;&#x631;&#x641;&#x64A;&#x646; &#xFEF7;&#x62F;&#x627;&#x621; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x647;&#x627;&#x645; &#x646;&#x64A;&#x627;&#x628;&#x629;&#x64B; &#x639;&#x646;&#x643;.
<br><br>
&#x62A;&#x648;&#x641;&#x631; &#x643;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x634;&#x631;&#x643;&#x62A;&#x64A; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648; &#x648;&#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x642;&#x648;&#x627;&#x639;&#x62F; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;. &#x644;&#x645; &#x623;&#x62C;&#x631;&#x628; &#x643;&#x644;&#x62A;&#x627; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x62A;&#x64A;&#x646; &#x62D;&#x642;&#x64A;&#x642;&#x629;&#x64B; &#x628;&#x639;&#x62F;&#x60C; &#x648;&#x644;&#x643;&#x646;&#x64A; &#x633;&#x645;&#x639;&#x62A; &#x623;&#x645;&#x648;&#x631;&#x627;&#x64B; &#x62D;&#x633;&#x646;&#x629; &#x639;&#x646; &#x643;&#x644;&#x62A;&#x627;&#x647;&#x645;&#x627;. &#x623;&#x638;&#x646; &#x623;&#x646;&#x651;&#x64E; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x62A;&#x633;&#x62A;&#x62D;&#x642; &#x623;&#x646; &#x62A;&#x648;&#x636;&#x639; &#x641;&#x64A; &#x639;&#x64A;&#x646; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x628;&#x627;&#x631; &#x625;&#x646; &#x631;&#x63A;&#x628;&#x62A; &#x64A;&#x648;&#x645;&#x627;&#x64B; &#x628;&#x62A;&#x623;&#x645;&#x64A;&#x646; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;&#x643; &#x648;&#x627;&#x644;&#x62D;&#x641;&#x627;&#x638; &#x639;&#x644;&#x64A;&#x647;&#x627; &#x628;&#x62F;&#x648;&#x646; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x630;&#x644;&#x643; &#x64A;&#x62F;&#x648;&#x64A;&#x627;&#x64B;.
<br><br>
<ul style="list-style-type: disc; list-style-position: inside;">
<li><a href="https://www.heroku.com/postgres" target="_blank">&#x62E;&#x62F;&#x645;&#x629; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648; &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x642;&#x648;&#x627;&#x639;&#x62F; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;</a>.</li>
<li><a href="https://aws.amazon.com/rds/" target="_blank">&#x62E;&#x62F;&#x645;&#x629; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x642;&#x648;&#x627;&#x639;&#x62F; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;</a>.</li>
</ul>
</blockquote>

<h3 id="&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629;-&#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644;-&#x623;&#x648;&#x634;&#x646;">&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644; &#x623;&#x648;&#x634;&#x646;</h3>
<p>&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644; &#x623;&#x648;&#x634;&#x646; &#x647;&#x64A; &#x62E;&#x62F;&#x645;&#x629; &#x645;&#x646;&#x627;&#x641;&#x633;&#x629; &#x644;&#x62E;&#x62F;&#x645;&#x629; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x638;&#x647;&#x631;&#x62A; &#x62D;&#x62F;&#x64A;&#x62B;&#x627;&#x64B;. &#x62A;&#x62A;&#x64A;&#x62D; &#x644;&#x643; &#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644; &#x623;&#x648;&#x634;&#x646;&#x60C; &#x643;&#x645;&#x627; &#x641;&#x64A; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646;&#x60C; &#x625;&#x646;&#x634;&#x627;&#x621; &#x62E;&#x648;&#x627;&#x62F;&#x645; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629;&#x60C; &#x623;&#x648; <strong>&#x642;&#x637;&#x64A;&#x631;&#x627;&#x62A;</strong> (droplets) &#x643;&#x645;&#x627; &#x62A;&#x64F;&#x633;&#x645;&#x64A;&#x647;&#x627; &#x627;&#x644;&#x634;&#x631;&#x643;&#x629;&#x60C; &#x628;&#x633;&#x644;&#x627;&#x633;&#x629; &#x648;&#x633;&#x647;&#x648;&#x644;&#x629;. &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x642;&#x637;&#x64A;&#x631;&#x627;&#x62A; &#x62A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x648;&#x633;&#x627;&#x626;&#x637; &#x62A;&#x62E;&#x632;&#x64A;&#x646; &#x645;&#x646; &#x627;&#x644;&#x646;&#x648;&#x639; &#x62B;&#x627;&#x628;&#x62A; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; (SSD)&#x60C; &#x648;&#x647;&#x64A; &#x645;&#x64A;&#x632;&#x629; &#x644;&#x627; &#x646;&#x62D;&#x635;&#x644; &#x639;&#x644;&#x64A;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x628;&#x627;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x639;&#x627;&#x62F;&#x64A;&#x629; &#x641;&#x64A; &#x62E;&#x62F;&#x645;&#x629; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646;. &#x623;&#x643;&#x628;&#x631; &#x645;&#x64A;&#x632;&#x629; &#x628;&#x631;&#x623;&#x64A; &#x62A;&#x642;&#x62F;&#x645;&#x647;&#x627; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x647;&#x64A; &#x627;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x629; &#x627;&#x644;&#x628;&#x633;&#x64A;&#x637;&#x629; &#x648;&#x627;&#x644;&#x633;&#x647;&#x644;&#x629; &#x645;&#x642;&#x627;&#x631;&#x646;&#x629;&#x64B; &#x645;&#x639; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x642;&#x62F;&#x645;&#x647;&#x627; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646;. &#x62A;&#x639;&#x62F; &#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644; &#x623;&#x648;&#x634;&#x646; &#x625;&#x62D;&#x62F;&#x649; &#x62E;&#x64A;&#x627;&#x631;&#x627;&#x62A;&#x64A; &#x627;&#x644;&#x645;&#x641;&#x636;&#x644;&#x629; &#x644;&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x645;&#x634;&#x627;&#x631;&#x64A;&#x639;&#x64A;&#x60C; &#x648;&#x623;&#x646;&#x635;&#x62D;&#x643; &#x628;&#x634;&#x62F;&#x629; &#x623;&#x646; &#x62A;&#x644;&#x642;&#x64A; &#x646;&#x638;&#x631;&#x629; &#x639;&#x644;&#x64A;&#x647;&#x627;.</p>
<p>&#x644;&#x627; &#x62A;&#x62E;&#x62A;&#x644;&#x641; &#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x641;&#x644;&#x627;&#x633;&#x643; &#x639;&#x644;&#x649; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x639;&#x646; &#x627;&#x644;&#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x641;&#x64A; &#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646;. &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x643; &#x647;&#x648; &#x628;&#x62F;&#x621; &#x642;&#x637;&#x64A;&#x651;&#x631;&#x629; &#x62C;&#x62F;&#x64A;&#x62F;&#x629; &#x62A;&#x639;&#x645;&#x644; &#x628;&#x62A;&#x648;&#x632;&#x64A;&#x639;&#x629; &#x644;&#x64A;&#x646;&#x64F;&#x643;&#x633; &#x648;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x62D;&#x62A;&#x627;&#x62C;&#x647;&#x627;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x633;&#x627;&#x647;&#x645;&#x62A; &#x634;&#x631;&#x643;&#x629; &#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644; &#x623;&#x648;&#x634;&#x646; &#x628;&#x633;&#x62E;&#x627;&#x621; &#x648;&#x62A;&#x628;&#x631;&#x651;&#x64E;&#x639;&#x62A; &#x644;&#x647;&#x630;&#x627; &#x627;&#x644;&#x643;&#x62A;&#x627;&#x628;. &#x648;&#x644;&#x643;&#x646; &#x630;&#x644;&#x643; &#x644;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x623;&#x646;&#x651;&#x64E; &#x62A;&#x648;&#x635;&#x64A;&#x62A;&#x64A; &#x644;&#x645; &#x62A;&#x643;&#x646; &#x646;&#x627;&#x628;&#x639;&#x629; &#x645;&#x646; &#x62A;&#x62C;&#x631;&#x628;&#x629; &#x634;&#x62E;&#x635;&#x64A;&#x651;&#x629;&#x60C; &#x641;&#x623;&#x646;&#x627; &#x623;&#x624;&#x643;&#x651;&#x650;&#x62F; &#x623;&#x646;&#x651;&#x64E;&#x647;&#x627; &#x643;&#x630;&#x644;&#x643;. &#x641;&#x644;&#x648; &#x623;&#x646;&#x646;&#x64A; &#x644;&#x645; &#x623;&#x643;&#x646; &#x645;&#x64F;&#x639;&#x62C;&#x628;&#x627;&#x64B; &#x628;&#x62E;&#x62F;&#x645;&#x627;&#x62A;&#x647;&#x645; &#x644;&#x645;&#x627; &#x643;&#x64F;&#x646;&#x62A; &#x637;&#x644;&#x628;&#x62A; &#x645;&#x646;&#x647;&#x645; &#x627;&#x644;&#x62A;&#x628;&#x631;&#x651;&#x64E;&#x639; &#x623;&#x635;&#x644;&#x627;&#x64B;.
</blockquote>

<h2 id="&#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A;">&#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A;</h2>
<p>&#x633;&#x646;&#x62A;&#x643;&#x644;&#x645; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x642;&#x633;&#x645; &#x639;&#x646; &#x628;&#x639;&#x636; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x62A;&#x62B;&#x628;&#x64A;&#x62A;&#x647;&#x627; &#x639;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645;&#x646;&#x627; &#x644;&#x625;&#x64A;&#x635;&#x627;&#x644; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x644;&#x644;&#x639;&#x627;&#x644;&#x645; &#x623;&#x62C;&#x645;&#x639;. &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x633;&#x627;&#x633;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C;&#x647;&#x627; &#x647;&#x64A; &#x62E;&#x627;&#x62F;&#x645; &#x623;&#x645;&#x627;&#x645;&#x64A; (front server) &#x644;&#x64A;&#x633;&#x62A;&#x642;&#x628;&#x644; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x648;&#x64A;&#x645;&#x631;&#x651;&#x650;&#x631;&#x647;&#x627; &#x644;&#x645;&#x64F;&#x646;&#x641;&#x650;&#x630; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x64F;&#x634;&#x63A;&#x651;&#x650;&#x644; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627;. &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x645;&#x627; &#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x648;&#x644;&#x630;&#x644;&#x643; &#x633;&#x646;&#x62A;&#x643;&#x644;&#x645; &#x642;&#x644;&#x64A;&#x644;&#x627;&#x64B; &#x639;&#x646; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62A;&#x648;&#x641;&#x631;&#x629; &#x644;&#x630;&#x644;&#x643; &#x623;&#x64A;&#x636;&#x627;&#x64B;.</p>
<h3 id="&#x645;&#x64F;&#x646;&#x641;&#x650;&#x630;-&#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;">&#x645;&#x64F;&#x646;&#x641;&#x650;&#x630; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;</h3>
<p>&#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;&#x64A; &#x627;&#x644;&#x630;&#x64A; &#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x647; &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643; &#x645;&#x62D;&#x644;&#x64A;&#x627;&#x64B; &#x644;&#x64A;&#x633; &#x62C;&#x64A;&#x62F;&#x627;&#x64B; &#x628;&#x645;&#x627; &#x641;&#x64A;&#x647; &#x627;&#x644;&#x643;&#x641;&#x627;&#x64A;&#x651;&#x629; &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x643;&#x62B;&#x64A;&#x631;&#x629; &#x648;&#x62D;&#x642;&#x64A;&#x642;&#x64A;&#x651;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;&#x64A;. &#x64A;&#x64F;&#x641;&#x636;&#x64E;&#x644; &#x639;&#x646;&#x62F; &#x646;&#x634;&#x631; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x625;&#x646;&#x62A;&#x627;&#x62C;&#x64A;&#x651;&#x629; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x64F;&#x646;&#x641;&#x650;&#x630; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; (application runner) &#x643;&#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; (Gunicorn). &#x64A;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x645;&#x639; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x628;&#x64A;&#x64F;&#x633;&#x650;&#x631; &#x648;&#x64A;&#x647;&#x62A;&#x645; &#x628;&#x627;&#x644;&#x623;&#x645;&#x648;&#x631; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x642;&#x62F;&#x629; &#x643;&#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x62A;&#x639;&#x62F;&#x62F; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x627;&#x633;&#x648;&#x628;&#x64A;&#x651;&#x629; (threading).</p>
<p>&#x639;&#x644;&#x64A;&#x643; &#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; <code>gunicorn</code> &#x642;&#x628;&#x644; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x645;&#x62F;&#x64A;&#x631; &#x627;&#x644;&#x62D;&#x632;&#x645; <code>pip</code>. &#x64A;&#x645;&#x643;&#x646; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x628;&#x633;&#x647;&#x648;&#x644;&#x629; &#x645;&#x639; &#x647;&#x630;&#x647; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x651;&#x629;&#x60C; &#x641;&#x643;&#x644; &#x645;&#x627; &#x64A;&#x62A;&#x637;&#x644;&#x628;&#x647; &#x627;&#x644;&#x623;&#x645;&#x631; &#x62A;&#x646;&#x641;&#x64A;&#x630; &#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629; &#x628;&#x633;&#x64A;&#x637;&#x629;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># rocket.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask

app = Flask(__name__)

<span class="hljs-meta">@app.route(&apos;/&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">index</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello World!&quot;</span>
</code></pre>
<p>&#x648;&#x627;&#x644;&#x622;&#x646; &#x644;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x634;&#x63A;&#x64A;&#x644;&#x647; &#x628;&#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x628;&#x628;&#x633;&#x627;&#x637;&#x629; &#x62A;&#x646;&#x641;&#x64A;&#x630; &#x627;&#x644;&#x623;&#x645;&#x631; <code>gunicorn</code>.</p>
<pre><code>(ourapp)$ gunicorn rocket:app
2014-03-19 16:28:54 [62924] [INFO] Starting gunicorn 18.0
2014-03-19 16:28:54 [62924] [INFO] Listening at: http://127.0.0.1:8000 (62924)
2014-03-19 16:28:54 [62924] [INFO] Using worker: sync
2014-03-19 16:28:54 [62927] [INFO] Booting worker with pid: 62927
</code></pre><p>&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x627;&#x644;&#x622;&#x646; &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x642;&#x627;&#x62F;&#x631;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x631;&#x624;&#x64A;&#x629; &#x627;&#x644;&#x639;&#x628;&#x627;&#x631;&#x629; &#x201C;!Hello World&#x201D; &#x641;&#x64A; &#x645;&#x62A;&#x635;&#x641;&#x62D;&#x643; &#x639;&#x646;&#x62F; &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x625;&#x644;&#x649; &#x627;&#x644;&#x631;&#x627;&#x628;&#x637; <em><a href="http://127.0.0.1:8000" target="_blank">http://127.0.0.1:8000</a></em>.</p>
<p>&#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x628;&#x627;&#x644;&#x62E;&#x644;&#x641;&#x64A;&#x651;&#x629; (&#x623;&#x64A; &#x62C;&#x639;&#x644;&#x647; &#x64A;&#x639;&#x645;&#x644; &#x643;&#x639;&#x641;&#x631;&#x64A;&#x62A; - daemon) &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x645;&#x631;&#x64A;&#x631; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; <code>D-</code> &#x644;&#x644;&#x623;&#x645;&#x631;. &#x648;&#x628;&#x647;&#x630;&#x647; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x633;&#x64A;&#x638;&#x644; &#x64A;&#x639;&#x645;&#x644; &#x62D;&#x62A;&#x649; &#x648;&#x644;&#x648; &#x623;&#x64F;&#x63A;&#x644;&#x650;&#x642;&#x62A; &#x62C;&#x644;&#x633;&#x629; &#x627;&#x644;&#x637;&#x631;&#x641;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A;&#x629;.</p>
<p>&#x642;&#x62F; &#x646;&#x648;&#x627;&#x62C;&#x647; &#x635;&#x639;&#x648;&#x628;&#x629; &#x628;&#x625;&#x64A;&#x62C;&#x627;&#x62F; &#x631;&#x642;&#x645; &#x627;&#x644;&#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x64A;&#x647;&#x627; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x639;&#x646;&#x62F; &#x62C;&#x639;&#x644;&#x647; &#x64A;&#x639;&#x645;&#x644; &#x643;&#x639;&#x641;&#x631;&#x64A;&#x62A;. &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x644;&#x62D;&#x644; &#x630;&#x644;&#x643; &#x625;&#x62E;&#x628;&#x627;&#x631; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x623;&#x646;&#x651;&#x64E; &#x639;&#x644;&#x64A;&#x647; &#x648;&#x636;&#x639; &#x631;&#x642;&#x645; &#x627;&#x644;&#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x64A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x64A;&#x647;&#x627; &#x641;&#x64A; &#x645;&#x644;&#x641; &#x644;&#x646;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x625;&#x64A;&#x642;&#x627;&#x641;&#x647; &#x644;&#x627;&#x62D;&#x642;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x62F;&#x648;&#x646; &#x627;&#x644;&#x628;&#x62D;&#x62B; &#x641;&#x64A; &#x642;&#x627;&#x626;&#x645;&#x629; &#x627;&#x644;&#x639;&#x645;&#x644;&#x64A;&#x627;&#x62A;. &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; <code>&lt;p &lt;file-</code> &#x644;&#x641;&#x639;&#x644; &#x630;&#x644;&#x643;.</p>
<pre><code>(ourapp)$ gunicorn rocket:app -p rocket.pid -D
(ourapp)$ cat rocket.pid
63101
</code></pre><p>&#x644;&#x625;&#x639;&#x627;&#x62F;&#x629; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x623;&#x648; &#x625;&#x64A;&#x642;&#x627;&#x641;&#x647; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x623;&#x645;&#x631;&#x64A;&#x646; <code>kill -HUP</code> &#x648; <code>kill</code> &#x639;&#x644;&#x649; &#x627;&#x644;&#x62A;&#x648;&#x627;&#x644;&#x64A;.</p>
<pre><code>(ourapp)$ kill -HUP `cat rocket.pid`
(ourapp)$ kill `cat rocket.pid`
</code></pre><p>&#x64A;&#x639;&#x645;&#x644; &#x62E;&#x627;&#x62F;&#x645; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x627;&#x644;&#x645;&#x646;&#x641;&#x630; 8000. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x631;&#x642;&#x645; &#x627;&#x644;&#x645;&#x646;&#x641;&#x630; &#x639;&#x628;&#x631; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; <code>b-</code>.</p>
<pre><code>(ourapp)$ gunicorn rocket:app -p rocket.pid -b 127.0.0.1:7999 -D
</code></pre><h4 id="&#x62C;&#x639;&#x644;-&#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645;-&#x64A;&#x62A;&#x644;&#x642;&#x649;-&#x637;&#x644;&#x628;&#x627;&#x62A;-&#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629;">&#x62C;&#x639;&#x644; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x64A;&#x62A;&#x644;&#x642;&#x649; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629;</h4>
<blockquote>
<b>&#x62A;&#x62D;&#x630;&#x64A;&#x631;</b><br>
&#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x645;&#x62E;&#x635;&#x635; &#x644;&#x64A;&#x628;&#x642;&#x649; &#x62E;&#x644;&#x641; &#x62E;&#x627;&#x62F;&#x645; &#x648;&#x643;&#x64A;&#x644; &#x639;&#x643;&#x633;&#x64A; (reverse proxy). &#x641;&#x625;&#x630;&#x627; &#x645;&#x627; &#x623;&#x62E;&#x628;&#x631;&#x62A;&#x647; &#x623;&#x646; &#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629; &#x633;&#x64A;&#x635;&#x628;&#x62D; &#x647;&#x62F;&#x641;&#x627;&#x64B; &#x633;&#x647;&#x644;&#x627;&#x64B; &#x644;&#x647;&#x62C;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x631;&#x645;&#x627;&#x646; &#x645;&#x646; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629;. &#x648;&#x630;&#x644;&#x643; &#x644;&#x623;&#x646;&#x651;&#x64E;&#x647; &#x63A;&#x64A;&#x631; &#x645;&#x62E;&#x635;&#x635; &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x647;&#x630;&#x627; &#x627;&#x644;&#x646;&#x648;&#x639; &#x645;&#x646; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;. &#x648;&#x644;&#x630;&#x644;&#x643; &#x644;&#x627; &#x62A;&#x62C;&#x639;&#x644;&#x647; &#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629; &#x625;&#x644;&#x627; &#x625;&#x646; &#x643;&#x646;&#x62A; &#x62A;&#x631;&#x64A;&#x62F; &#x62A;&#x646;&#x642;&#x64A;&#x62D; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;&#x60C; &#x648;&#x627;&#x62D;&#x631;&#x635; &#x639;&#x644;&#x649; &#x62C;&#x639;&#x644;&#x647; &#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x62F;&#x627;&#x62E;&#x644;&#x64A;&#x651;&#x629; &#x645;&#x62C;&#x62F;&#x62F;&#x627;&#x64B; &#x628;&#x639;&#x62F; &#x623;&#x646; &#x62A;&#x646;&#x62A;&#x647;&#x64A;.
</blockquote>

<p>&#x625;&#x646; &#x642;&#x645;&#x62A; &#x628;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x643;&#x645;&#x627; &#x628;&#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x641;&#x639;&#x644;&#x646;&#x627;&#x647;&#x627; &#x633;&#x627;&#x628;&#x642;&#x627;&#x64B; &#x644;&#x646; &#x62A;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x627;&#x644;&#x648;&#x635;&#x648;&#x644; &#x625;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x645;&#x646; &#x62D;&#x627;&#x633;&#x628;&#x643; &#x627;&#x644;&#x634;&#x62E;&#x635;&#x64A; (&#x623;&#x64A; &#x645;&#x646; &#x62E;&#x627;&#x631;&#x62C; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645;)&#x60C; &#x648;&#x647;&#x630;&#x627; &#x644;&#x623;&#x646;&#x651;&#x64E; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x639;&#x646;&#x648;&#x627;&#x646; &#x627;&#x644;&#x634;&#x628;&#x643;&#x629; 127.0.0.1&#x60C; &#x623;&#x64A; &#x623;&#x646;&#x651;&#x64E;&#x647; &#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x62F;&#x627;&#x62E;&#x644;&#x64A;&#x651;&#x629; &#x641;&#x642;&#x637; (&#x627;&#x644;&#x642;&#x627;&#x62F;&#x645;&#x629; &#x645;&#x646; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x646;&#x641;&#x633;&#x647;). &#x64A;&#x639;&#x645;&#x644; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x628;&#x647;&#x630;&#x627; &#x627;&#x644;&#x634;&#x643;&#x644; &#x644;&#x623;&#x646;&#x651;&#x64E;&#x647; &#x645;&#x62E;&#x635;&#x635; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x64A;&#x643;&#x648;&#x646; &#x647;&#x646;&#x627;&#x643; &#x62E;&#x627;&#x62F;&#x645; &#x648;&#x643;&#x64A;&#x644; &#x639;&#x643;&#x633;&#x64A; &#x64A;&#x639;&#x645;&#x644; &#x625;&#x644;&#x649; &#x62C;&#x627;&#x646;&#x628;&#x647;. &#x648;&#x639;&#x644;&#x649; &#x627;&#x644;&#x631;&#x63A;&#x645; &#x645;&#x646; &#x630;&#x644;&#x643;&#x60C; &#x625;&#x646; &#x623;&#x631;&#x62F;&#x62A; &#x64A;&#x648;&#x645;&#x627;&#x64B; &#x625;&#x631;&#x633;&#x627;&#x644; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629; &#x625;&#x644;&#x649; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645;&#x60C; &#x644;&#x623;&#x647;&#x62F;&#x627;&#x641; &#x62A;&#x646;&#x642;&#x64A;&#x62D;&#x64A;&#x651;&#x629; &#x645;&#x62B;&#x644;&#x627;&#x64B; (&#x644;&#x62A;&#x635;&#x62D;&#x64A;&#x62D; &#x645;&#x634;&#x627;&#x643;&#x644; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;)&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x636;&#x628;&#x637; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x644;&#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; 0.0.0.0&#x60C; &#x623;&#x64A; &#x623;&#x646; &#x64A;&#x633;&#x62A;&#x642;&#x628;&#x644; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x642;&#x627;&#x62F;&#x645;&#x629; &#x644;&#x647; (&#x627;&#x644;&#x62F;&#x627;&#x62E;&#x644;&#x64A;&#x651;&#x629; &#x648;&#x627;&#x644;&#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629;).</p>
<pre><code>(ourapp)$ gunicorn rocket:app -p rocket.pid -b 0.0.0.0:8000 -D
</code></pre><blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
<ul style="list-style-type: disc; list-style-position: inside;">
<li>&#x627;&#x642;&#x631;&#x623; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x639;&#x646; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x648;&#x646;&#x634;&#x631; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x641;&#x64A; <a href="http://docs.gunicorn.org/en/latest/" target="_blank">&#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x627;&#x644;&#x645;&#x634;&#x631;&#x648;&#x639;</a>.</li>
<li>&#x62A;&#x62A;&#x64A;&#x62D; &#x623;&#x62F;&#x627;&#x629; <a href="http://docs.fabfile.org/en/latest" target="_blank">&#x641;&#x627;&#x628;&#x631;&#x64A;&#x643;</a> &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x623;&#x648;&#x627;&#x645;&#x631; &#x627;&#x644;&#x62A;&#x64A; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x646;&#x627;&#x647;&#x627; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x628;&#x623;&#x631;&#x64A;&#x62D;&#x64A;&#x651;&#x629; &#x645;&#x646; &#x62C;&#x647;&#x627;&#x632;&#x643; &#x627;&#x644;&#x645;&#x62D;&#x644;&#x64A; &#x648;&#x628;&#x62F;&#x648;&#x646; &#x627;&#x644;&#x625;&#x62A;&#x635;&#x627;&#x644; &#x628;&#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x641;&#x64A; &#x643;&#x644; &#x645;&#x631;&#x651;&#x64E;&#x629;.</li>
</ul>
</blockquote>

<h3 id="&#x62E;&#x627;&#x62F;&#x645;-&#x625;&#x646;&#x62C;&#x646;-&#x625;&#x643;&#x633;">&#x62E;&#x627;&#x62F;&#x645; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633;</h3>
<p>&#x64A;&#x639;&#x645;&#x644; &#x62E;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x648;&#x643;&#x64A;&#x644; &#x627;&#x644;&#x639;&#x643;&#x633;&#x64A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x645;&#x64A;&#x62B;&#x627;&#x642; &#x646;&#x642;&#x644; &#x627;&#x644;&#x646;&#x635; &#x627;&#x644;&#x641;&#x627;&#x626;&#x642; (HTTP) &#x648;&#x625;&#x639;&#x627;&#x62F;&#x629; &#x625;&#x631;&#x633;&#x627;&#x644;&#x647;&#x627; &#x625;&#x644;&#x649; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x645;&#x62C;&#x62F;&#x62F;&#x627;&#x64B; &#x648;&#x645;&#x646; &#x62B;&#x645;&#x651;&#x64E; &#x625;&#x639;&#x627;&#x62F;&#x629; &#x627;&#x644;&#x631;&#x62F; &#x625;&#x644;&#x649; &#x627;&#x644;&#x639;&#x645;&#x64A;&#x644;. &#x64A;&#x639;&#x645;&#x644; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633; (Nginx) &#x643;&#x62E;&#x627;&#x62F;&#x645; &#x648;&#x643;&#x64A;&#x644; &#x639;&#x643;&#x633;&#x64A; &#x628;&#x641;&#x639;&#x627;&#x644;&#x64A;&#x651;&#x629;&#x60C; &#x643;&#x645;&#x627; &#x648;&#x64A;&#x646;&#x635;&#x62D; &#x628;&#x634;&#x62F;&#x651;&#x629; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x645;&#x639;&#x647;.</p>
<p>&#x644;&#x636;&#x628;&#x637; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633; &#x644;&#x64A;&#x639;&#x645;&#x644; &#x645;&#x639; &#x62E;&#x627;&#x62F;&#x645; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x645;&#x636;&#x628;&#x648;&#x637; &#x644;&#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; 127.0.0.1:8000 &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x644;&#x641; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631;  <em>etc/nginx/sites-available/exploreflask.com/</em> &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x639;&#x644;&#x649;:</p>
<pre><code># /etc/nginx/sites-available/exploreflask.com

# &#x644;&#x625;&#x639;&#x627;&#x62F;&#x629; &#x62A;&#x648;&#x62C;&#x64A;&#x647; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x642;&#x627;&#x62F;&#x645;&#x629; &#x645;&#x646; www.exploreflask.com &#x625;&#x644;&#x649; exploreflask.com

server {
        server_name www.exploreflask.com;
        rewrite ^ http://exploreflask.com/ permanent;
}

# &#x64A;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x642;&#x627;&#x62F;&#x645;&#x629; &#x625;&#x644;&#x649; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; exploreflask.com &#x639;&#x644;&#x649; &#x627;&#x644;&#x645;&#x646;&#x641;&#x630; 80
server {
        listen 80;
        server_name exploreflask.com;

                # Handle all locations
        location / {
                        # Pass the request to Gunicorn
                proxy_pass http://127.0.0.1:8000;

                # Set some HTTP headers so that our app knows where the
                # request really came from
                proxy_set_header Host $host;
                proxy_set_header X-Real-IP $remote_addr;
                proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
        }
}
</code></pre><p>&#x627;&#x644;&#x622;&#x646; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x625;&#x646;&#x634;&#x627;&#x621; &#x631;&#x627;&#x628;&#x637; &#x644;&#x64A;&#x651;&#x646; (symlink) &#x644;&#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x644;&#x641; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631; <em>etc/nginx/sites-enabled/</em> &#x648;&#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x625;&#x639;&#x627;&#x62F;&#x629; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633;.</p>
<pre><code>$ sudo ln -s \
/etc/nginx/sites-available/exploreflask.com \
/etc/nginx/sites-enabled/exploreflask.com
</code></pre><p>&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x627;&#x644;&#x622;&#x646; &#x623;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633; &#x642;&#x627;&#x62F;&#x631; &#x639;&#x644;&#x649; &#x627;&#x633;&#x62A;&#x642;&#x628;&#x627;&#x644; &#x637;&#x644;&#x628;&#x627;&#x62A;&#x646;&#x627; &#x648;&#x625;&#x631;&#x633;&#x627;&#x644; &#x627;&#x644;&#x631;&#x62F;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x634;&#x631;&#x62D; <a href="http://docs.gunicorn.org/en/latest/deploy.html#nginx-configuration" target="_blank">&#x642;&#x633;&#x645; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x62E;&#x627;&#x62F;&#x645; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633;</a> &#x641;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633; &#x644;&#x64A;&#x639;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645;.
</blockquote>

<h4 id="&#x648;&#x62D;&#x62F;&#x629;-proxyfix">&#x648;&#x62D;&#x62F;&#x629; ProxyFix</h4>
<p>&#x642;&#x62F; &#x62A;&#x62D;&#x62F;&#x62B; &#x645;&#x634;&#x627;&#x643;&#x644; &#x646;&#x62A;&#x64A;&#x62C;&#x629; &#x639;&#x62F;&#x645; &#x62A;&#x639;&#x627;&#x645;&#x644; &#x641;&#x644;&#x627;&#x633;&#x643; &#x645;&#x639; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x631;&#x633;&#x644;&#x629; &#x628;&#x634;&#x643;&#x644; &#x635;&#x62D;&#x64A;&#x62D;. &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x634;&#x627;&#x643;&#x644; &#x645;&#x62A;&#x639;&#x644;&#x642;&#x629; &#x628;&#x627;&#x644;&#x62A;&#x631;&#x648;&#x64A;&#x633;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x642;&#x645;&#x646;&#x627; &#x628;&#x636;&#x628;&#x637;&#x647;&#x627; &#x639;&#x646;&#x62F; &#x625;&#x639;&#x62F;&#x627;&#x62F; &#x62E;&#x627;&#x62F;&#x645; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633;. &#x644;&#x625;&#x635;&#x644;&#x627;&#x62D; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x645;&#x634;&#x627;&#x643;&#x644; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x648;&#x62D;&#x62F;&#x629; ProxyFix &#x645;&#x646; &#x645;&#x643;&#x62A;&#x628;&#x629; &#x648;&#x64A;&#x631;&#x643;&#x632;&#x648;&#x63A;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># app.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask

<span class="hljs-comment"># Import the fixer</span>
<span class="hljs-keyword">from</span> werkzeug.contrib.fixers <span class="hljs-keyword">import</span> ProxyFix

app = Flask(__name__)

<span class="hljs-comment"># Use the fixer</span>
app.wsgi_app = ProxyFix(app.wsgi_app)

<span class="hljs-meta">@app.route(&apos;/&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">index</span><span class="hljs-params">()</span>:</span>
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello World!&quot;</span>
</code></pre>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x627;&#x642;&#x631;&#x623; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x62D;&#x648;&#x644; ProxyFix &#x641;&#x64A; <a href="http://werkzeug.pocoo.org/docs/contrib/fixers/#werkzeug.contrib.fixers.ProxyFix" target="_blank">&#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x648;&#x64A;&#x631;&#x643;&#x632;&#x648;&#x63A;</a>.
</blockquote>

<h2 id="&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;">&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;</h2>
<ul style="list-style-type: disc; list-style-position: inside;">
<li>&#x647;&#x646;&#x627;&#x643; &#x62B;&#x644;&#x627;&#x62B; &#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x623;&#x646;&#x635;&#x62D;&#x643; &#x628;&#x647;&#x627; &#x644;&#x627;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x645;&#x634;&#x627;&#x631;&#x64A;&#x639;&#x643; &#x627;&#x644;&#x645;&#x643;&#x62A;&#x648;&#x628;&#x629; &#x628;&#x641;&#x644;&#x627;&#x633;&#x643;: &#x62E;&#x62F;&#x645;&#x629; &#x623;&#x645;&#x627;&#x632;&#x648;&#x646; &#x644;&#x644;&#x62D;&#x648;&#x633;&#x628;&#x629; &#x627;&#x644;&#x633;&#x62D;&#x627;&#x628;&#x64A;&#x651;&#x629;&#x60C; &#x648;&#x62E;&#x62F;&#x645;&#x629; &#x647;&#x64A;&#x631;&#x648;&#x643;&#x648;&#x60C; &#x648;&#x62E;&#x62F;&#x645;&#x629; &#x62F;&#x64A;&#x62C;&#x64A;&#x62A;&#x627;&#x644; &#x623;&#x648;&#x634;&#x646;.</li>
<li>&#x62D;&#x632;&#x645;&#x629; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x623;&#x633;&#x627;&#x633;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x62A;&#x62A;&#x623;&#x644;&#x641; &#x645;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x60C; &#x648;&#x645;&#x64F;&#x646;&#x641;&#x650;&#x630; &#x643;&#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646;&#x60C; &#x648;&#x62E;&#x627;&#x62F;&#x645; &#x648;&#x643;&#x64A;&#x644; &#x639;&#x643;&#x633;&#x64A; &#x643;&#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633;.</li>
<li>&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x623;&#x646; &#x64A;&#x639;&#x645;&#x644; &#x62E;&#x627;&#x62F;&#x645; &#x63A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x631;&#x646; &#x62E;&#x644;&#x641; &#x62E;&#x627;&#x62F;&#x645; &#x625;&#x646;&#x62C;&#x646; &#x625;&#x643;&#x633; &#x648;&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x623;&#x646; &#x64A;&#x62A;&#x646;&#x635;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; 127.0.0.1 (&#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x62F;&#x627;&#x62E;&#x644;&#x64A;&#x651;&#x629;) &#x648;&#x644;&#x64A;&#x633; &#x639;&#x644;&#x649; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; 0.0.0.0 (&#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x62E;&#x627;&#x631;&#x62C;&#x64A;&#x651;&#x629;).</li>
<li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x648;&#x62D;&#x62F;&#x629; ProxyFix &#x645;&#x646; &#x645;&#x643;&#x62A;&#x628;&#x629; &#x648;&#x64A;&#x631;&#x643;&#x632;&#x648;&#x63A; &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x62A;&#x631;&#x648;&#x64A;&#x633;&#x627;&#x62A; &#x627;&#x644;&#x635;&#x62D;&#x64A;&#x62D;&#x629; &#x641;&#x642;&#x637; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x641;&#x644;&#x627;&#x633;&#x643; &#x62E;&#x627;&#x635;&#x62A;&#x643;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="users.html" class="navigation navigation-prev " aria-label="Previous page: أساليب للتعامل مع المُستخدمين">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="conclusion.html" class="navigation navigation-next " aria-label="Next page: الخاتمة">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"النشر","level":"1.14","depth":1,"next":{"title":"الخاتمة","level":"1.15","depth":1,"path":"docs/conclusion.md","ref":"docs/conclusion.md","articles":[]},"previous":{"title":"أساليب للتعامل مع المُستخدمين","level":"1.13","depth":1,"path":"docs/users.md","ref":"docs/users.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"images/flask.png","bookmark":"images/flask.png"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"استكشف فلاسك","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/deployment.md","mtime":"2018-05-21T16:32:35.443Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-24T11:12:49.753Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

