
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>بيئة العمل · استكشف فلاسك</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="organizing.html" />
    
    
    <link rel="prev" href="coding_conventions.html" />
    

    
        <link rel="shortcut icon" href='../images/flask.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/flask.png' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    المقدمة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="coding_conventions.html">
            
                <a href="coding_conventions.html">
            
                    
                    أعراف كتابة الشيفرة البرمجية
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="environment.html">
            
                <a href="environment.html">
            
                    
                    بيئة العمل
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="organizing.html">
            
                <a href="organizing.html">
            
                    
                    تنظيم المشروع
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="configuration.html">
            
                <a href="configuration.html">
            
                    
                    الإعداد
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="views.html">
            
                <a href="views.html">
            
                    
                    استخدامات متقدمة لدوال العرض والتوجيه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="blueprints.html">
            
                <a href="blueprints.html">
            
                    
                    المخططات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="templates.html">
            
                <a href="templates.html">
            
                    
                    القوالب
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="static.html">
            
                <a href="static.html">
            
                    
                    الملفات الساكنة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="storing.html">
            
                <a href="storing.html">
            
                    
                    تخزين البيانات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    التعامل مع الاستمارات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="users.html">
            
                <a href="users.html">
            
                    
                    أساليب للتعامل مع المُستخدمين
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="deployment.html">
            
                <a href="deployment.html">
            
                    
                    النشر
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    الخاتمة
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >بيئة العمل</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x628;&#x64A;&#x626;&#x629;-&#x627;&#x644;&#x639;&#x645;&#x644;">&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x639;&#x645;&#x644;</h1>
<p><img src="../images/environment.png"></p>
<p>&#x645;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x631;&#x62C;&#x651;&#x64E;&#x62D; &#x623;&#x646;&#x651;&#x64E; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x633;&#x64A;&#x62D;&#x62A;&#x627;&#x62C; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x644;&#x64A;&#x624;&#x62F;&#x64A; &#x639;&#x645;&#x644;&#x647;. &#x641;&#x625;&#x630;&#x627; &#x644;&#x645; &#x64A;&#x62A;&#x637;&#x644;&#x628; &#x639;&#x644;&#x649; &#x627;&#x644;&#x623;&#x642;&#x644; &#x62D;&#x632;&#x645;&#x629; &#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643;&#x60C; &#x641;&#x63A;&#x627;&#x644;&#x628;&#x627;&#x64B; &#x623;&#x646;&#x62A; &#x62A;&#x642;&#x631;&#x623; &#x627;&#x644;&#x643;&#x62A;&#x627;&#x628; &#x627;&#x644;&#x62E;&#x637;&#x623;. <strong>&#x628;&#x64A;&#x626;&#x629; &#x639;&#x645;&#x644;</strong> &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x647;&#x64A; &#x643;&#x644; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x62D;&#x62A;&#x627;&#x62C;&#x647;&#x627; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x64A;&#x639;&#x645;&#x644;. &#x645;&#x646; &#x62D;&#x633;&#x646; &#x62D;&#x638;&#x646;&#x627;&#x60C; &#x64A;&#x648;&#x62C;&#x62F; &#x639;&#x62F;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647;&#x627; &#x644;&#x62C;&#x639;&#x644; &#x625;&#x62F;&#x627;&#x631;&#x629; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x639;&#x645;&#x644; &#x623;&#x642;&#x644; &#x62A;&#x639;&#x642;&#x64A;&#x62F;&#x627;&#x64B;.</p>
<h2 id="&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;-&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;-virtualenv-&#x644;&#x625;&#x62F;&#x627;&#x631;&#x629;-&#x628;&#x64A;&#x626;&#x62A;&#x643;">&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; virtualenv &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x628;&#x64A;&#x626;&#x62A;&#x643;</h2>
<p><a href="http://www.virtualenv.org/en/latest/" target="_blank">&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; virtualenv</a> &#x647;&#x64A; &#x623;&#x62F;&#x627;&#x629; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x639;&#x632;&#x644; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A;&#x643; &#x641;&#x64A; &#x645;&#x627; &#x64A;&#x633;&#x645;&#x649; <strong>&#x628;&#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629;</strong>. &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629; &#x647;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x62D;&#x648;&#x64A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x639;&#x62A;&#x645;&#x62F; &#x639;&#x644;&#x64A;&#x647;&#x627; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; (&#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A;). &#x643;&#x645;&#x627; &#x62A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x628;&#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x628;&#x639;&#x636; &#x645;&#x62A;&#x63A;&#x64A;&#x651;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x62E;&#x627;&#x635;&#x62A;&#x643; &#x644;&#x644;&#x62D;&#x641;&#x627;&#x638; &#x639;&#x644;&#x649; &#x628;&#x64A;&#x626;&#x62A;&#x643; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;&#x64A;&#x651;&#x629; &#x645;&#x64F;&#x62D;&#x62A;&#x648;&#x627;&#x629; (&#x62A;&#x62D;&#x62A; &#x627;&#x644;&#x633;&#x64A;&#x637;&#x631;&#x629;). &#x641;&#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x62A;&#x646;&#x632;&#x64A;&#x644; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x623;&#x645;&#x62B;&#x627;&#x644; &#x641;&#x644;&#x627;&#x633;&#x643; &#x641;&#x64A; &#x62F;&#x644;&#x627;&#x626;&#x644; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x641;&#x64A; &#x641;&#x636;&#x627;&#x621; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645; - &#x623;&#x648; &#x641;&#x636;&#x627;&#x621; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; - &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x646;&#x632;&#x64A;&#x644;&#x647;&#x645; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x645;&#x639;&#x632;&#x648;&#x644; &#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x646; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A; &#x641;&#x642;&#x637;. &#x647;&#x630;&#x627; &#x64A;&#x62C;&#x639;&#x644; &#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x644; &#x62A;&#x62D;&#x62F;&#x64A;&#x62F; &#x623;&#x64A; &#x625;&#x635;&#x62F;&#x627;&#x631; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x644;&#x64A;&#x62A;&#x645; &#x625;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647; &#x648;&#x62A;&#x62D;&#x62F;&#x64A;&#x62F; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x646;&#x631;&#x64A;&#x62F;&#x647;&#x627; &#x644;&#x643;&#x644; &#x645;&#x634;&#x631;&#x648;&#x639;.</p>
<p>&#x62A;&#x633;&#x645;&#x62D; &#x644;&#x646;&#x627; &#x647;&#x630;&#x647; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x651;&#x629; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629; &#x644;&#x646;&#x641;&#x633; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; &#x641;&#x64A; &#x645;&#x634;&#x627;&#x631;&#x64A;&#x639; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629;. &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x631;&#x648;&#x646;&#x629; &#x642;&#x62F; &#x62A;&#x643;&#x648;&#x646; &#x645;&#x647;&#x645;&#x629; &#x625;&#x646; &#x643;&#x646;&#x62A; &#x62A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x646;&#x638;&#x627;&#x645; &#x642;&#x62F;&#x64A;&#x645; &#x628;&#x645;&#x634;&#x627;&#x631;&#x64A;&#x639; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629; &#x62A;&#x645;&#x644;&#x643; &#x645;&#x62A;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x628;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x645;&#x62E;&#x62A;&#x644;&#x641;&#x629;.</p>
<p>&#x639;&#x646;&#x62F;&#x645;&#x627; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;&#x60C; &#x633;&#x64A;&#x635;&#x628;&#x62D; &#x644;&#x62F;&#x64A;&#x643; &#x641;&#x642;&#x637; &#x628;&#x636;&#x639;&#x629; &#x62D;&#x632;&#x645; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x645;&#x62B;&#x628;&#x62A;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645; &#x643;&#x643;&#x644;. &#x625;&#x62D;&#x62F;&#x649; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x633;&#x62A;&#x643;&#x648;&#x646; &#x623;&#x62F;&#x627;&#x629; virtualenv &#x630;&#x627;&#x62A;&#x647;&#x627;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x62D;&#x632;&#x645;&#x629; <code>virtualenv</code> &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>pip</code>.</p>
<p>&#x62D;&#x627;&#x644;&#x645;&#x627; &#x62A;&#x645;&#x62A;&#x644;&#x643; &#x627;&#x644;&#x623;&#x62F;&#x627;&#x629; &#x639;&#x644;&#x649; &#x646;&#x638;&#x627;&#x645;&#x643;&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x627;&#x644;&#x628;&#x62F;&#x621; &#x628;&#x625;&#x646;&#x634;&#x627;&#x621; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629; &#x645;&#x628;&#x627;&#x634;&#x631;&#x629;&#x64B;. &#x642;&#x645; &#x628;&#x627;&#x644;&#x630;&#x647;&#x627;&#x628; &#x625;&#x644;&#x649; &#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x634;&#x631;&#x648;&#x639; &#x648;&#x646;&#x641;&#x650;&#x630; &#x627;&#x644;&#x623;&#x645;&#x631; <code>virtualenv</code>. &#x64A;&#x623;&#x62E;&#x630; &#x647;&#x630;&#x627; &#x627;&#x644;&#x623;&#x645;&#x631; &#x645;&#x639;&#x627;&#x645;&#x644; &#x648;&#x627;&#x62D;&#x62F;&#x60C; &#x648;&#x627;&#x644;&#x630;&#x64A; &#x64A;&#x645;&#x62B;&#x644; &#x627;&#x633;&#x645; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x647;&#x62F;&#x641; &#x644;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629;. &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x64A;&#x64F;&#x638;&#x647;&#x650;&#x631; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x625;&#x646;&#x634;&#x627;&#x621; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x62F;&#x627;&#x629;.</p>
<pre><code>$ virtualenv venv
New python executable in venv/bin/python
Installing Setuptools...........[...].....done.
Installing Pip..................[...].....done.
$
</code></pre><p>&#x633;&#x64A;&#x642;&#x648;&#x645; &#x647;&#x630;&#x627; &#x627;&#x644;&#x623;&#x645;&#x631; &#x628;&#x625;&#x646;&#x634;&#x627;&#x621; &#x62F;&#x644;&#x64A;&#x644; &#x62C;&#x62F;&#x64A;&#x62F; &#x62D;&#x64A;&#x62B; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x645;&#x634;&#x631;&#x648;&#x639;&#x643;.</p>
<p>&#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x639;&#x644;&#x64A;&#x643; &#x62A;&#x641;&#x639;&#x64A;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629; &#x628;&#x639;&#x62F; &#x625;&#x646;&#x634;&#x627;&#x626;&#x647;&#x627; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x651;&#x629; <em>bin/activate</em> &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x645; &#x625;&#x646;&#x634;&#x623;&#x647;&#x627; &#x62F;&#x627;&#x62E;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629;.</p>
<pre><code>$ which python
/usr/local/bin/python
$ source venv/bin/activate
(venv)$ which python
/Users/robert/Code/myapp/venv/bin/python
</code></pre><p>&#x62A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; <em>bin/activate</em> &#x628;&#x625;&#x62C;&#x631;&#x627;&#x621; &#x628;&#x639;&#x636; &#x627;&#x644;&#x62A;&#x63A;&#x64A;&#x64A;&#x631;&#x627;&#x62A; &#x639;&#x644;&#x649; &#x645;&#x62A;&#x63A;&#x64A;&#x651;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x635;&#x62F;&#x641;&#x629; (shell) &#x62E;&#x627;&#x635;&#x62A;&#x643;&#x61B; &#x644;&#x64A;&#x634;&#x64A;&#x631; &#x643;&#x644; &#x634;&#x64A;&#x621; (&#x627;&#x644;&#x62E;&#x62F;&#x645;&#x627;&#x62A; &#x648;&#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A;) &#x625;&#x644;&#x649; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A;&#x629; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645;. &#x628;&#x639;&#x62F; &#x62A;&#x641;&#x639;&#x64A;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;&#x60C; &#x633;&#x64A;&#x634;&#x64A;&#x631; &#x627;&#x644;&#x623;&#x645;&#x631; <code>python</code> &#x625;&#x644;&#x649; &#x645;&#x64F;&#x641;&#x633;&#x650;&#x631; &#x627;&#x644;&#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x62E;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629;&#x60C; &#x643;&#x645;&#x627; &#x648;&#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x62B;&#x628;&#x62A;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>pip</code> &#x633;&#x64A;&#x62A;&#x645; &#x62A;&#x646;&#x632;&#x64A;&#x644;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645;.</p>
<p>&#x642;&#x62F; &#x62A;&#x644;&#x627;&#x62D;&#x638; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x623;&#x646; &#x645;&#x64F;&#x62D;&#x62B; &#x627;&#x644;&#x635;&#x62F;&#x641;&#x629; (shell prompt) &#x642;&#x62F; &#x62A;&#x63A;&#x64A;&#x651;&#x631; &#x623;&#x64A;&#x636;&#x627;&#x64B;. &#x648;&#x647;&#x630;&#x627; &#x644;&#x623;&#x646;&#x651; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; virtualenv &#x62A;&#x642;&#x648;&#x645; &#x628;&#x625;&#x636;&#x627;&#x641;&#x629; &#x627;&#x633;&#x645; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x641;&#x639;&#x644;&#x629; &#x625;&#x644;&#x64A;&#x647;&#x60C; &#x62D;&#x62A;&#x649; &#x62A;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x645;&#x639;&#x631;&#x641;&#x629; &#x623;&#x646;&#x651;&#x643; &#x644;&#x627; &#x62A;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x635;&#x62F;&#x641;&#x629; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645;.</p>
<p>&#x64A;&#x645;&#x643;&#x646;&#x643; &#x62A;&#x639;&#x637;&#x64A;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x623;&#x645;&#x631; <code>deactivate</code>.</p>
<pre><code>(venv)$ deactivate
$
</code></pre><h2 id="&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;-virtualenvwrapper">&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; virtualenvwrapper</h2>
<p>&#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x64E;&#x645; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; <a href="http://virtualenvwrapper.readthedocs.org/en/latest/" target="_blank">virtualenvwrapper</a> &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x646;&#x634;&#x623;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x623;&#x62F;&#x627;&#x629; virtualenv. &#x644;&#x645; &#x623;&#x631;&#x63A;&#x628; &#x628;&#x630;&#x643;&#x631; &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x62F;&#x627;&#x629; &#x642;&#x628;&#x644; &#x631;&#x624;&#x64A;&#x62A;&#x643; &#x644;&#x623;&#x633;&#x627;&#x633;&#x64A;&#x627;&#x62A; virtualenv &#x62D;&#x62A;&#x649; &#x62A;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x641;&#x647;&#x645; &#x645;&#x627; &#x627;&#x644;&#x630;&#x64A; &#x62A;&#x636;&#x64A;&#x641;&#x647; &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x62F;&#x627;&#x629; &#x648;&#x644;&#x645;&#x64E; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627;.</p>
<p>&#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x623;&#x646;&#x634;&#x623;&#x646;&#x627;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x627;&#x644;&#x633;&#x627;&#x628;&#x642; &#x62A;&#x636;&#x64A;&#x641; &#x641;&#x648;&#x636;&#x649; &#x625;&#x644;&#x649; &#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639; &#x645;&#x634;&#x631;&#x648;&#x639;&#x643;. &#x641;&#x623;&#x646;&#x62A; &#x644;&#x627; &#x62A;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639;&#x647;&#x627; &#x633;&#x648;&#x649; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x62A;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x641;&#x639;&#x64A;&#x644;&#x647;&#x627; &#x643;&#x645;&#x627; &#x644;&#x627; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x62A;&#x62A;&#x628;&#x639;&#x647;&#x627; &#x628;&#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x648;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A;&#x60C; &#x644;&#x627; &#x62F;&#x627;&#x639;&#x64A; &#x644;&#x648;&#x62C;&#x648;&#x62F;&#x647;&#x627; &#x641;&#x64A; &#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639; &#x627;&#x644;&#x645;&#x634;&#x631;&#x648;&#x639; &#x623;&#x635;&#x644;&#x627;&#x64B;. &#x627;&#x644;&#x62D;&#x644; &#x644;&#x647;&#x630;&#x627; &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x623;&#x62F;&#x627;&#x629; virtualenvwrapper. &#x62A;&#x642;&#x648;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; &#x628;&#x625;&#x628;&#x642;&#x627;&#x621; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x648;&#x627;&#x62D;&#x62F;&#x60C; &#x648;&#x627;&#x644;&#x630;&#x64A; &#x647;&#x648; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x627;&#x64B; &#x641;&#x64A; <em>virtualenvs./~</em>.</p>
<p>&#x644;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x627;&#x644;&#x623;&#x62F;&#x627;&#x629; &#x642;&#x645; &#x628;&#x627;&#x62A;&#x628;&#x627;&#x639; &#x627;&#x644;&#x625;&#x631;&#x634;&#x627;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x627;&#x644;&#x631;&#x633;&#x645;&#x64A;.</p>
<blockquote>
<b>&#x62A;&#x62D;&#x630;&#x64A;&#x631;</b><br>
&#x62A;&#x623;&#x643;&#x62F; &#x645;&#x646; &#x62A;&#x639;&#x637;&#x64A;&#x644; &#x643;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x642;&#x628;&#x644; &#x62A;&#x62B;&#x628;&#x64A;&#x62A; virtualenvwrapper. &#x641;&#x623;&#x646;&#x62A; &#x62A;&#x631;&#x64A;&#x62F; &#x62A;&#x62B;&#x628;&#x64A;&#x62A;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645; &#x648;&#x644;&#x64A;&#x633; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629;.
</blockquote>

<p>&#x648;&#x627;&#x644;&#x622;&#x646; &#x642;&#x645; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x623;&#x645;&#x631; <code>mkvirtualenv</code> &#x644;&#x625;&#x646;&#x634;&#x627;&#x621; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x62C;&#x62F;&#x64A;&#x62F;&#x629; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>virtualenv</code>:</p>
<pre><code>$ mkvirtualenv rocket
New python executable in rocket/bin/python
Installing setuptools...........[...].....done.
Installing pip..................[...].....done.
(rocket)$
</code></pre><p>&#x633;&#x64A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x623;&#x645;&#x631; <code>mkvirtualenv</code> &#x628;&#x625;&#x646;&#x634;&#x627;&#x621; &#x62F;&#x644;&#x64A;&#x644; &#x641;&#x64A; &#x645;&#x62C;&#x644;&#x62F; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x62E;&#x627;&#x635;&#x62A;&#x643; &#x648;&#x633;&#x64A;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x641;&#x639;&#x64A;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x644;&#x643;. &#x643;&#x645;&#x627; &#x633;&#x627;&#x628;&#x642;&#x627;&#x64B;&#x60C; &#x633;&#x64A;&#x634;&#x64A;&#x631; &#x645;&#x64F;&#x641;&#x633;&#x650;&#x631; <code>python</code> &#x648;&#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; <code>pip</code> &#x625;&#x644;&#x649; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x638;&#x627;&#x645;. &#x644;&#x62A;&#x641;&#x639;&#x64A;&#x644; &#x628;&#x64A;&#x626;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x645;&#x639;&#x64A;&#x646;&#x629; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x623;&#x645;&#x631; <code>[&#x627;&#x633;&#x645; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;] workon</code>. &#x645;&#x627;&#x64A;&#x632;&#x627;&#x644; &#x627;&#x644;&#x623;&#x645;&#x631; <code>deactivate</code> &#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x62A;&#x639;&#x637;&#x64A;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x626;&#x629;.</p>
<h3 id="&#x62A;&#x62A;&#x628;&#x639;-&#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A;">&#x62A;&#x62A;&#x628;&#x639; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A;</h3>
<p>&#x645;&#x639; &#x646;&#x645;&#x648; &#x645;&#x634;&#x631;&#x648;&#x639;&#x643;&#x60C; &#x633;&#x62A;&#x62C;&#x62F; &#x623;&#x646;&#x651;&#x64E; &#x642;&#x627;&#x626;&#x645;&#x629; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x62A;&#x646;&#x645;&#x648; &#x645;&#x639;&#x647;. &#x641;&#x625;&#x646;&#x651;&#x64E;&#x647; &#x644;&#x64A;&#x633; &#x645;&#x646; &#x63A;&#x64A;&#x631; &#x627;&#x644;&#x645;&#x623;&#x644;&#x648;&#x641; &#x623;&#x646;&#x652; &#x62A;&#x62D;&#x62A;&#x627;&#x62C; &#x625;&#x644;&#x649; &#x639;&#x634;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x641;&#x644;&#x627;&#x633;&#x643;. &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x623;&#x633;&#x647;&#x644; &#x644;&#x625;&#x62F;&#x627;&#x631;&#x629; &#x647;&#x630;&#x627; &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x644;&#x641; &#x646;&#x635;&#x64A; &#x628;&#x633;&#x64A;&#x637;. &#x62A;&#x62D;&#x62A;&#x648;&#x64A; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; <code>pip</code> &#x639;&#x644;&#x649; &#x62E;&#x627;&#x635;&#x64A;&#x651;&#x629; &#x62A;&#x648;&#x644;&#x651;&#x650;&#x62F; &#x645;&#x644;&#x641; &#x646;&#x635;&#x64A; &#x64A;&#x633;&#x631;&#x62F; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62B;&#x628;&#x62A;&#x629;. &#x643;&#x645;&#x627; &#x62A;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x642;&#x631;&#x627;&#x621;&#x62A;&#x647; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x644;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x643;&#x644; &#x62D;&#x632;&#x645;&#x629; &#x645;&#x633;&#x631;&#x648;&#x62F;&#x629; &#x641;&#x64A;&#x647; &#x639;&#x644;&#x649; &#x646;&#x638;&#x627;&#x645; &#x622;&#x62E;&#x631;&#x60C; &#x623;&#x648; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x637;&#x627;&#x632;&#x62C;&#x629;.</p>
<h4 id="&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629;-pip-freeze">&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x629; pip freeze</h4>
<p>&#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x646;&#x635;&#x64A; <em>requirements.txt</em> &#x645;&#x646; &#x642;&#x628;&#x644; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643; &#x644;&#x633;&#x631;&#x62F; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x645;&#x637;&#x644;&#x648;&#x628;&#x629; &#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x647;&#x630;&#x627; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;. &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x64A;&#x634;&#x631;&#x62D; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x625;&#x646;&#x634;&#x627;&#x621; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x644;&#x641;&#x60C; &#x643;&#x645;&#x627; &#x64A;&#x634;&#x631;&#x62D; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x644;&#x64A;&#x647; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x646;&#x635;&#x64A; &#x644;&#x62A;&#x62B;&#x628;&#x64A;&#x62A; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x641;&#x64A; &#x628;&#x64A;&#x626;&#x629; &#x62C;&#x62F;&#x64A;&#x62F;&#x629;.</p>
<pre><code>(rocket)$ pip freeze &gt; requirements.txt
</code></pre><pre><code>$ workon fresh-env
(fresh-env)$ pip install -r requirements.txt
[...]
Successfully installed flask Werkzeug Jinja2 itsdangerous markupsafe
Cleaning up...
(fresh-env)$
</code></pre><h3 id="&#x627;&#x644;&#x62A;&#x62A;&#x628;&#x639;-&#x627;&#x644;&#x64A;&#x62F;&#x648;&#x64A;-&#x644;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A;">&#x627;&#x644;&#x62A;&#x62A;&#x628;&#x639; &#x627;&#x644;&#x64A;&#x62F;&#x648;&#x64A; &#x644;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A;</h3>
<p>&#x645;&#x639; &#x646;&#x645;&#x648; &#x645;&#x634;&#x631;&#x648;&#x639;&#x643;&#x60C; &#x642;&#x62F; &#x62A;&#x62C;&#x62F; &#x628;&#x639;&#x636; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62F;&#x631;&#x62C;&#x629; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x627;&#x644;&#x623;&#x645;&#x631; <code>pip freeze</code> &#x644;&#x64A;&#x633;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x648;&#x627;&#x642;&#x639; &#x636;&#x631;&#x648;&#x631;&#x64A;&#x651;&#x629; &#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;. &#x62D;&#x64A;&#x62B; &#x633;&#x64A;&#x643;&#x648;&#x646; &#x644;&#x62F;&#x64A;&#x643; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62B;&#x628;&#x62A;&#x629; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x641;&#x64A; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x641;&#x642;&#x637;. &#x627;&#x644;&#x623;&#x645;&#x631; <code>pip freeze</code> &#x644;&#x627; &#x64A;&#x645;&#x64A;&#x651;&#x632; &#x628;&#x64A;&#x646; &#x627;&#x644;&#x625;&#x62B;&#x646;&#x64A;&#x646;&#x60C; &#x641;&#x647;&#x648; &#x64A;&#x642;&#x648;&#x645; &#x641;&#x642;&#x637; &#x628;&#x625;&#x62F;&#x631;&#x627;&#x62C; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x62B;&#x628;&#x62A;&#x629; &#x62D;&#x627;&#x644;&#x64A;&#x627;&#x64B;. &#x643;&#x646;&#x62A;&#x64A;&#x62C;&#x629; &#x644;&#x630;&#x644;&#x643;&#x60C; &#x642;&#x62F; &#x62A;&#x631;&#x63A;&#x628; &#x628;&#x62A;&#x62A;&#x628;&#x639; &#x625;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A;&#x643; &#x64A;&#x62F;&#x648;&#x64A;&#x627;&#x64B; &#x639;&#x646;&#x62F; &#x625;&#x636;&#x627;&#x641;&#x62A;&#x647;&#x627;. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x641;&#x635;&#x644; &#x628;&#x64A;&#x646; &#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x636;&#x631;&#x648;&#x631;&#x64A;&#x651;&#x629; &#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x648;&#x627;&#x644;&#x62D;&#x632;&#x645; &#x627;&#x644;&#x636;&#x631;&#x648;&#x631;&#x64A;&#x651;&#x629; &#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;&#x647; &#x648;&#x648;&#x636;&#x639;&#x647;&#x645; &#x641;&#x64A; &#x645;&#x644;&#x641;&#x64A;&#x646; &#x645;&#x646;&#x641;&#x635;&#x644;&#x64A;&#x646; (&#x628;&#x627;&#x644;&#x627;&#x633;&#x645; <em>require_run.txt</em> &#x648; <em>require_dev.txt</em> &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;).</p>
<h2 id="&#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645;-&#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;">&#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;</h2>
<p>&#x627;&#x62E;&#x62A;&#x631; &#x646;&#x638;&#x627;&#x645; &#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x648;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x647;. &#x627;&#x646;&#x635;&#x62D;&#x643; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x62C;&#x64A;&#x62A; (Git). &#x645;&#x645;&#x627; &#x631;&#x623;&#x64A;&#x62A;&#x647;&#x60C; &#x62C;&#x64A;&#x62A; &#x647;&#x648; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; &#x627;&#x644;&#x623;&#x643;&#x62B;&#x631; &#x634;&#x639;&#x628;&#x64A;&#x651;&#x629; &#x644;&#x644;&#x645;&#x634;&#x627;&#x631;&#x64A;&#x639; &#x627;&#x644;&#x62C;&#x62F;&#x64A;&#x62F;&#x629; &#x647;&#x630;&#x647; &#x627;&#x644;&#x623;&#x64A;&#x627;&#x645;. &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x642;&#x627;&#x62F;&#x631;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x62D;&#x630;&#x641; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x62F;&#x648;&#x646; &#x627;&#x644;&#x62D;&#x627;&#x62C;&#x629; &#x625;&#x644;&#x649; &#x627;&#x644;&#x642;&#x644;&#x642; &#x645;&#x646; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x623;&#x62E;&#x637;&#x627;&#x621; &#x644;&#x627; &#x631;&#x62C;&#x639;&#x629; &#x641;&#x64A;&#x647;&#x627; &#x634;&#x64A;&#x621;&#x64C; &#x644;&#x627; &#x64A;&#x642;&#x62F;&#x631; &#x628;&#x62B;&#x645;&#x646;. &#x62D;&#x64A;&#x62B; &#x633;&#x62A;&#x643;&#x648;&#x646; &#x642;&#x627;&#x62F;&#x631;&#x627;&#x64B; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62D;&#x641;&#x627;&#x638; &#x639;&#x644;&#x649; &#x645;&#x634;&#x631;&#x648;&#x639;&#x643; &#x62E;&#x627;&#x644;&#x64A;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x62A;&#x639;&#x644;&#x64A;&#x642;&#x627;&#x62A;&#x60C; &#x644;&#x623;&#x646;&#x651;&#x647; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x62D;&#x630;&#x641; &#x645;&#x627; &#x62A;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x622;&#x646; &#x648;&#x627;&#x644;&#x631;&#x62C;&#x648;&#x639; &#x639;&#x646; &#x627;&#x644;&#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x625;&#x630;&#x627; &#x62F;&#x639;&#x62A; &#x627;&#x644;&#x62D;&#x627;&#x62C;&#x629;. &#x625;&#x636;&#x627;&#x641;&#x629;&#x64B; &#x644;&#x630;&#x644;&#x643;&#x60C; &#x633;&#x62A;&#x645;&#x644;&#x643; &#x646;&#x633;&#x62E; &#x625;&#x62D;&#x62A;&#x64A;&#x627;&#x637;&#x64A;&#x629; &#x644;&#x645;&#x634;&#x631;&#x648;&#x639;&#x643; &#x639;&#x644;&#x649; &#x62C;&#x64A;&#x62A;&#x647;&#x627;&#x628;&#x60C; &#x623;&#x648; Bitbucket&#x60C; &#x623;&#x648; &#x62E;&#x627;&#x62F;&#x645; Gitolite &#x62E;&#x627;&#x635; &#x628;&#x643;.</p>
<h3 id="&#x645;&#x627;&#x630;&#x627;-&#x64A;&#x62C;&#x628;-&#x623;&#x646;-&#x623;&#x64F;&#x628;&#x642;&#x64A;-&#x62E;&#x627;&#x631;&#x62C;-&#x646;&#x638;&#x627;&#x645;-&#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645;-&#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;&#x61F;">&#x645;&#x627;&#x630;&#x627; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x623;&#x64F;&#x628;&#x642;&#x64A; &#x62E;&#x627;&#x631;&#x62C; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;&#x61F;</h3>
<p>&#x639;&#x627;&#x62F;&#x629;&#x64B; &#x645;&#x627; &#x623;&#x628;&#x642;&#x64A; &#x645;&#x644;&#x641; &#x62E;&#x627;&#x631;&#x62C; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x644;&#x633;&#x628;&#x628;&#x64D; &#x623;&#x648; &#x633;&#x628;&#x628;&#x64A;&#x646;. &#x625;&#x645;&#x627; &#x644;&#x623;&#x646;&#x651;&#x647; &#x62E;&#x631;&#x62F;&#x629; (&#x63A;&#x64A;&#x631; &#x636;&#x631;&#x648;&#x631;&#x64A;)&#x60C; &#x623;&#x648; &#x644;&#x623;&#x646;&#x651;&#x647; &#x633;&#x631;&#x64A;. &#x645;&#x644;&#x641;&#x627;&#x62A; <em>pyc.</em> &#x648;&#x627;&#x644;&#x628;&#x64A;&#x626;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; - &#x625;&#x646; &#x643;&#x646;&#x62A; &#x644;&#x627; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; virtualenvwrapper &#x644;&#x633;&#x628;&#x628;&#x64D; &#x645;&#x627; - &#x623;&#x645;&#x62B;&#x644;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62E;&#x631;&#x62F;&#x629;. &#x648;&#x630;&#x644;&#x643; &#x644;&#x623;&#x646;&#x647;&#x645; &#x644;&#x64A;&#x633;&#x648;&#x627; &#x628;&#x62D;&#x627;&#x62C;&#x629; &#xFEF7;&#x646; &#x64A;&#x643;&#x648;&#x646;&#x648;&#x627; &#x641;&#x64A; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x644;&#x623;&#x646;&#x647; &#x645;&#x646; &#x627;&#x644;&#x645;&#x645;&#x643;&#x646; &#x625;&#x639;&#x627;&#x62F;&#x629; &#x625;&#x646;&#x634;&#x627;&#x626;&#x647;&#x645; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x644;&#x641;&#x627;&#x62A; <em>py.</em> &#x648; <em>requirement.txt</em> &#x639;&#x644;&#x649; &#x627;&#x644;&#x62A;&#x648;&#x627;&#x644;&#x64A;.</p>
<p>&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x627;&#x644;&#x648;&#x627;&#x62C;&#x647;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x641;&#x627;&#x62A;&#x64A;&#x62D; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629; &#x644;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x60C; &#x648;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x647;&#x64A; &#x623;&#x645;&#x62B;&#x644;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x623;&#x633;&#x631;&#x627;&#x631;. &#x644;&#x623;&#x646;&#x647; &#x644;&#x627; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x648;&#x62C;&#x648;&#x62F;&#x647;&#x645; &#x641;&#x64A; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A; &#x644;&#x623;&#x646;&#x651;&#x64E; &#x643;&#x634;&#x641;&#x647;&#x645; &#x633;&#x64A;&#x643;&#x648;&#x646; &#x62E;&#x631;&#x642;&#x627;&#x64B; &#x623;&#x645;&#x646;&#x64A;&#x627;&#x64B; &#x643;&#x628;&#x64A;&#x631;&#x627;&#x64B;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x639;&#x646;&#x62F;&#x645;&#x627; &#x627;&#x62A;&#x62E;&#x62F; &#x642;&#x631;&#x627;&#x631;&#x627;&#x62A; &#x645;&#x62A;&#x639;&#x644;&#x642;&#x629; &#x628;&#x627;&#x644;&#x623;&#x645;&#x646;&#x60C; &#x63A;&#x627;&#x644;&#x628;&#x627;&#x64B; &#x645;&#x627; &#x623;&#x641;&#x62A;&#x631;&#x636; &#x623;&#x646; &#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639;&#x64A; &#x633;&#x64A;&#x635;&#x628;&#x62D; &#x638;&#x627;&#x647;&#x631;&#x627;&#x64B; &#x644;&#x644;&#x639;&#x645;&#x648;&#x645; &#x641;&#x64A; &#x645;&#x631;&#x62D;&#x644;&#x629;&#x64D; &#x645;&#x627;. &#x648;&#x647;&#x630;&#x627; &#x64A;&#x639;&#x646;&#x64A; &#x627;&#x644;&#x625;&#x628;&#x642;&#x627;&#x621; &#x639;&#x644;&#x649; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629; &#x648;&#x639;&#x62F;&#x645; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636; &#x623;&#x646;&#x647; &#x644;&#x646; &#x64A;&#x62A;&#x645; &#x627;&#x644;&#x639;&#x62B;&#x648;&#x631; &#x639;&#x644;&#x649; &#x62B;&#x63A;&#x631;&#x629; &#x623;&#x645;&#x646;&#x64A;&#x629;&#x61B; &#xFEF7;&#x646;&#x651;&#x64E; &#x645;&#x628;&#x62F;&#x623; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636; &#x623;&#x646; &quot;&#x645;&#x646; &#x633;&#x64A;&#x633;&#x62A;&#x637;&#x64A;&#x639; &#x62A;&#x62E;&#x645;&#x64A;&#x646; &#x623;&#x646;&#x647;&#x627; &#x62A;&#x62A;&#x645;&#x643;&#x646; &#x645;&#x646; &#x641;&#x639;&#x644; &#x630;&#x644;&#x643;&#x61F;&quot; &#x645;&#x639;&#x631;&#x648;&#x641; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x62C;&#x627;&#x644; &#x627;&#x644;&#x623;&#x645;&#x646;&#x64A; &#x628;&#x627;&#x644;&#x625;&#x628;&#x647;&#x627;&#x645; (obscurity) &#x648;&#x647;&#x64A; &#x633;&#x64A;&#x627;&#x633;&#x629; &#x633;&#x64A;&#x626;&#x629; &#x644;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F; &#x639;&#x644;&#x64A;&#x647;&#x627;.
</blockquote>

<p>&#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x62C;&#x64A;&#x62A;&#x60C; &#x64A;&#x645;&#x643;&#x646;&#x643; &#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x644;&#x641; &#x62E;&#x627;&#x635; &#x64A;&#x62F;&#x639;&#x649; <em>gitignore.</em> &#x641;&#x64A; &#x645;&#x633;&#x62A;&#x648;&#x62F;&#x639;&#x643;. &#x642;&#x645; &#x628;&#x633;&#x631;&#x62F; &#x623;&#x646;&#x645;&#x627;&#x637; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x644;&#x641; &#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x62D;&#x631;&#x648;&#x641; &#x628;&#x62F;&#x644; (Wildcard) &#x644;&#x62A;&#x637;&#x627;&#x628;&#x642; &#x623;&#x633;&#x645;&#x627;&#x621; &#x645;&#x644;&#x641;&#x627;&#x62A; &#x645;&#x639;&#x64A;&#x646;&#x629;. &#x623;&#x64A; &#x645;&#x644;&#x641; &#x64A;&#x62A;&#x637;&#x627;&#x628;&#x642; &#x645;&#x639; &#x623;&#x62D;&#x62F; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x623;&#x646;&#x645;&#x627;&#x637; &#x633;&#x64A;&#x62A;&#x645; &#x62A;&#x62C;&#x627;&#x647;&#x644;&#x647; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x62C;&#x64A;&#x62A;. &#x623;&#x646;&#x635;&#x62D;&#x643; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x644;&#x641; <em>gitignore.</em> &#x627;&#x644;&#x645;&#x648;&#x636;&#x62D; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x644;&#x644;&#x62A;&#x648;&#x636;&#x62D; &#x627;&#x644;&#x641;&#x643;&#x631;&#x629;.</p>
<pre><code>*.pyc
instance/
</code></pre><p>&#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x64E;&#x645; &#x645;&#x62C;&#x644;&#x62F;&#x627;&#x62A; <em>instance</em> &#x644;&#x62C;&#x639;&#x644; &#x645;&#x62A;&#x63A;&#x64A;&#x651;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x629; &#x645;&#x62A;&#x627;&#x62D;&#x629; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x628;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x623;&#x643;&#x62B;&#x631; &#x623;&#x645;&#x627;&#x646;&#x627;&#x64B;. &#x633;&#x646;&#x62A;&#x62D;&#x62F;&#x62B; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x639;&#x646;&#x647;&#x645; &#x644;&#x627;&#x62D;&#x642;&#x627;&#x64B;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x645;&#x643;&#x646;&#x643; &#x642;&#x631;&#x627;&#x621;&#x629; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x62D;&#x648;&#x644; &#x645;&#x644;&#x641; <i>gitignore.</i> &#x639;&#x644;&#x649; <a href="http://git-scm.com/docs/gitignore" target="_blank">http://git-scm.com/docs/gitignore</a>
</blockquote>

<h2 id="&#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;-&#x62A;&#x635;&#x62D;&#x64A;&#x62D;-&#x627;&#x644;&#x623;&#x62E;&#x637;&#x627;&#x621;">&#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D; (&#x62A;&#x635;&#x62D;&#x64A;&#x62D; &#x627;&#x644;&#x623;&#x62E;&#x637;&#x627;&#x621;)</h2>
<h3 id="&#x648;&#x636;&#x639;-&#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;">&#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;</h3>
<p>&#x64A;&#x623;&#x62A;&#x64A; &#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643; &#x645;&#x639; &#x645;&#x64A;&#x632;&#x629; &#x645;&#x641;&#x64A;&#x62F;&#x629; &#x62A;&#x62F;&#x639;&#x649; &quot;&#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;&quot;. &#x639;&#x644;&#x64A;&#x643; &#x62A;&#x639;&#x64A;&#x64A;&#x646; <code>debug = True</code> &#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644;&#x647;&#x627; &#x641;&#x64A; &#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631; &#x62E;&#x627;&#x635;&#x62A;&#x643;. &#x639;&#x646;&#x62F;&#x645;&#x627; &#x64A;&#x643;&#x648;&#x646; &#x647;&#x630;&#x627; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; &#x642;&#x64A;&#x62F; &#x627;&#x644;&#x639;&#x645;&#x644;&#x60C; &#x64A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x628;&#x625;&#x639;&#x627;&#x62F;&#x629; &#x627;&#x644;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x639;&#x646;&#x62F; &#x625;&#x62C;&#x631;&#x627;&#x621; &#x62A;&#x63A;&#x64A;&#x64A;&#x631;&#x627;&#x62A; &#x639;&#x644;&#x649; &#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x648;&#x633;&#x62A;&#x638;&#x647;&#x631; &#x627;&#x644;&#x623;&#x62E;&#x637;&#x627;&#x621; &#x641;&#x64A; &#x631;&#x635;&#x629; &#x62A;&#x62A;&#x628;&#x639; (stack trace) &#x648;&#x648;&#x62D;&#x62F;&#x629; &#x62A;&#x62D;&#x643;&#x645; &#x62A;&#x641;&#x627;&#x639;&#x644;&#x64A;&#x629; (interactive console).</p>
<blockquote>
<b>&#x62A;&#x62D;&#x630;&#x64A;&#x631;</b><br>
&#x627;&#x646;&#x62A;&#x628;&#x647; &#x645;&#x646; &#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D; &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x625;&#x646;&#x62A;&#x627;&#x62C;. &#x62A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x648;&#x62D;&#x62F;&#x629; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x627;&#x644;&#x62A;&#x641;&#x627;&#x639;&#x644;&#x64A;&#x629; &#x62A;&#x639;&#x633;&#x641;&#x64A;&#x627;&#x64B; &#x645;&#x646; &#x62A;&#x646;&#x641;&#x64A;&#x630; &#x62A;&#x639;&#x644;&#x64A;&#x645;&#x627;&#x62A; &#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x645;&#x645;&#x627; &#x633;&#x64A;&#x624;&#x62F;&#x64A; &#x625;&#x644;&#x649; &#x647;&#x634;&#x627;&#x634;&#x629; &#x623;&#x645;&#x646;&#x64A;&#x629; &#x643;&#x628;&#x64A;&#x631;&#x629; &#x625;&#x630;&#x627; &#x62A;&#x64F;&#x631;&#x650;&#x643;&#x62A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x64A;&#x629; &#x642;&#x64A;&#x62F; &#x627;&#x644;&#x639;&#x645;&#x644; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x648;&#x642;&#x639; &#x627;&#x644;&#x62D;&#x64A; (&#x627;&#x644;&#x645;&#x631;&#x641;&#x648;&#x639; &#x639;&#x644;&#x649; &#x627;&#x644;&#x634;&#x627;&#x628;&#x643;&#x629;).
</blockquote>

<h3 id="&#x623;&#x62F;&#x627;&#x629;-flask-debugtoolbar">&#x623;&#x62F;&#x627;&#x629; Flask-DebugToolbar</h3>
<p>&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; <a href="http://flask-debugtoolbar.readthedocs.org/en/latest/" target="_blank">Flask-DebugToolbar</a> &#x647;&#x64A; &#x623;&#x62F;&#x627;&#x629; &#x631;&#x627;&#x626;&#x639;&#x629; &#x623;&#x62E;&#x631;&#x649; &#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D; &#x627;&#x644;&#x645;&#x634;&#x627;&#x643;&#x644; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;. &#x641;&#x64A; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;&#x60C; &#x633;&#x62A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x623;&#x62F;&#x627;&#x629; &#x628;&#x625;&#x636;&#x627;&#x641;&#x629; &#x634;&#x631;&#x64A;&#x637; &#x62C;&#x627;&#x646;&#x628;&#x64A; &#x641;&#x64A; &#x643;&#x644; &#x635;&#x641;&#x62D;&#x629; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;. &#x647;&#x630;&#x627; &#x627;&#x644;&#x634;&#x631;&#x64A;&#x637; &#x64A;&#x648;&#x641;&#x650;&#x631; &#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x62D;&#x648;&#x644; &#x627;&#x633;&#x62A;&#x639;&#x644;&#x627;&#x645;&#x627;&#x62A; SQL&#x60C; &#x648;&#x627;&#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644; (logging)&#x60C; &#x648;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;&#x60C; &#x648;&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x648;&#x627;&#x644;&#x625;&#x639;&#x62F;&#x627;&#x62F;&#x627;&#x62A; &#x648;&#x63A;&#x64A;&#x631;&#x647;&#x627; &#x645;&#x646; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621; &#x627;&#x644;&#x62C;&#x645;&#x64A;&#x644;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x62A;&#x62C;&#x639;&#x644; &#x62A;&#x62A;&#x628;&#x639; &#x627;&#x644;&#x623;&#x62E;&#x637;&#x627;&#x621; &#x623;&#x633;&#x647;&#x644;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
<ul style="list-style-type: disc; list-style-position: inside;">
  <li>&#x62E;&#x630; &#x646;&#x638;&#x631;&#x629; &#x639;&#x644;&#x649; <a href="http://flask.pocoo.org/docs/quickstart/#debug-mode" target="_blank">&#x642;&#x633;&#x645; &#x627;&#x644;&#x628;&#x62F;&#x627;&#x64A;&#x629; &#x627;&#x644;&#x633;&#x631;&#x64A;&#x639;&#x629; &#x645;&#x639; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;</a>.</li>
  <li>&#x64A;&#x648;&#x62C;&#x62F; &#x628;&#x639;&#x636; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x62C;&#x64A;&#x62F;&#x629; &#x62D;&#x648;&#x644; &#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x623;&#x62E;&#x637;&#x627;&#x621;&#x60C; &#x648;&#x627;&#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644;&#x60C; &#x648;&#x627;&#x644;&#x639;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x645;&#x646;&#x642;&#x62D;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62E;&#x631;&#x649; <a href="http://flask.pocoo.org/docs/errorhandling" target="_blank">&#x641;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643;</a>.</li>
</ul>
</blockquote>

<h2 id="&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;">&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;</h2>
<ul style="list-style-type: disc; list-style-position: inside;">
  <li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x623;&#x62F;&#x627;&#x629; virtualenv &#x644;&#x625;&#x628;&#x642;&#x627;&#x621; &#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643; &#x641;&#x64A; &#x645;&#x643;&#x627;&#x646; &#x648;&#x627;&#x62D;&#x62F;.</li>
  <li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x623;&#x62F;&#x627;&#x629; virtualenvwrapper &#x644;&#x625;&#x628;&#x642;&#x627;&#x621; &#x628;&#x64A;&#x626;&#x627;&#x62A;&#x643; &#x627;&#x644;&#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x629; &#x641;&#x64A; &#x645;&#x643;&#x627;&#x646; &#x648;&#x627;&#x62D;&#x62F;.</li>
  <li>&#x62A;&#x62A;&#x628;&#x651;&#x64E;&#x639; &#x627;&#x644;&#x627;&#x639;&#x62A;&#x645;&#x627;&#x62F;&#x64A;&#x627;&#x62A; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x644;&#x641; &#x646;&#x635;&#x64A; &#x623;&#x648; &#x623;&#x643;&#x62B;&#x631;.</li>
  <li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x646;&#x638;&#x627;&#x645; &#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;. &#x623;&#x646;&#x635;&#x62D;&#x643; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x62C;&#x64A;&#x62A;.</li>
  <li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x644;&#x641; gitignore. &#x644;&#x625;&#x628;&#x642;&#x627;&#x621; &#x627;&#x644;&#x641;&#x648;&#x636;&#x649; &#x648;&#x627;&#x644;&#x623;&#x633;&#x631;&#x627;&#x631; &#x62E;&#x627;&#x631;&#x62C; &#x646;&#x638;&#x627;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x643;&#x645; &#x628;&#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;&#x627;&#x62A;.</li>
  <li>&#x64A;&#x645;&#x646;&#x62D;&#x643; &#x648;&#x636;&#x639; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D; &#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x62D;&#x648;&#x644; &#x627;&#x644;&#x645;&#x634;&#x627;&#x643;&#x644; &#x641;&#x64A; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x648;&#x64A;&#x631;.</li>
  <li>&#x633;&#x62A;&#x645;&#x646;&#x62D;&#x643; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-DebugToolbar &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x641;&#x64A;&#x62F;&#x629; &#x641;&#x64A; &#x639;&#x645;&#x644;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x646;&#x642;&#x64A;&#x62D;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="coding_conventions.html" class="navigation navigation-prev " aria-label="Previous page: أعراف كتابة الشيفرة البرمجية">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="organizing.html" class="navigation navigation-next " aria-label="Next page: تنظيم المشروع">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"بيئة العمل","level":"1.4","depth":1,"next":{"title":"تنظيم المشروع","level":"1.5","depth":1,"path":"docs/organizing.md","ref":"docs/organizing.md","articles":[]},"previous":{"title":"أعراف كتابة الشيفرة البرمجية","level":"1.3","depth":1,"path":"docs/coding_conventions.md","ref":"docs/coding_conventions.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"images/flask.png","bookmark":"images/flask.png"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"استكشف فلاسك","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/environment.md","mtime":"2018-05-21T16:32:35.443Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-21T16:37:24.111Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

