
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>التعامل مع الاستمارات · استكشف فلاسك</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="conclusion.html" />
    
    
    <link rel="prev" href="storing.html" />
    

    
        <link rel="shortcut icon" href='../images/flask.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/flask.png' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    المقدمة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="coding_conventions.html">
            
                <a href="coding_conventions.html">
            
                    
                    مواثيق كتابة الشيفرة البرمجية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="environment.html">
            
                <a href="environment.html">
            
                    
                    بيئة العمل
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="organizing.html">
            
                <a href="organizing.html">
            
                    
                    تنظيم المشروع
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="configuration.html">
            
                <a href="configuration.html">
            
                    
                    الإعداد
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="views.html">
            
                <a href="views.html">
            
                    
                    استخدامات متقدمة لدوال العرض والتوجيه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="blueprints.html">
            
                <a href="blueprints.html">
            
                    
                    المخططات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="templates.html">
            
                <a href="templates.html">
            
                    
                    القوالب
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="static.html">
            
                <a href="static.html">
            
                    
                    الملفات الساكنة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="storing.html">
            
                <a href="storing.html">
            
                    
                    تخزين البيانات
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    التعامل مع الاستمارات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    الخاتمة
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >التعامل مع الاستمارات</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644;-&#x645;&#x639;-&#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;">&#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;</h1>
<p><img src="../images/forms.png"></p>
<p>&#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; (form) &#x647;&#x64A; &#x639;&#x646;&#x635;&#x631; &#x623;&#x633;&#x627;&#x633;&#x64A; &#x64A;&#x62A;&#x64A;&#x62D; &#x644;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x646; &#x627;&#x644;&#x62A;&#x641;&#x627;&#x639;&#x644; &#x645;&#x639; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x648;&#x64A;&#x628;. &#x644;&#x627; &#x64A;&#x642;&#x62F;&#x645; &#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643; - &#x636;&#x645;&#x646;&#x64A;&#x627;&#x64B; - &#x623;&#x64A; &#x634;&#x64A;&#x621; &#x644;&#x64A;&#x633;&#x627;&#x639;&#x62F;&#x646;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x64A;&#x648;&#x62C;&#x62F; &#x641;&#x64A; &#x628;&#x62D;&#x631; &#x625;&#x636;&#x627;&#x641;&#x627;&#x62A; &#x641;&#x644;&#x627;&#x633;&#x643; &#x627;&#x644;&#x63A;&#x646;&#x64A;&#x60C; &#x643;&#x627;&#x644;&#x645;&#x64F;&#x639;&#x62A;&#x627;&#x62F;&#x60C; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x648;&#x641;&#x631; &#x644;&#x646;&#x627; &#x625;&#x645;&#x643;&#x627;&#x646;&#x64A;&#x651;&#x629; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x62D;&#x632;&#x645;&#x629; WTForms &#x627;&#x644;&#x634;&#x647;&#x64A;&#x631;&#x629; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A;&#x646;&#x627;. &#x62A;&#x62C;&#x639;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x648;&#x627;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;&#x647;&#x627; &#x633;&#x647;&#x644;&#x627;&#x64B; &#x648;&#x628;&#x633;&#x64A;&#x637;&#x627;&#x64B;.</p>
<h2 id="&#x625;&#x636;&#x627;&#x641;&#x629;-flask-wtf">&#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF</h2>
<p>&#x623;&#x648;&#x644; &#x645;&#x627; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x647; &#x645;&#x639; &#x647;&#x630;&#x647; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; (&#x628;&#x639;&#x62F; &#x62A;&#x62B;&#x628;&#x64A;&#x62A;&#x647;&#x627; &#x637;&#x628;&#x639;&#x627;&#x64B;) &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x644;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x628;&#x633;&#x64A;&#x637;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; <code>myapp.forms</code>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># ourapp/forms.py</span>

<span class="hljs-keyword">from</span> flask_wtf <span class="hljs-keyword">import</span> Form
<span class="hljs-keyword">from</span> wtforms <span class="hljs-keyword">import</span> StringField, PasswordField
<span class="hljs-keyword">from</span> wtforms.validators <span class="hljs-keyword">import</span> DataRequired, Email

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">EmailPasswordForm</span><span class="hljs-params">(Form)</span>:</span>
    email = StringField(<span class="hljs-string">&apos;Email&apos;</span>, validators=[DataRequired(), Email()])
    password = PasswordField(<span class="hljs-string">&apos;Password&apos;</span>, validators=[DataRequired()])
</code></pre>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x648;&#x641;&#x64E;&#x631;&#x64E;&#x62A; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x623;&#x63A;&#x644;&#x641;&#x62A;&#x647;&#x627; (wrappers) &#x627;&#x644;&#x62E;&#x627;&#x635;&#x629;&#x60C; &#x644;&#x62D;&#x64A;&#x646; &#x642;&#x62F;&#x648;&#x645; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; &#x627;&#x644;&#x62B;&#x627;&#x646;&#x64A;&#x60C; &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x62D;&#x642;&#x648;&#x644; &#x625;&#x62F;&#x62E;&#x627;&#x644; (fields) &#x648;&#x645;&#x635;&#x627;&#x62F;&#x642;&#x627;&#x62A; (validators) &#x62D;&#x632;&#x645;&#x629; WTForms. &#x648;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A;&#x60C; &#x642;&#x62F; &#x62A;&#x62C;&#x62F; &#x641;&#x64A; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x627;&#x62A; &#x623;&#x646;&#x651;&#x64E;&#x647; &#x64A;&#x62A;&#x645; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; <code>TextField</code>&#x60C; &#x648; <code>PasswordField</code> &#x648;&#x63A;&#x64A;&#x631;&#x647;&#x627; &#x645;&#x646; &#x645;&#x643;&#x62A;&#x628;&#x629; <code>flask_wtforms</code> &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; <code>wtforms</code>.
<br><br>
&#x628;&#x62F;&#x621;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631; 0.9 &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x64A;&#x631;&#x627;&#x62F; &#x643;&#x644; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621; &#x645;&#x646; &#x62D;&#x632;&#x645;&#x629; <code>wtforms</code> &#x645;&#x628;&#x627;&#x634;&#x631;&#x629;&#x64B;.
</blockquote>

<p>&#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x639;&#x631;&#x641;&#x646;&#x627;&#x647;&#x627; &#x647;&#x64A; &#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x62F;&#x62E;&#x648;&#x644; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x64A;&#x646;. &#x643;&#x627;&#x646; &#x628;&#x625;&#x645;&#x643;&#x627;&#x646;&#x646;&#x627; &#x62A;&#x633;&#x645;&#x64A;&#x62A;&#x647;&#x627; <code>SigninForm</code>&#x60C; &#x648;&#x644;&#x643;&#x646; &#x645;&#x646; &#x62E;&#x644;&#x627;&#x644; &#x627;&#x644;&#x627;&#x628;&#x62A;&#x639;&#x627;&#x62F; &#x639;&#x646; &#x625;&#x637;&#x644;&#x627;&#x642; &#x62A;&#x633;&#x645;&#x64A;&#x627;&#x62A; &#x645;&#x62D;&#x62F;&#x62F;&#x629; &#x633;&#x64A;&#x643;&#x648;&#x646; &#x628;&#x625;&#x645;&#x643;&#x627;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x646;&#x641;&#x633; &#x627;&#x644;&#x635;&#x646;&#x641; &#x641;&#x64A; &#x623;&#x634;&#x64A;&#x627;&#x621; &#x623;&#x62E;&#x631;&#x649;&#x60C; &#x643;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647; &#x641;&#x64A; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x625;&#x646;&#x634;&#x627;&#x621; &#x627;&#x644;&#x62D;&#x633;&#x627;&#x628; &#x645;&#x62B;&#x644;&#x627;&#x64B;. &#x633;&#x64A;&#x648;&#x62F;&#x64A; &#x628;&#x646;&#x627; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x623;&#x635;&#x646;&#x627;&#x641; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x644;&#x623;&#x647;&#x62F;&#x627;&#x641; &#x645;&#x62D;&#x62F;&#x62F;&#x629; &#x625;&#x644;&#x649; &#x625;&#x646;&#x634;&#x627;&#x621; &#x627;&#x644;&#x639;&#x62F;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x623;&#x635;&#x646;&#x627;&#x641; &#x627;&#x644;&#x645;&#x62A;&#x634;&#x627;&#x628;&#x647;&#x629; &#x627;&#x644;&#x63A;&#x64A;&#x631; &#x636;&#x631;&#x648;&#x631;&#x64A;&#x651;&#x629;. &#x645;&#x646; &#x627;&#x644;&#x623;&#x641;&#x636;&#x644; &#x62A;&#x633;&#x645;&#x64A;&#x651;&#x629; &#x635;&#x646;&#x648;&#x641; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x645;&#x62D;&#x62A;&#x648;&#x627;&#x647;&#x627;&#x60C; &#x641;&#x647;&#x630;&#x627; &#x645;&#x627; &#x64A;&#x645;&#x64A;&#x651;&#x632;&#x64F;&#x647;&#x627; &#x639;&#x646; &#x63A;&#x64A;&#x631;&#x647;&#x627;. &#x628;&#x627;&#x644;&#x631;&#x63A;&#x645; &#x645;&#x646; &#x630;&#x644;&#x643;&#x60C; &#x633;&#x646;&#x62D;&#x62A;&#x627;&#x62C; &#x641;&#x64A; &#x628;&#x639;&#x636; &#x627;&#x644;&#x623;&#x62D;&#x64A;&#x627;&#x646; &#x625;&#x644;&#x649; &#x625;&#x646;&#x634;&#x627;&#x621; &#x623;&#x635;&#x646;&#x627;&#x641; &#x645;&#x62D;&#x62F;&#x62F;&#x629; &#x627;&#x644;&#x63A;&#x631;&#x636;&#x60C; &#x648;&#x62D;&#x64A;&#x646;&#x647;&#x627; &#x644;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x627;&#x62E;&#x62A;&#x64A;&#x627;&#x631; &#x627;&#x633;&#x645; &#x64A;&#x635;&#x641; &#x648;&#x638;&#x64A;&#x641;&#x62A;&#x647;&#x627; &#x645;&#x634;&#x643;&#x644;&#x629;.</p>
<p>&#x633;&#x62A;&#x642;&#x648;&#x645; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x628;&#x639;&#x62F;&#x629; &#x623;&#x645;&#x648;&#x631; &#x639;&#x646;&#x62F; &#x639;&#x645;&#x644;&#x647;&#x627;. &#x62D;&#x64A;&#x62B; &#x633;&#x62A;&#x642;&#x648;&#x645; &#x628;&#x62D;&#x645;&#x627;&#x64A;&#x629; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627; &#x645;&#x646; &#x62B;&#x63A;&#x631;&#x627;&#x62A; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; (CSRF)&#x60C; &#x648;&#x62A;&#x646;&#x642;&#x64A;&#x62D; &#x645;&#x62F;&#x62E;&#x644;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x628;&#x646;&#x627;&#x621;&#x64B; &#x639;&#x644;&#x649; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x630;&#x64A; &#x62D;&#x62F;&#x62F;&#x646;&#x627;&#x647; (&#x641;&#x645;&#x62B;&#x644;&#x627;&#x64B; &#x627;&#x644;&#x628;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x625;&#x644;&#x643;&#x62A;&#x631;&#x648;&#x646;&#x64A; &#x64A;&#x62C;&#x628; &#x623;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x644;&#x647; &#x634;&#x643;&#x644; &#x645;&#x62D;&#x62F;&#x62F; &#x648;&#x643;&#x630;&#x644;&#x643; &#x631;&#x642;&#x645; &#x627;&#x644;&#x647;&#x627;&#x62A;&#x641;).</p>
<h3 id="&#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642;-&#x645;&#x646;-&#x647;&#x62C;&#x645;&#x627;&#x62A;-&#x62A;&#x632;&#x648;&#x64A;&#x631;-&#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;-&#x648;&#x627;&#x644;&#x648;&#x642;&#x627;&#x64A;&#x629;-&#x645;&#x646;&#x647;&#x627;">&#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646; &#x647;&#x62C;&#x645;&#x627;&#x62A; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x648;&#x627;&#x644;&#x648;&#x642;&#x627;&#x64A;&#x629; &#x645;&#x646;&#x647;&#x627;</h3>
<p>&#x64A;&#x639;&#x62F; &#x627;&#x644;&#x645;&#x635;&#x637;&#x644;&#x62D; CSRF &#x627;&#x62E;&#x62A;&#x635;&#x627;&#x631;&#x627;&#x64B; &#x644;&#x640; &quot;Cross Site Request Forgery&quot; (&#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;). &#x62A;&#x646;&#x637;&#x648;&#x64A; &#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x647;&#x62C;&#x648;&#x645; &#x639;&#x644;&#x649; &#x642;&#x64A;&#x627;&#x645; &#x637;&#x631;&#x641; &#x62B;&#x627;&#x644;&#x62B; &#x628;&#x62A;&#x632;&#x648;&#x64A;&#x631; &#x637;&#x644;&#x628; (&#x643;&#x625;&#x631;&#x633;&#x627;&#x644; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629;) &#x648;&#x625;&#x631;&#x633;&#x627;&#x644;&#x647; &#x644;&#x62E;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;. &#x64A;&#x639;&#x62A;&#x642;&#x62F; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x628; &#x628;&#x647;&#x630;&#x647; &#x627;&#x644;&#x62B;&#x63A;&#x631;&#x629; &#x623;&#x646;&#x651;&#x64E; &#x630;&#x644;&#x643; &#x627;&#x644;&#x637;&#x644;&#x628; - &#x627;&#x644;&#x645;&#x632;&#x648;&#x651;&#x64E;&#x631; - &#x642;&#x627;&#x62F;&#x645; &#x645;&#x646; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x645;&#x64F;&#x633;&#x62A;&#x636;&#x627;&#x641;&#x629; &#x639;&#x644;&#x64A;&#x647;&#x60C; &#x641;&#x64A;&#x62A;&#x635;&#x631;&#x641; &#x648;&#x643;&#x623;&#x646;&#x651;&#x64E;&#x647; &#x637;&#x644;&#x628; &#x639;&#x627;&#x62F;&#x64A;.</p>
<p>&#x625;&#x644;&#x64A;&#x643; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x648;&#x636;&#x651;&#x650;&#x62D; &#x62E;&#x637;&#x648;&#x631;&#x629; &#x627;&#x644;&#x647;&#x62C;&#x645;&#x629;: &#x644;&#x646;&#x642;&#x644; &#x623;&#x646;&#x651;&#x64E;&#x643; &#x645;&#x64F;&#x633;&#x62C;&#x651;&#x64E;&#x644; &#x644;&#x62F;&#x649; &#x645;&#x632;&#x648;&#x62F; &#x62E;&#x62F;&#x645;&#x629; &#x628;&#x631;&#x64A;&#x62F; &#x625;&#x644;&#x643;&#x62A;&#x631;&#x648;&#x646;&#x64A;&#x60C; &#x648;&#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x632;&#x648;&#x62F; &#x64A;&#x62A;&#x64A;&#x62D; &#x644;&#x643; &#x62D;&#x630;&#x641; &#x62D;&#x633;&#x627;&#x628;&#x643; &#x639;&#x628;&#x631; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x628;&#x633;&#x64A;&#x637;&#x629;. &#x62A;&#x64F;&#x631;&#x633;&#x650;&#x644; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x637;&#x644;&#x628;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x648;&#x639; POST &#x625;&#x644;&#x649; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; <code>account_delete</code> &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x62D;&#x630;&#x641; &#x627;&#x644;&#x62D;&#x633;&#x627;&#x628; &#x627;&#x644;&#x630;&#x64A; &#x643;&#x627;&#x646; &#x645;&#x64F;&#x633;&#x62C;&#x644;&#x627;&#x64B; &#x639;&#x646;&#x62F; &#x625;&#x631;&#x633;&#x627;&#x644; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629;. &#x627;&#x644;&#x622;&#x646; &#x62F;&#x639;&#x646;&#x627; &#x646;&#x64F;&#x646;&#x634;&#x626; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629;&#x64B; &#x62C;&#x62F;&#x64A;&#x62F;&#x629;&#x60C; &#x648;&#x644;&#x62A;&#x643;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x639;&#x644;&#x649; &#x62E;&#x627;&#x62F;&#x645; &#x622;&#x62E;&#x631; &#x63A;&#x64A;&#x631; &#x630;&#x627;&#x643;. &#x633;&#x62A;&#x64F;&#x631;&#x633;&#x650;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629;&#x60C; &#x623;&#x64A;&#x636;&#x627;&#x64B;&#x60C; &#x637;&#x644;&#x628;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x646;&#x648;&#x639; POST &#x625;&#x644;&#x649; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; <code>account_delete</code> &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x639;&#x644;&#x649; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x627;&#x644;&#x623;&#x635;&#x644;&#x64A;. &#x645;&#x627;&#x630;&#x627; &#x644;&#x648; &#x623;&#x642;&#x646;&#x639;&#x646;&#x627; &#x627;&#x644;&#x622;&#x646; &#x634;&#x62E;&#x635;&#x627;&#x64B; &#x628;&#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x625;&#x644;&#x649; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x62A;&#x646;&#x627; &#x648;&#x636;&#x63A;&#x637; &#x632;&#x631; &#x627;&#x644;&#x625;&#x631;&#x633;&#x627;&#x644; (&#x623;&#x648; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x630;&#x644;&#x643; &#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x627;&#x64B; &#x639;&#x646;&#x62F; &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644; &#x625;&#x644;&#x649; &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62C;&#x627;&#x641;&#x627;&#x633;&#x643;&#x631;&#x628;&#x62A;)&#x61F; &#x633;&#x64A;&#x64F;&#x62D;&#x630;&#x64E;&#x641; &#x62D;&#x633;&#x627;&#x628;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62C;&#x651;&#x64E;&#x644; (&#x625;&#x630;&#x627; &#x643;&#x627;&#x646;&#x62A; &#x644;&#x62F;&#x64A;&#x647; &#x62C;&#x644;&#x633;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x64F;&#x62A;&#x635;&#x641;&#x650;&#x62D;) &#x639;&#x646;&#x62F; &#x645;&#x632;&#x648;&#x62F; &#x627;&#x644;&#x628;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x625;&#x644;&#x643;&#x62A;&#x631;&#x648;&#x646;&#x64A; &#x630;&#x627;&#x643;. &#x643;&#x627;&#x646; &#x64A;&#x645;&#x643;&#x646; &#x62A;&#x641;&#x627;&#x62F;&#x64A; &#x630;&#x644;&#x643; &#x644;&#x648; &#x643;&#x627;&#x646; &#x645;&#x648;&#x642;&#x639; &#x645;&#x632;&#x648;&#x62F; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x62E;&#x62F;&#x645;&#x629; &#x623;&#x630;&#x643;&#x649; &#x648;&#x64A;&#x633;&#x62A;&#x637;&#x64A;&#x639; &#x627;&#x644;&#x62A;&#x645;&#x64A;&#x64A;&#x632; &#x628;&#x64A;&#x646; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x642;&#x627;&#x62F;&#x645;&#x629; &#x645;&#x646; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629; &#x644;&#x62F;&#x64A;&#x647; &#x623;&#x648; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x642;&#x627;&#x62F;&#x645;&#x629; &#x645;&#x646; &#x645;&#x648;&#x627;&#x642;&#x639; &#x623;&#x62E;&#x631;&#x649;.</p>
<p>&#x643;&#x64A;&#x641; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x625;&#x630;&#x627;&#x64B; &#x625;&#x64A;&#x642;&#x627;&#x641; &#x630;&#x644;&#x643; &#x627;&#x644;&#x648;&#x62B;&#x648;&#x642; &#x627;&#x644;&#x623;&#x639;&#x645;&#x649; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x627;&#x62A;&#x646;&#x627; &#x628;&#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x645;&#x646; &#x627;&#x644;&#x646;&#x648;&#x639; POST&#x61F; &#x62A;&#x62C;&#x639;&#x644; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x630;&#x644;&#x643; &#x645;&#x64F;&#x645;&#x643;&#x646;&#x627;&#x64B; &#x639;&#x628;&#x631; &#x62A;&#x648;&#x644;&#x64A;&#x62F; &#x631;&#x645;&#x632; &#x645;&#x645;&#x64A;&#x632; (token) &#x639;&#x646;&#x62F; &#x62A;&#x635;&#x64A;&#x64A;&#x631; (rendering) &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;. &#x64A;&#x64F;&#x631;&#x633;&#x64E;&#x644; &#x630;&#x644;&#x643; &#x627;&#x644;&#x631;&#x645;&#x632; &#x625;&#x644;&#x649; &#x627;&#x644;&#x62E;&#x627;&#x62F;&#x645; &#x645;&#x639; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x637;&#x644;&#x628; &#x648;&#x64A;&#x62A;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646;&#x647; &#x642;&#x628;&#x644; &#x642;&#x628;&#x648;&#x644; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;. &#x627;&#x644;&#x641;&#x643;&#x631;&#x629; &#x627;&#x644;&#x623;&#x633;&#x627;&#x633;&#x64A;&#x651;&#x629; &#x644;&#x647;&#x630;&#x627; &#x627;&#x644;&#x631;&#x645;&#x632; &#x623;&#x646;&#x651;&#x64E;&#x647; &#x64A;&#x64F;&#x636;&#x627;&#x641; &#x625;&#x644;&#x649; &#x645;&#x62A;&#x63A;&#x64A;&#x651;&#x631; &#x641;&#x64A; &#x62C;&#x644;&#x633;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x650;&#x645; &#x648;&#x62A;&#x646;&#x62A;&#x647;&#x64A; &#x635;&#x644;&#x627;&#x62D;&#x64A;&#x62A;&#x647; &#x628;&#x639;&#x62F; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x64F;&#x639;&#x64A;&#x646; &#x645;&#x646; &#x627;&#x644;&#x648;&#x642;&#x62A; (&#x628;&#x639;&#x62F; &#x62B;&#x644;&#x627;&#x62B;&#x64A;&#x646; &#x62F;&#x642;&#x64A;&#x642;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x627;&#x64B;). &#x648;&#x628;&#x647;&#x630;&#x647; &#x627;&#x644;&#x637;&#x631;&#x64A;&#x642;&#x629; &#x627;&#x644;&#x648;&#x62D;&#x64A;&#x62F; &#x645;&#x646; &#x64A;&#x633;&#x62A;&#x637;&#x64A;&#x639; &#x625;&#x631;&#x633;&#x627;&#x644; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x647;&#x648; &#x645;&#x64E;&#x646;&#x652; &#x641;&#x64E;&#x62A;&#x64E;&#x62D;&#x64E;&#x647;&#x627; (&#x623;&#x648; &#x634;&#x62E;&#x635; &#x645;&#x627; &#x639;&#x644;&#x649; &#x646;&#x641;&#x633; &#x627;&#x644;&#x62D;&#x627;&#x633;&#x628;)&#x60C; &#x648;&#x644;&#x62F;&#x64A;&#x647; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x645;&#x647;&#x644;&#x629; &#x62B;&#x644;&#x627;&#x62B;&#x64A;&#x646; &#x62F;&#x642;&#x64A;&#x642;&#x629; (&#x623;&#x648; &#x623;&#x64A; &#x648;&#x642;&#x62A; &#x62A;&#x62D;&#x62F;&#x62F;&#x647; &#x623;&#x646;&#x62A;) &#x644;&#x625;&#x631;&#x633;&#x627;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x628;&#x639;&#x62F; &#x641;&#x62A;&#x62D; &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
<ul style="list-style-type: disc; list-style-position: inside;">
<li>&#x627;&#x642;&#x631;&#x623; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x62D;&#x648;&#x644; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x62A;&#x648;&#x644;&#x64A;&#x62F; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x644;&#x62A;&#x644;&#x643; &#x627;&#x644;&#x631;&#x645;&#x648;&#x632; &#x627;&#x644;&#x645;&#x645;&#x64A;&#x632;&#x629; &#x641;&#x64A; <a href="http://wtforms.simplecodes.com/docs/1.0.1/ext.html#module-wtforms.ext.csrf.session" target="_blank">&#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629;</a>.</li>
<li>&#x627;&#x642;&#x631;&#x623; &#x627;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x639;&#x646; &#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x641;&#x64A; <a href="https://www.owasp.org/index.php/CSRF" target="_blank">&#x645;&#x648;&#x633;&#x648;&#x639;&#x629; &#x623;&#x648;&#x627;&#x633;&#x628;</a>.</li>
</ul>
</blockquote>

<p>&#x639;&#x644;&#x64A;&#x646;&#x627; &#x628;&#x62F;&#x627;&#x64A;&#x629;&#x64B; &#x625;&#x646;&#x634;&#x627;&#x621; &#x62F;&#x627;&#x644;&#x629; &#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x642;&#x628;&#x644; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x644;&#x644;&#x648;&#x642;&#x627;&#x64A;&#x629; &#x645;&#x646; &#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;:</p>
<pre><code class="lang-python"><span class="hljs-comment"># ourapp/views.py</span>

<span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> render_template, redirect, url_for

<span class="hljs-keyword">from</span> . <span class="hljs-keyword">import</span> app
<span class="hljs-keyword">from</span> .forms <span class="hljs-keyword">import</span> EmailPasswordForm

<span class="hljs-meta">@app.route(&apos;/login&apos;, methods=[&quot;GET&quot;, &quot;POST&quot;])</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">login</span><span class="hljs-params">()</span>:</span>
    form = EmailPasswordForm()
    <span class="hljs-keyword">if</span> form.validate_on_submit():

        <span class="hljs-comment"># &#x643;&#x648;&#x62F; &#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646; &#x643;&#x644;&#x645;&#x629; &#x645;&#x631;&#x648;&#x631; &#x648;&#x627;&#x633;&#x645; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x62E;&#x62F;&#x645;</span>
        <span class="hljs-comment"># [...]</span>

        <span class="hljs-keyword">return</span> redirect(url_for(<span class="hljs-string">&apos;index&apos;</span>))
    <span class="hljs-keyword">return</span> render_template(<span class="hljs-string">&apos;login.html&apos;</span>, form=form)
</code></pre>
<p>&#x642;&#x645;&#x646;&#x627; &#x628;&#x62F;&#x627;&#x64A;&#x629;&#x64B; &#x628;&#x627;&#x633;&#x62A;&#x64A;&#x631;&#x627;&#x62F; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; <code>forms</code> &#x648;&#x627;&#x633;&#x62A;&#x647;&#x644;&#x627;&#x644;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629;. &#x648;&#x645;&#x646; &#x62B;&#x645; &#x642;&#x645;&#x646;&#x627; &#x628;&#x62A;&#x634;&#x63A;&#x64A;&#x644; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; <code>form.validate_on_submit</code>. &#x62A;&#x64F;&#x631;&#x62C;&#x650;&#x639; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; <code>True</code> &#x625;&#x646; &#x643;&#x627;&#x646;&#x62A; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x642;&#x62F; &#x623;&#x64F;&#x631;&#x633;&#x650;&#x644;&#x64E;&#x62A; (&#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x646;&#x642;&#x644; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; POST &#x623;&#x648; PUT &#x645;&#x62B;&#x644;&#x627;&#x64B;) &#x648;&#x62A;&#x645; &#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646;&#x647;&#x627; &#x645;&#x646; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x639;&#x631;&#x641;&#x646;&#x627;&#x647;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x648;&#x62D;&#x62F;&#x629; <em>forms.py</em>.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
<ul style="list-style-type: disc; list-style-position: inside;">
<li><a href="https://flask-wtf.readthedocs.io/en/latest/api.html#flask_wtf.Form.validate_on_submit" target="_blank">&#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x635;&#x646;&#x641;&#x64A;&#x651;&#x629; Form.validate_on_submit</a></li>
<li><a href="https://github.com/lepture/flask-wtf/blob/v0.9.5/flask_wtf/form.py#L151" target="_blank">&#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x645;&#x635;&#x62F;&#x631;&#x64A;&#x651;&#x629; &#x644;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x635;&#x646;&#x641;&#x64A;&#x651;&#x629; Form.validate_on_submit</a></li>
</ul>
</blockquote>

<p>&#x633;&#x62A;&#x642;&#x648;&#x645; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x639;&#x646;&#x62F;&#x645;&#x627; &#x62A;&#x631;&#x649; &#x623;&#x646;&#x651;&#x64E; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x644;&#x645; &#x62A;&#x64F;&#x631;&#x633;&#x64E;&#x644; &#x628;&#x639;&#x62F; (&#x623;&#x64A; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x64F;&#x633;&#x62A;&#x64F;&#x62F;&#x639;&#x64A;&#x62A; &#x628;&#x637;&#x644;&#x628; GET) &#x628;&#x62A;&#x645;&#x631;&#x64A;&#x631; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646; <code>form</code> &#x625;&#x644;&#x649; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; <em>login.html</em> &#x648;&#x62A;&#x635;&#x64A;&#x64A;&#x631;&#x647;. &#x64A;&#x648;&#x62C;&#x62F; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x627;&#x644;&#x634;&#x643;&#x644; &#x627;&#x644;&#x630;&#x64A; &#x633;&#x62A;&#x628;&#x62F;&#x648; &#x639;&#x644;&#x64A;&#x647; &#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x639;&#x646;&#x62F; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x64A;&#x632;&#x629; &#x627;&#x644;&#x62D;&#x645;&#x627;&#x64A;&#x629; &#x645;&#x646; &#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;.</p>
<pre><code class="lang-html">{# ourapp/templates/login.html #}

{% extends &quot;layout.html&quot; %}
<span class="hljs-tag">&lt;<span class="hljs-name">html</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">head</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">title</span>&gt;</span>Login Page<span class="hljs-tag">&lt;/<span class="hljs-name">title</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">head</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">form</span> <span class="hljs-attr">action</span>=<span class="hljs-string">&quot;{{ url_for(&apos;login&apos;) }}&quot;</span> <span class="hljs-attr">method</span>=<span class="hljs-string">&quot;post&quot;</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;text&quot;</span> <span class="hljs-attr">name</span>=<span class="hljs-string">&quot;email&quot;</span> /&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;password&quot;</span> <span class="hljs-attr">name</span>=<span class="hljs-string">&quot;password&quot;</span> /&gt;</span>
            {{ form.csrf_token }}
        <span class="hljs-tag">&lt;/<span class="hljs-name">form</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">html</span>&gt;</span>
</code></pre>
<p>&#x62A;&#x64F;&#x646;&#x634;&#x626; &#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; <code>{{ form.csrf_token }}</code> &#x62D;&#x642;&#x644;&#x627;&#x64B; &#x645;&#x62E;&#x641;&#x64A;&#x627;&#x64B; &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x639;&#x644;&#x649; &#x630;&#x644;&#x643; &#x627;&#x644;&#x631;&#x645;&#x632; &#x627;&#x644;&#x641;&#x631;&#x64A;&#x62F; &#x644;&#x62A;&#x62A;&#x62D;&#x642;&#x642; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x645;&#x646;&#x647; &#x639;&#x646;&#x62F; &#x625;&#x631;&#x633;&#x627;&#x644; &#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629;. &#x647;&#x630;&#x627; &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647; &#x648;&#x628;&#x62F;&#x648;&#x646; &#x625;&#x62C;&#x631;&#x627;&#x621; &#x623;&#x64A; &#x639;&#x645;&#x644;&#x64A;&#x627;&#x62A; &#x62A;&#x62D;&#x642;&#x642;&#x64A;&#x651;&#x629; &#x623;&#x62E;&#x631;&#x649;.</p>
<h4 id="&#x62D;&#x645;&#x627;&#x64A;&#x629;-&#x637;&#x644;&#x628;&#x627;&#x62A;-&#x627;&#x644;&#x623;&#x62C;&#x627;&#x643;&#x633;-&#x645;&#x646;-&#x62B;&#x63A;&#x631;&#x629;-&#x62A;&#x632;&#x648;&#x64A;&#x631;-&#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;">&#x62D;&#x645;&#x627;&#x64A;&#x629; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62C;&#x627;&#x643;&#x633; &#x645;&#x646; &#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;</h4>
<p>&#x644;&#x627; &#x62A;&#x642;&#x62A;&#x635;&#x631; &#x623;&#x647;&#x645;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x631;&#x645;&#x648;&#x632; &#x627;&#x644;&#x641;&#x631;&#x64A;&#x62F;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x648;&#x644;&#x651;&#x62F;&#x647;&#x627; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x648;&#x62D;&#x633;&#x628;. &#x641;&#x645;&#x646; &#x627;&#x644;&#x645;&#x645;&#x643;&#x646; &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x647;&#x646;&#x627;&#x643; &#x623;&#x646;&#x648;&#x627;&#x639; &#x623;&#x62E;&#x631;&#x649; &#x645;&#x646; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x62A;&#x632;&#x648;&#x64A;&#x631;&#x647;&#x627; (&#x645;&#x62B;&#x644; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62C;&#x627;&#x643;&#x633;)&#x60C; &#x644;&#x630;&#x644;&#x643; &#x639;&#x644;&#x64A;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x64A;&#x651;&#x629; &#x641;&#x64A; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x623;&#x64A;&#x636;&#x627;&#x64B;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x639;&#x644;&#x649; &#x642;&#x633;&#x645; &#x64A;&#x62A;&#x643;&#x644;&#x651;&#x645; &#x639;&#x646; <a href="https://flask-wtf.readthedocs.io/en/latest/csrf.html#ajax" target="_blank">&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x631;&#x645;&#x648;&#x632; &#x627;&#x644;&#x648;&#x642;&#x627;&#x64A;&#x629; &#x645;&#x646; &#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x641;&#x64A; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62C;&#x627;&#x643;&#x633;</a>.
</blockquote>

<h3 id="&#x625;&#x646;&#x634;&#x627;&#x621;-&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642;-&#x645;&#x62E;&#x635;&#x635;">&#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x645;&#x62E;&#x635;&#x635;</h3>
<p>&#x62A;&#x62A;&#x64A;&#x62D; &#x644;&#x646;&#x627; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x625;&#x645;&#x643;&#x627;&#x646;&#x64A;&#x651;&#x629; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642;&#x627;&#x62A; &#x645;&#x62E;&#x635;&#x635;&#x629; &#x628;&#x646;&#x627; &#x625;&#x644;&#x649; &#x62C;&#x627;&#x646;&#x628; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x648;&#x641;&#x631;&#x647;&#x627; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x627;&#x64B; (&#x645;&#x62B;&#x644; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; <code>()Required</code> &#x648; <code>()Email</code>). &#x633;&#x623;&#x634;&#x631;&#x62D; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x630;&#x644;&#x643; &#x639;&#x628;&#x631; &#x635;&#x646;&#x639; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; <code>()Unique</code> &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x642;&#x648;&#x645; &#x628;&#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x648;&#x627;&#x644;&#x62A;&#x623;&#x643;&#x651;&#x62F; &#x645;&#x646; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x623;&#x62F;&#x62E;&#x644;&#x647;&#x627; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x650;&#x645; &#x641;&#x64A; &#x627;&#x644;&#x62D;&#x642;&#x644; &#x627;&#x644;&#x641;&#x644;&#x627;&#x646;&#x64A; &#x63A;&#x64A;&#x631; &#x645;&#x648;&#x62C;&#x648;&#x62F;&#x629;. &#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x643;&#x647;&#x630;&#x627; &#x644;&#x644;&#x62A;&#x623;&#x643;&#x62F; &#x645;&#x646; &#x627;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x628;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x625;&#x644;&#x643;&#x62A;&#x631;&#x648;&#x646;&#x64A; &#x648;&#x627;&#x633;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x62F;&#x62E;&#x644;&#x627;&#x646; &#x641;&#x64A; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644; &#x641;&#x631;&#x64A;&#x62F;&#x627;&#x646;. &#x643;&#x646;&#x651;&#x627; &#x633;&#x646;&#x636;&#x637;&#x631; &#x625;&#x644;&#x649; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x630;&#x644;&#x643; &#x641;&#x64A; &#x62F;&#x627;&#x644;&#x629; &#x639;&#x631;&#x636; &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x644;&#x648; &#x623;&#x646;&#x651;&#x646;&#x627; &#x644;&#x627; &#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms&#x60C; &#x648;&#x644;&#x643;&#x646; &#x628;&#x645;&#x627; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x62A;&#x648;&#x641;&#x631; &#x644;&#x646;&#x627; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x648;&#x627;&#x635; &#x627;&#x644;&#x645;&#x64F;&#x64A;&#x633;&#x651;&#x650;&#x631;&#x629; &#x641;&#x623;&#x635;&#x628;&#x62D; &#x628;&#x625;&#x645;&#x643;&#x627;&#x646;&#x646;&#x627; &#x639;&#x632;&#x644; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x62A;&#x64A;&#x646; &#x648;&#x625;&#x646;&#x634;&#x627;&#x621; &#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x645;&#x64F;&#x646;&#x641;&#x635;&#x650;&#x644; &#x648;&#x645;&#x64F;&#x62E;&#x635;&#x651;&#x64E;&#x635; &#x644;&#x630;&#x644;&#x643;.</p>
<p>&#x62F;&#x639;&#x646;&#x627; &#x628;&#x62F;&#x627;&#x64A;&#x629;&#x64B; &#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x628;&#x633;&#x64A;&#x637;&#x629; &#x644;&#x63A;&#x631;&#x636;&#x646;&#x627; &#x627;&#x644;&#x62A;&#x648;&#x636;&#x64A;&#x62D;&#x64A;:</p>
<pre><code class="lang-python"><span class="hljs-comment"># ourapp/forms.py</span>

<span class="hljs-keyword">from</span> flask_wtf <span class="hljs-keyword">import</span> Form
<span class="hljs-keyword">from</span> wtforms <span class="hljs-keyword">import</span> StringField, PasswordField
<span class="hljs-keyword">from</span> wtforms.validators <span class="hljs-keyword">import</span> DataRequired, Email

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">EmailPasswordForm</span><span class="hljs-params">(Form)</span>:</span>
    email = StringField(<span class="hljs-string">&apos;Email&apos;</span>, validators=[DataRequired(), Email()])
    password = PasswordField(<span class="hljs-string">&apos;Password&apos;</span>, validators=[DataRequired()])
</code></pre>
<p>&#x627;&#x644;&#x622;&#x646; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x62A;&#x623;&#x643;&#x651;&#x62F; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x628;&#x631;&#x64A;&#x62F; &#x627;&#x644;&#x625;&#x644;&#x643;&#x62A;&#x631;&#x648;&#x646;&#x64A; &#x641;&#x631;&#x64A;&#x62F; &#x648;&#x63A;&#x64A;&#x631; &#x645;&#x648;&#x62C;&#x648;&#x62F; &#x641;&#x64A; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;. &#x633;&#x623;&#x636;&#x639; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x641;&#x64A; &#x648;&#x62D;&#x62F;&#x629; &#x62C;&#x62F;&#x64A;&#x62F;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <code>util</code> &#x628;&#x627;&#x644;&#x627;&#x633;&#x645; <code>validators</code>.</p>
<pre><code class="lang-python"><span class="hljs-comment"># ourapp/util/validators.py</span>
<span class="hljs-keyword">from</span> wtforms.validators <span class="hljs-keyword">import</span> ValidationError

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Unique</span><span class="hljs-params">(object)</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, model, field, message=<span class="hljs-string">u&apos;This element already exists.&apos;</span>)</span>:</span>
        self.model = model
        self.field = field

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__call__</span><span class="hljs-params">(self, form, field)</span>:</span>
        check = self.model.query.filter(self.field == field.data).first()
        <span class="hljs-keyword">if</span> check:
            <span class="hljs-keyword">raise</span> ValidationError(self.message)
</code></pre>
<p>&#x64A;&#x641;&#x62A;&#x631;&#x636; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x642; &#x623;&#x646;&#x646;&#x627; &#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x625;&#x636;&#x627;&#x641;&#x629; SQLAlchemy &#x641;&#x64A; &#x62A;&#x639;&#x631;&#x64A;&#x641;&#x646;&#x627; &#x644;&#x646;&#x645;&#x627;&#x630;&#x62C; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;. &#x62A;&#x62A;&#x648;&#x642;&#x639; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x623;&#x646; &#x64A;&#x64F;&#x639;&#x64A;&#x62F; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x646;&#x648;&#x639;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x642;&#x627;&#x628;&#x644;&#x629; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; (&#x643;&#x627;&#x644;&#x635;&#x646;&#x648;&#x641; &#x627;&#x644;&#x642;&#x627;&#x628;&#x644;&#x629; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; (callable class) &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;).</p>
<p>&#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x62D;&#x62F;&#x64A;&#x62F; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x637;&#x64A;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x646;&#x628;&#x63A;&#x64A; &#x62A;&#x645;&#x631;&#x64A;&#x631;&#x647;&#x627; &#x625;&#x644;&#x649; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; __init__. &#x641;&#x64A; &#x62D;&#x627;&#x644;&#x62A;&#x646;&#x627; &#x633;&#x646;&#x631;&#x63A;&#x628; &#x628;&#x62A;&#x645;&#x631;&#x64A;&#x631; &#x627;&#x644;&#x646;&#x645;&#x648;&#x630;&#x62C; (&#x648;&#x627;&#x644;&#x630;&#x64A; &#x647;&#x648; &#x627;&#x644;&#x646;&#x645;&#x648;&#x630;&#x62C; <code>User</code>) &#x648;&#x627;&#x644;&#x62D;&#x642;&#x644; &#x627;&#x644;&#x645;&#x64F;&#x631;&#x627;&#x62F; &#x627;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646;&#x647;. &#x633;&#x64A;&#x64F;&#x635;&#x62F;&#x650;&#x631; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x642; &#x627;&#x644;&#x62E;&#x637;&#x623; <code>ValidationError</code> &#x639;&#x646;&#x62F;&#x645;&#x627; &#x64A;&#x64F;&#x633;&#x62A;&#x62F;&#x639;&#x649; &#x648;&#x64A;&#x62C;&#x62F; &#x623;&#x646;&#x651;&#x64E; &#x647;&#x646;&#x627;&#x643; &#x642;&#x64A;&#x645;&#x629; &#x645;&#x637;&#x627;&#x628;&#x642;&#x629; &#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629; &#x641;&#x64A; &#x642;&#x627;&#x639;&#x62F;&#x629; &#x627;&#x644;&#x628;&#x64A;&#x627;&#x646;&#x627;&#x62A;. &#x642;&#x645;&#x646;&#x627; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x628;&#x625;&#x636;&#x627;&#x641;&#x629; &#x631;&#x633;&#x627;&#x644;&#x629; &#x627;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x651;&#x629; &#x644;&#x62A;&#x64F;&#x636;&#x627;&#x641; &#x625;&#x644;&#x649; &#x631;&#x633;&#x627;&#x644;&#x629; &#x627;&#x644;&#x62E;&#x637;&#x623; <code>ValidationError</code> &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x639;&#x627;&#x645;&#x650;&#x644; <code>message</code>.</p>
<p>&#x627;&#x644;&#x622;&#x646; &#x623;&#x635;&#x628;&#x62D; &#x628;&#x625;&#x645;&#x643;&#x627;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x62F;&#x64A;&#x644; &#x627;&#x644;&#x635;&#x646;&#x641; <code>EmailPasswordForm</code> &#x644;&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x64A;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; <code>Unique</code> &#x627;&#x644;&#x630;&#x64A; &#x623;&#x646;&#x634;&#x623;&#x646;&#x627;&#x647;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x644;&#x627; &#x64A;&#x62A;&#x639;&#x64A;&#x651;&#x646; &#x639;&#x644;&#x649; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642; &#x627;&#x644;&#x630;&#x64A; &#x635;&#x646;&#x639;&#x646;&#x627;&#x647; &#x623;&#x646; &#x64A;&#x643;&#x648;&#x646; &#x635;&#x646;&#x641;&#x627;&#x64B; &#x642;&#x627;&#x628;&#x644;&#x627;&#x64B; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621;. &#x62D;&#x64A;&#x62B; &#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x623;&#x646; &#x64A;&#x64F;&#x631;&#x62C;&#x650;&#x639; &#x643;&#x627;&#x626;&#x650;&#x646;&#x627;&#x64B; &#x642;&#x627;&#x628;&#x644;&#x627;&#x64B; &#x644;&#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x623;&#x648; &#x623;&#x646; &#x64A;&#x64F;&#x633;&#x62A;&#x62F;&#x639;&#x649; &#x645;&#x628;&#x627;&#x634;&#x631;&#x629;&#x64B;. &#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms <a href="http://wtforms.simplecodes.com/docs/0.6.2/validators.html#custom-validators" target="_blank">&#x628;&#x639;&#x636; &#x627;&#x644;&#x623;&#x645;&#x62B;&#x644;&#x629;</a> &#x62D;&#x648;&#x644; &#x630;&#x644;&#x643;.
</blockquote>

<h3 id="&#x62A;&#x635;&#x64A;&#x64A;&#x631;-&#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;">&#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;</h3>
<p>&#x62A;&#x648;&#x641;&#x650;&#x631; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x62E;&#x627;&#x635;&#x64A;&#x651;&#x629; &#x645;&#x64F;&#x641;&#x64A;&#x62F;&#x629; &#x623;&#x62E;&#x631;&#x649; &#x644;&#x62A;&#x633;&#x627;&#x639;&#x62F;&#x646;&#x627; &#x639;&#x644;&#x649; &#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;. &#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x64E;&#x645; &#x627;&#x644;&#x635;&#x646;&#x641; <code>Field</code> &#x627;&#x644;&#x645;&#x648;&#x62C;&#x648;&#x62F; &#x641;&#x64A; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x644;&#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x634;&#x64A;&#x641;&#x631;&#x629; &#x644;&#x63A;&#x629; &#x62A;&#x631;&#x645;&#x64A;&#x632; &#x627;&#x644;&#x646;&#x635; &#x627;&#x644;&#x641;&#x627;&#x626;&#x642; (HTML) &#x627;&#x644;&#x645;&#x64F;&#x645;&#x62B;&#x651;&#x650;&#x644;&#x629; &#x644;&#x62D;&#x642;&#x644; &#x645;&#x627;&#x60C; &#x648;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A; &#x62C;&#x644;&#x651; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647; &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644; &#x627;&#x644;&#x62A;&#x64A; &#x646;&#x631;&#x63A;&#x628; &#x628;&#x647;&#x627; &#x645;&#x646; &#x62F;&#x627;&#x62E;&#x644; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x644;&#x62A;&#x635;&#x64A;&#x64A;&#x631;&#x647;&#x627; &#x62F;&#x64A;&#x646;&#x627;&#x645;&#x64A;&#x643;&#x64A;&#x627;&#x64B;. &#x627;&#x644;&#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x645;&#x645;&#x627;&#x62B;&#x644;&#x629; &#x644;&#x650;&#x645;&#x64E; &#x643;&#x646;&#x651;&#x627; &#x646;&#x642;&#x648;&#x645; &#x628;&#x647; &#x639;&#x646;&#x62F; &#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x62D;&#x642;&#x644; &#x627;&#x644;&#x631;&#x645;&#x632; &#x627;&#x644;&#x633;&#x631;&#x64A; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; <code>csrf_token</code>. &#x627;&#x646;&#x638;&#x631; &#x623;&#x62F;&#x646;&#x627;&#x647; &#x625;&#x644;&#x649; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x648;&#x636;&#x651;&#x650;&#x62D; &#x643;&#x64A;&#x641;&#x64A;&#x651;&#x629; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644; &#x627;&#x644;&#x645;&#x628;&#x646;&#x64A;&#x651;&#x629; &#x641;&#x64A; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x644;&#x625;&#x646;&#x634;&#x627;&#x621; &#x642;&#x627;&#x644;&#x628; &#x628;&#x633;&#x64A;&#x637; &#x644;&#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x627;&#x644;&#x62F;&#x62E;&#x648;&#x644;.</p>
<pre><code class="lang-html">{# ourapp/templates/login.html #}

{% extends &quot;layout.html&quot; %}
<span class="hljs-tag">&lt;<span class="hljs-name">html</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">head</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">title</span>&gt;</span>Login Page<span class="hljs-tag">&lt;/<span class="hljs-name">title</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">head</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">form</span> <span class="hljs-attr">action</span>=<span class="hljs-string">&quot;&quot;</span> <span class="hljs-attr">method</span>=<span class="hljs-string">&quot;post&quot;</span>&gt;</span>
            {{ form.email }}
            {{ form.password }}
            {{ form.csrf_token }}
        <span class="hljs-tag">&lt;/<span class="hljs-name">form</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">html</span>&gt;</span>
</code></pre>
<p>&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x62E;&#x635;&#x64A;&#x635; &#x645;&#x638;&#x647;&#x631; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644; &#x639;&#x628;&#x631; &#x62A;&#x645;&#x631;&#x64A;&#x631; &#x62E;&#x635;&#x627;&#x626;&#x635; &#x627;&#x644;&#x62D;&#x642;&#x644; &#x643;&#x645;&#x64F;&#x639;&#x637;&#x64A;&#x627;&#x62A; &#x639;&#x646;&#x62F; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; (&#x627;&#x646;&#x638;&#x631; &#x623;&#x62F;&#x646;&#x627;&#x647;).</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">form</span> <span class="hljs-attr">action</span>=<span class="hljs-string">&quot;&quot;</span> <span class="hljs-attr">method</span>=<span class="hljs-string">&quot;post&quot;</span>&gt;</span>
    {{ form.email.label }}: {{ form.email(placeholder=&apos;yourname@email.com&apos;) }}
    <span class="hljs-tag">&lt;<span class="hljs-name">br</span>&gt;</span>
    {{ form.password.label }}: {{ form.password }}
    <span class="hljs-tag">&lt;<span class="hljs-name">br</span>&gt;</span>
    {{ form.csrf_token }}
<span class="hljs-tag">&lt;/<span class="hljs-name">form</span>&gt;</span>
</code></pre>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; <code>&apos;&apos;=_class</code> &#x625;&#x630;&#x627; &#x623;&#x631;&#x62F;&#x62A; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x64A;&#x651;&#x629; &quot;class&quot; &#x641;&#x64A; &#x623;&#x62D;&#x62F; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644;&#x60C; &#x62D;&#x64A;&#x62B; &#x623;&#x646;&#x651;&#x64E; <code>class</code> &#x643;&#x644;&#x645;&#x629; &#x645;&#x62D;&#x62C;&#x648;&#x632;&#x629; &#x641;&#x64A; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646;.
</blockquote>

<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x62D;&#x62A;&#x648;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x639;&#x644;&#x649; &#x642;&#x627;&#x626;&#x645;&#x629; <a href="http://wtforms.simplecodes.com/docs/1.0.4/fields.html#wtforms.fields.Field.name" target="_blank">&#x628;&#x627;&#x644;&#x62E;&#x648;&#x627;&#x635; &#x627;&#x644;&#x645;&#x62A;&#x648;&#x627;&#x641;&#x631;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x64A;&#x645;&#x643;&#x646; &#x62A;&#x645;&#x631;&#x64A;&#x631;&#x647;&#x627; &#x644;&#x644;&#x62D;&#x642;&#x648;&#x644;</a>.
</blockquote>

<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x642;&#x62F; &#x62A;&#x643;&#x648;&#x646; &#x644;&#x627;&#x62D;&#x638;&#x62A;&#x64E; &#x623;&#x646;&#x651;&#x64E;&#x647; &#x644;&#x64A;&#x633; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x645;&#x64F;&#x631;&#x634;&#x651;&#x650;&#x62D; &#x62C;&#x64A;&#x646;&#x62C;&#x627; <code>safe|</code> &#x639;&#x646;&#x62F; &#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms&#x60C; &#x648;&#x647;&#x630;&#x627; &#x644;&#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629; &#x62A;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x631;&#x634;&#x64A;&#x62D; &#x627;&#x644;&#x645;&#x64F;&#x62E;&#x631;&#x62C;&#x627;&#x62A; &#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x627;&#x64B; &#x644;&#x62A;&#x635;&#x64A;&#x64A;&#x631;&#x647;&#x627; &#x628;&#x634;&#x643;&#x644; &#x622;&#x645;&#x646;.
<br><br>
&#x623;&#x644;&#x642;&#x64D; &#x646;&#x638;&#x631;&#x629; <a href="https://flask-wtf.readthedocs.org/en/v0.8.4/#using-the-safe-filter" target="_blank">&#x639;&#x644;&#x649; &#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x629;</a> &#x644;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x62A;&#x641;&#x627;&#x635;&#x64A;&#x644;.
</blockquote>

<h2 id="&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;">&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;</h2>
<ul style="list-style-type: disc; list-style-position: inside;">
<li>&#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x623;&#x646; &#x62A;&#x643;&#x648;&#x646; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x645;&#x64F;&#x636;&#x631;&#x651;&#x64E;&#x629; &#x648;&#x645;&#x635;&#x62F;&#x631; &#x642;&#x644;&#x642; &#x645;&#x646; &#x627;&#x644;&#x646;&#x627;&#x62D;&#x64A;&#x629; &#x627;&#x644;&#x623;&#x645;&#x646;&#x64A;&#x651;&#x629;.</li>
<li>&#x62A;&#x62C;&#x639;&#x644; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x645;&#x646; &#x627;&#x644;&#x633;&#x647;&#x644; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x648;&#x62A;&#x623;&#x645;&#x64A;&#x646; &#x648;&#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A;.</li>
<li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x64A;&#x632;&#x629; &#x627;&#x644;&#x62D;&#x645;&#x627;&#x64A;&#x629; &#x645;&#x646; &#x62B;&#x63A;&#x631;&#x629; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x648;&#x641;&#x631;&#x647;&#x627; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x644;&#x62A;&#x623;&#x645;&#x64A;&#x646; &#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x627;&#x62A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;.</li>
<li>&#x64A;&#x645;&#x643;&#x646;&#x643; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x625;&#x636;&#x627;&#x641;&#x629; Flask-WTF &#x644;&#x62A;&#x623;&#x645;&#x64A;&#x646; &#x637;&#x644;&#x628;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62C;&#x627;&#x643;&#x633; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x645;&#x646; &#x647;&#x62C;&#x645;&#x627;&#x62A; &#x62A;&#x632;&#x648;&#x64A;&#x631; &#x627;&#x644;&#x637;&#x644;&#x628;&#x627;&#x62A;.</li>
<li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x650;&#x642;&#x627;&#x62A; &#x644;&#x625;&#x628;&#x642;&#x627;&#x621; &#x639;&#x645;&#x644;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x635;&#x627;&#x62F;&#x642;&#x629; &#x645;&#x639;&#x632;&#x648;&#x644;&#x629; &#x62E;&#x627;&#x631;&#x62C; &#x62F;&#x648;&#x627;&#x644; &#x627;&#x644;&#x639;&#x631;&#x636;.</li>
<li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x645;&#x64A;&#x651;&#x632;&#x629; &#x62A;&#x635;&#x64A;&#x64A;&#x631; &#x634;&#x64A;&#x641;&#x631;&#x627;&#x62A; &#x62D;&#x642;&#x648;&#x644; &#x627;&#x644;&#x625;&#x62F;&#x62E;&#x627;&#x644; &#x627;&#x644;&#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x651;&#x629; &#x645;&#x646; &#x625;&#x636;&#x627;&#x641;&#x629; WTForms &#x644;&#x643;&#x64A;&#x644;&#x627; &#x62A;&#x636;&#x637;&#x631; &#x625;&#x644;&#x649; &#x62A;&#x62D;&#x62F;&#x64A;&#x62B; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x62D;&#x642;&#x648;&#x644; &#x64A;&#x62F;&#x648;&#x64A;&#x627;&#x64B; &#x641;&#x64A; &#x643;&#x644; &#x645;&#x631;&#x651;&#x64E;&#x629; &#x62A;&#x62C;&#x631;&#x64A; &#x641;&#x64A;&#x647;&#x627; &#x62A;&#x639;&#x62F;&#x64A;&#x644;&#x627;&#x62A; &#x639;&#x644;&#x649; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x645;&#x627;&#x631;&#x629;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="storing.html" class="navigation navigation-prev " aria-label="Previous page: تخزين البيانات">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="conclusion.html" class="navigation navigation-next " aria-label="Next page: الخاتمة">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"التعامل مع الاستمارات","level":"1.12","depth":1,"next":{"title":"الخاتمة","level":"1.13","depth":1,"path":"docs/conclusion.md","ref":"docs/conclusion.md","articles":[]},"previous":{"title":"تخزين البيانات","level":"1.11","depth":1,"path":"docs/storing.md","ref":"docs/storing.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"images/flask.png","bookmark":"images/flask.png"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"استكشف فلاسك","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/forms.md","mtime":"2018-05-12T14:54:22.739Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-12T14:55:55.406Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

