
<!DOCTYPE HTML>
<html lang="ar" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>القوالب · استكشف فلاسك</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="static.html" />
    
    
    <link rel="prev" href="blueprints.html" />
    

    
        <link rel="shortcut icon" href='../images/flask.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/flask.png' type="image/x-icon">
    
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="اكتب للبحث" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    الرئيسية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    المقدمة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="coding_conventions.html">
            
                <a href="coding_conventions.html">
            
                    
                    مواثيق كتابة الشيفرة البرمجية
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="environment.html">
            
                <a href="environment.html">
            
                    
                    بيئة العمل
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="organizing.html">
            
                <a href="organizing.html">
            
                    
                    تنظيم المشروع
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="configuration.html">
            
                <a href="configuration.html">
            
                    
                    الإعداد
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="views.html">
            
                <a href="views.html">
            
                    
                    استخدامات متقدمة لدوال العرض والتوجيه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="blueprints.html">
            
                <a href="blueprints.html">
            
                    
                    المخططات
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="templates.html">
            
                <a href="templates.html">
            
                    
                    القوالب
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="static.html">
            
                <a href="static.html">
            
                    
                    الملفات الساكنة
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="storing.html">
            
                <a href="storing.html">
            
                    
                    تخزين البيانات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    التعامل مع الاستمارات
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    الخاتمة
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            نشرت مع GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >القوالب</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;">&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;</h1>
<p><img src="../images/templates.png"></p>
<p>&#x641;&#x64A; &#x62D;&#x64A;&#x646; &#x623;&#x646;&#x651;&#x64E; &#x641;&#x644;&#x627;&#x633;&#x643; &#x644;&#x627; &#x64A;&#x62C;&#x628;&#x631;&#x643; &#x639;&#x644;&#x649; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x623;&#x64A;&#x651;&#x64E;&#x629; &#x644;&#x63A;&#x629; &#x642;&#x648;&#x627;&#x644;&#x628; &#x645;&#x62D;&#x62F;&#x62F;&#x629;&#x60C; &#x641;&#x647;&#x648; &#x64A;&#x641;&#x62A;&#x631;&#x636; &#x623;&#x646;&#x643; &#x633;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x63A;&#x629; &#x62C;&#x64A;&#x646;&#x62C;&#x627; (Jinja). &#x645;&#x639;&#x638;&#x645; &#x627;&#x644;&#x645;&#x637;&#x648;&#x631;&#x64A;&#x646; &#x641;&#x64A; &#x645;&#x62C;&#x62A;&#x645;&#x639; &#x641;&#x644;&#x627;&#x633;&#x643; &#x64A;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x648;&#x646; &#x62C;&#x64A;&#x646;&#x62C;&#x627;&#x60C; &#x648;&#x623;&#x646;&#x635;&#x62D;&#x643; &#x628;&#x623;&#x646; &#x62A;&#x641;&#x639;&#x644; &#x627;&#x644;&#x645;&#x650;&#x62B;&#x644;. &#x64A;&#x648;&#x62C;&#x62F; &#x628;&#x636;&#x639;&#x629; &#x625;&#x636;&#x627;&#x641;&#x627;&#x62A; (&#x645;&#x644;&#x62D;&#x642;&#x627;&#x62A;) &#x62A;&#x62A;&#x64A;&#x62D; &#x644;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x644;&#x63A;&#x627;&#x62A; &#x642;&#x648;&#x627;&#x644;&#x628; &#x623;&#x62E;&#x631;&#x649;&#x60C; &#x645;&#x62B;&#x644; <a href="http://pythonhosted.org/Flask-Genshi/" target="_blank">Flask-Genshi</a> &#x648; <a href="http://pythonhosted.org/Flask-Mako/" target="_blank">Flask-Mako</a>. &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x62E;&#x64A;&#x627;&#x631; &#x627;&#x644;&#x625;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A; (&#x62C;&#x64A;&#x646;&#x62C;&#x627;) &#x645;&#x627; &#x644;&#x645; &#x64A;&#x643;&#x646; &#x644;&#x62F;&#x64A;&#x643; &#x633;&#x628;&#x628; &#x62C;&#x64A;&#x62F; &#x644;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x634;&#x64A;&#x621; &#x622;&#x62E;&#x631;. &#x639;&#x62F;&#x645; &#x645;&#x639;&#x631;&#x641;&#x62A;&#x643; &#x644;&#x644;&#x628;&#x646;&#x64A;&#x629; &#x627;&#x644;&#x643;&#x62A;&#x627;&#x628;&#x64A;&#x629; &#x644;&#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x644;&#x64A;&#x633; &#x628;&#x627;&#x644;&#x633;&#x628;&#x628; &#x627;&#x644;&#x62C;&#x64A;&#x62F;! &#x641;&#x627;&#x644;&#x633;&#x648;&#x641; &#x62A;&#x648;&#x641;&#x631; &#x627;&#x644;&#x643;&#x62B;&#x64A;&#x631; &#x645;&#x646; &#x627;&#x644;&#x648;&#x642;&#x62A; &#x648;&#x627;&#x644;&#x635;&#x62F;&#x627;&#x639;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x645;&#x639;&#x638;&#x645; &#x627;&#x644;&#x645;&#x648;&#x627;&#x642;&#x639; &#x62A;&#x64E;&#x642;&#x635;&#x64F;&#x62F; Jinja2 &#x641;&#x64A; &#x62D;&#x64A;&#x646; &#x623;&#x646;&#x647;&#x627; &#x62A;&#x643;&#x62A;&#x628; &quot;Jinja&quot; &#x648;&#x62D;&#x633;&#x628;. &#x62D;&#x64A;&#x62B; &#x643;&#x627;&#x646; &#x647;&#x646;&#x627;&#x643; &#x625;&#x635;&#x62F;&#x627;&#x631; &#x623;&#x648;&#x644; &#x645;&#x646; &#x647;&#x630;&#x647; &#x627;&#x644;&#x644;&#x63A;&#x629; (Jinja1)&#x60C; &#x648;&#x644;&#x643;&#x646;&#x646;&#x627; &#x644;&#x646; &#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639;&#x647; &#x647;&#x646;&#x627;. &#x639;&#x646;&#x62F;&#x645;&#x627; &#x633;&#x623;&#x630;&#x643;&#x631; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x643;&#x62A;&#x628;&#x60C; &#x641;&#x633;&#x623;&#x643;&#x648;&#x646; &#x623;&#x642;&#x635;&#x62F; <a href="http://jinja.pocoo.org" target="_blank">&#x647;&#x630;&#x627; &#x627;&#x644;&#x625;&#x635;&#x62F;&#x627;&#x631;</a>.
</blockquote>

<h2 id="&#x645;&#x642;&#x62F;&#x645;&#x629;-&#x633;&#x631;&#x64A;&#x639;&#x629;-&#x62D;&#x648;&#x644;-&#x62C;&#x64A;&#x646;&#x62C;&#x627;">&#x645;&#x642;&#x62F;&#x645;&#x629; &#x633;&#x631;&#x64A;&#x639;&#x629; &#x62D;&#x648;&#x644; &#x62C;&#x64A;&#x646;&#x62C;&#x627;</h2>
<p>&#x64A;&#x624;&#x62F;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x639;&#x645;&#x644;&#x627;&#x64B; &#x62C;&#x64A;&#x62F;&#x627;&#x64B; &#x641;&#x64A; &#x634;&#x631;&#x62D; &#x627;&#x644;&#x628;&#x646;&#x64A;&#x629; &#x627;&#x644;&#x643;&#x62A;&#x627;&#x628;&#x64A;&#x629; &#x648;&#x645;&#x64A;&#x632;&#x627;&#x62A; &#x647;&#x630;&#x647; &#x627;&#x644;&#x644;&#x63A;&#x629;. &#x644;&#x646; &#x623;&#x642;&#x648;&#x645; &#x628;&#x625;&#x639;&#x627;&#x62F;&#x629; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x630;&#x643;&#x648;&#x631;&#x629; &#x647;&#x646;&#x627;&#x643;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x623;&#x631;&#x64A;&#x62F; &#x623;&#x646; &#x623;&#x62D;&#x631;&#x635; &#x639;&#x644;&#x649; &#x631;&#x624;&#x64A;&#x62A;&#x643; &#x644;&#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629; &#x627;&#x644;&#x647;&#x627;&#x645;&#x629;:</p>
<blockquote>
 &#x64A;&#x648;&#x62C;&#x62F; &#x646;&#x648;&#x639;&#x627;&#x646; &#x645;&#x646; &#x627;&#x644;&#x645;&#x62D;&#x62F;&#x62F;&#x627;&#x62A; &#x641;&#x64A; &#x627;&#x644;&#x644;&#x63A;&#x629;: <code>{% ... %}</code> &#x648; <code>{{ ... }}</code>. &#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x623;&#x648;&#x644; &#x644;&#x62A;&#x646;&#x641;&#x64A;&#x630; &#x627;&#x644;&#x62C;&#x645;&#x644; (Statements) &#x645;&#x62B;&#x644; &#x62D;&#x644;&#x642;&#x629; for &#x623;&#x648; &#x644;&#x625;&#x633;&#x646;&#x627;&#x62F; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x60C; &#x623;&#x645;&#x627; &#x627;&#x644;&#x62B;&#x627;&#x646;&#x64A; &#x641;&#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x637;&#x628;&#x627;&#x639;&#x629; &#x646;&#x62A;&#x64A;&#x62C;&#x629; &#x62A;&#x639;&#x628;&#x64A;&#x631; &#x625;&#x644;&#x649; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;.

<br><br>
&#x2014; <a href="http://jinja.pocoo.org/docs/templates/#synopsis" target="_blank">&#x62A;&#x648;&#x62B;&#x64A;&#x642; &#x645;&#x64F;&#x635;&#x645;&#x645; &#x642;&#x648;&#x627;&#x644;&#x628; &#x62C;&#x64A;&#x646;&#x62C;&#x627;</a>
</blockquote>

<h2 id="&#x643;&#x64A;&#x641;&#x64A;&#x629;-&#x62A;&#x646;&#x638;&#x64A;&#x645;-&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;">&#x643;&#x64A;&#x641;&#x64A;&#x629; &#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;</h2>
<p>&#x623;&#x64A;&#x646; &#x627;&#x644;&#x645;&#x643;&#x627;&#x646; &#x627;&#x644;&#x645;&#x646;&#x627;&#x633;&#x628; &#x644;&#x648;&#x636;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x641;&#x64A; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627;&#x61F; &#x625;&#x630;&#x627; &#x643;&#x646;&#x62A; &#x642;&#x62F; &#x62A;&#x627;&#x628;&#x639;&#x62A; &#x627;&#x644;&#x62F;&#x648;&#x631;&#x629; &#x645;&#x646;&#x630; &#x627;&#x644;&#x628;&#x62F;&#x627;&#x64A;&#x629;&#x60C; &#x641;&#x645;&#x646; &#x627;&#x644;&#x645;&#x624;&#x643;&#x62F; &#x623;&#x646;&#x643; &#x644;&#x627;&#x62D;&#x638;&#x62A;&#x64E; &#x623;&#x646;&#x651;&#x64E; &#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643; &#x64A;&#x645;&#x644;&#x643; &#x645;&#x631;&#x648;&#x646;&#x629; &#x639;&#x627;&#x644;&#x64A;&#x629; &#x641;&#x64A;&#x645;&#x627; &#x64A;&#x62A;&#x639;&#x644;&#x642; &#x628;&#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621;. &#x648;&#x644;&#x631;&#x628;&#x645;&#x627; &#x644;&#x627;&#x62D;&#x638;&#x62A; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x623;&#x646;&#x651;&#x64E; &#x647;&#x646;&#x627;&#x643; &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x645;&#x643;&#x627;&#x646; &#x645;&#x648;&#x635;&#x649; &#x628;&#x647; &#x644;&#x648;&#x636;&#x639; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x623;&#x634;&#x64A;&#x627;&#x621;. &#x64A;&#x648;&#x635;&#x649; &#x628;&#x648;&#x636;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629;.</p>
<pre><code class="lang-myapp/">    __init__.py
    models.py
    views/
    templates/
    static/
run.py
requirements.txt
</code></pre>
<pre><code>templates/
    layout.html
    index.html
    about.html
    profile/
        layout.html
        index.html
    photos.html
    admin/
        layout.html
        index.html
        analytics.html
</code></pre><p>&#x64A;&#x645;&#x627;&#x62B;&#x644; &#x62A;&#x646;&#x638;&#x64A;&#x645; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <em>templates</em> &#x62A;&#x646;&#x638;&#x64A;&#x645; &#x645;&#x648;&#x62C;&#x647;&#x627;&#x62A;&#x646;&#x627;. &#x62D;&#x64A;&#x62B; &#x623;&#x646;&#x651;&#x64E; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x630;&#x64A; &#x633;&#x64A;&#x64F;&#x639;&#x631;&#x636; &#x641;&#x64A; &#x627;&#x644;&#x639;&#x646;&#x648;&#x627;&#x646; <em>myapp.com/admin/analytics</em> &#x647;&#x648; <em>templates/admin/analytics.html</em>. &#x643;&#x645;&#x627; &#x64A;&#x648;&#x62C;&#x62F; &#x628;&#x639;&#x636; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x625;&#x636;&#x627;&#x641;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x62A;&#x64F;&#x633;&#x62A;&#x64E;&#x645;&#x64E;&#x62F; &#x648;&#x644;&#x643;&#x646; &#x644;&#x646; &#x64A;&#x62A;&#x645; &#x639;&#x631;&#x636;&#x647;&#x627; &#x628;&#x634;&#x643;&#x644; &#x645;&#x628;&#x627;&#x634;&#x631;. &#x628;&#x62D;&#x64A;&#x62B; &#x623;&#x646;&#x651;&#x64E; &#x645;&#x644;&#x641;&#x627;&#x62A; <em>layout.html</em> &#x633;&#x64A;&#x62A;&#x645; &#x648;&#x631;&#x627;&#x62B;&#x62A;&#x647;&#x627; (&#x627;&#x633;&#x62A;&#x645;&#x62F;&#x627;&#x62F;&#x647;&#x627;/&#x62A;&#x636;&#x645;&#x64A;&#x646;&#x647;&#x627;) &#x645;&#x646; &#x642;&#x648;&#x627;&#x644;&#x628; &#x623;&#x62E;&#x631;&#x649;.</p>
<h2 id="&#x627;&#x644;&#x648;&#x631;&#x627;&#x62B;&#x629;">&#x627;&#x644;&#x648;&#x631;&#x627;&#x62B;&#x629;</h2>
<p>&#x64A;&#x639;&#x62A;&#x645;&#x62F; &#x62F;&#x644;&#x64A;&#x644; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x64F;&#x645;&#x646;&#x638;&#x645; &#x628;&#x634;&#x643;&#x644; &#x62C;&#x64A;&#x62F; &#x628;&#x634;&#x62F;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x648;&#x631;&#x627;&#x62B;&#x629;. &#x641;&#x64A;&#x64F;&#x639;&#x631;&#x650;&#x641; <strong>&#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628;</strong> &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x627;&#x644;&#x647;&#x64A;&#x643;&#x644; &#x627;&#x644;&#x639;&#x627;&#x645; &#x627;&#x644;&#x630;&#x64A; &#x633;&#x62A;&#x631;&#x62B;&#x647; &#x62C;&#x645;&#x64A;&#x639; <strong>&#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628;&#x646;&#x627;&#x621;</strong>. &#x641;&#x64A; &#x645;&#x62B;&#x627;&#x644;&#x646;&#x627; &#x627;&#x644;&#x633;&#x627;&#x628;&#x642;&#x60C; &#x64A;&#x639;&#x62F; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; <em>layout.html</em> &#x647;&#x648; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628;&#x60C; &#x648;&#x627;&#x644;&#x645;&#x644;&#x641;&#x627;&#x62A; &#x627;&#x644;&#x628;&#x642;&#x64A;&#x651;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x62A;&#x62D;&#x645;&#x644; &#x627;&#x644;&#x625;&#x645;&#x62A;&#x62F;&#x627;&#x62F; <em>html.</em> &#x647;&#x64A; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628;&#x646;&#x627;&#x621;.</p>
<p>&#x633;&#x62A;&#x645;&#x644;&#x643; &#x639;&#x627;&#x62F;&#x629;&#x64B; &#x645;&#x644;&#x641; <em>layout.html</em> &#x631;&#x626;&#x64A;&#x633;&#x64A; (&#x630;&#x627; &#x645;&#x633;&#x62A;&#x648;&#x649; &#x623;&#x648;&#x644;) &#x64A;&#x64F;&#x639;&#x631;&#x650;&#x641; &#x627;&#x644;&#x62A;&#x62E;&#x637;&#x64A;&#x637; (&#x627;&#x644;&#x62A;&#x635;&#x645;&#x64A;&#x645;/&#x627;&#x644;&#x62A;&#x646;&#x638;&#x64A;&#x645;) &#x627;&#x644;&#x639;&#x627;&#x645; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x643;&#x60C; &#x648;&#x645;&#x644;&#x641; &#x644;&#x643;&#x644; &#x642;&#x633;&#x645; &#x645;&#x646; &#x645;&#x648;&#x642;&#x639;&#x643;. &#x625;&#x630;&#x627; &#x642;&#x645;&#x62A; &#x628;&#x623;&#x62E;&#x630; &#x646;&#x638;&#x631;&#x629; &#x639;&#x644;&#x649; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; &#x623;&#x639;&#x644;&#x627;&#x647;&#x60C; &#x633;&#x62A;&#x62C;&#x62F; &#x623;&#x646;&#x651;&#x64E; &#x647;&#x646;&#x627;&#x643; &#x642;&#x627;&#x644;&#x628; &#x631;&#x626;&#x64A;&#x633;&#x64A; (<em>myapp/templates/layout.html</em>) &#x643;&#x645;&#x627; &#x62A;&#x648;&#x62C;&#x62F; &#x642;&#x648;&#x627;&#x644;&#x628; &#x631;&#x626;&#x64A;&#x633;&#x64A;&#x629; &#x641;&#x631;&#x639;&#x64A;&#x629; &#x645;&#x62B;&#x644; <em>myapp/templates/profile/layout.html</em> &#x648; <em>myapp/templates/admin/layout.html</em>. &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;&#x627;&#x646; &#x627;&#x644;&#x641;&#x631;&#x639;&#x64A;&#x627;&#x646; &#x64A;&#x631;&#x62B;&#x627;&#x646; &#x648;&#x64A;&#x639;&#x62F;&#x644;&#x627;&#x646; &#x627;&#x644;&#x623;&#x648;&#x644; (&#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x630;&#x648; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x648;&#x649; &#x627;&#x644;&#x623;&#x648;&#x644;).</p>
<p>&#x64A;&#x62A;&#x645; &#x62A;&#x646;&#x641;&#x64A;&#x630; &#x627;&#x644;&#x648;&#x631;&#x627;&#x62B;&#x629; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x648;&#x633;&#x645;&#x627;&#x646; <code>{% extends %}</code> &#x648; <code>{% block %}</code>. &#x62D;&#x64A;&#x62B; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x643;&#x62A;&#x644; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628; &#x644;&#x64A;&#x62A;&#x645; &#x645;&#x644;&#x624;&#x647;&#x627; (&#x627;&#x644;&#x643;&#x62A;&#x627;&#x628;&#x629; &#x628;&#x62F;&#x627;&#x62E;&#x644;&#x647;&#x627;) &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628;&#x646;&#x627;&#x621;.</p>
<pre><code class="lang-html">{# _myapp/templates/layout.html_ #}

<span class="hljs-meta">&lt;!DOCTYPE html&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">html</span> <span class="hljs-attr">lang</span>=<span class="hljs-string">&quot;en&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">head</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">title</span>&gt;</span>{% block title %}{% endblock %}<span class="hljs-tag">&lt;/<span class="hljs-name">title</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">head</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
    {% block body %}
        <span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>This heading is defined in the parent.<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span>
    {% endblock %}
    <span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">html</span>&gt;</span>
</code></pre>
<p>&#x627;&#x644;&#x622;&#x646; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x645;&#x62F;&#x627;&#x62F; (Extend) &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x627;&#x628;&#x646; &#x648;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x62D;&#x62A;&#x648;&#x649; (&#x645;&#x644;&#x621;) &#x647;&#x630;&#x647; &#x627;&#x644;&#x643;&#x62A;&#x644;.</p>
<pre><code class="lang-html">{# _myapp/templates/index.html_ #}

{% extends &quot;layout.html&quot; %}
{% block title %}Hello world!{% endblock %}
{% block body %}
    {{ super() }}
    <span class="hljs-tag">&lt;<span class="hljs-name">h2</span>&gt;</span>This heading is defined in the child.<span class="hljs-tag">&lt;/<span class="hljs-name">h2</span>&gt;</span>
{% endblock %}
</code></pre>
<p>&#x62A;&#x633;&#x645;&#x62D; &#x644;&#x646;&#x627; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; <code>()super</code> &#x628;&#x62A;&#x636;&#x645;&#x64A;&#x646; &#x623;&#x64A;&#x627;&#x64B; &#x643;&#x627;&#x646; &#x645;&#x627; &#x628;&#x62F;&#x627;&#x62E;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x643;&#x62A;&#x644;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x623;&#x628;.</p>
<blockquote>
<b></b><br>
&#x644;&#x644;&#x645;&#x632;&#x64A;&#x62F; &#x645;&#x646; &#x627;&#x644;&#x645;&#x639;&#x644;&#x648;&#x645;&#x627;&#x62A;&#x60C; &#x642;&#x645; &#x628;&#x632;&#x64A;&#x627;&#x631;&#x629; <a href="http://jinja.pocoo.org/docs/templates/#template-inheritance" target="_blank">&#x648;&#x62B;&#x64A;&#x642;&#x629; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x639;&#x646; &#x627;&#x644;&#x648;&#x631;&#x627;&#x62B;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;</a>.
</blockquote>

<h2 id="&#x625;&#x646;&#x634;&#x627;&#x621;-&#x648;&#x62D;&#x62F;&#x627;&#x62A;-&#x645;&#x627;&#x643;&#x631;&#x648;">&#x625;&#x646;&#x634;&#x627;&#x621; &#x648;&#x62D;&#x62F;&#x627;&#x62A; &#x645;&#x627;&#x643;&#x631;&#x648;</h2>
<p>&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x637;&#x628;&#x64A;&#x642; &#x645;&#x628;&#x62F;&#x623; <a href="https://ar.wikipedia.org/wiki/%D9%84%D8%A7_%D8%AA%D9%83%D8%B1%D8%B1_%D9%86%D9%81%D8%B3%D9%83" target="_blank">&#x644;&#x627; &#x62A;&#x643;&#x631;&#x631; &#x646;&#x641;&#x633;&#x643;</a> &#x641;&#x64A; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x627;&#x633;&#x62A;&#x62E;&#x644;&#x627;&#x635; &#x627;&#x644;&#x645;&#x642;&#x627;&#x637;&#x639; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629; &#x627;&#x644;&#x62A;&#x64A; &#x633;&#x62A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x628;&#x634;&#x643;&#x644; &#x645;&#x62A;&#x643;&#x631;&#x631; &#x648;&#x62A;&#x62D;&#x648;&#x64A;&#x644;&#x647;&#x627; &#x625;&#x644;&#x649; <strong>&#x648;&#x62D;&#x62F;&#x627;&#x62A; &#x645;&#x627;&#x643;&#x631;&#x648;</strong> (Macros). &#x639;&#x644;&#x649; &#x633;&#x628;&#x64A;&#x644; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x625;&#x646; &#x643;&#x646;&#x627; &#x646;&#x639;&#x645;&#x644; &#x639;&#x644;&#x649; &#x627;&#x644;&#x634;&#x631;&#x64A;&#x637; &#x627;&#x644;&#x639;&#x644;&#x648;&#x64A; &#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;&#x646;&#x627;&#x60C; &#x641;&#x642;&#x62F; &#x646;&#x631;&#x63A;&#x628; &#x628;&#x625;&#x639;&#x637;&#x627;&#x621; &#x635;&#x646;&#x641; (Class) &#x645;&#x62E;&#x62A;&#x644;&#x641; &#x644;&#x644;&#x631;&#x627;&#x628;&#x637; &quot;&#x627;&#x644;&#x646;&#x634;&#x637;&quot; (&#x623;&#x64A; &#x631;&#x627;&#x628;&#x637; &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A;&#x629;). &#x645;&#x646; &#x62F;&#x648;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x648;&#x62D;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648;&#x60C; &#x633;&#x646;&#x636;&#x637;&#x631; &#x625;&#x644;&#x649; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x639;&#x628;&#x627;&#x631;&#x629; <code>if ... else</code> &#x644;&#x644;&#x62A;&#x62D;&#x642;&#x642; &#x645;&#x646; &#x643;&#x644; &#x631;&#x627;&#x628;&#x637; &#x644;&#x625;&#x64A;&#x62C;&#x627;&#x62F; &#x627;&#x644;&#x646;&#x634;&#x637; &#x645;&#x646;&#x647;&#x645;.</p>
<p>&#x62A;&#x648;&#x641;&#x631; &#x648;&#x62D;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x644;&#x62A;&#x62C;&#x632;&#x626;&#x629; &#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;&#x60C; &#x641;&#x647;&#x64A; &#x62A;&#x639;&#x645;&#x644; &#x643;&#x627;&#x644;&#x62F;&#x648;&#x627;&#x644;. &#x62F;&#x639;&#x646;&#x627; &#x646;&#x644;&#x642;&#x64A; &#x646;&#x638;&#x631;&#x629; &#x639;&#x644;&#x649; &#x637;&#x631;&#x64A;&#x642;&#x629; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x644;&#x62A;&#x62D;&#x62F;&#x64A;&#x62F; &#x627;&#x644;&#x631;&#x627;&#x628;&#x637; &#x627;&#x644;&#x646;&#x634;&#x637; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648;.</p>
<pre><code class="lang-html">{# myapp/templates/layout.html #}

{% from &quot;macros.html&quot; import nav_link with context %}
<span class="hljs-meta">&lt;!DOCTYPE html&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">html</span> <span class="hljs-attr">lang</span>=<span class="hljs-string">&quot;en&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">head</span>&gt;</span>
    {% block head %}
        <span class="hljs-tag">&lt;<span class="hljs-name">title</span>&gt;</span>My application<span class="hljs-tag">&lt;/<span class="hljs-name">title</span>&gt;</span>
    {% endblock %}
    <span class="hljs-tag">&lt;/<span class="hljs-name">head</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">ul</span> <span class="hljs-attr">class</span>=<span class="hljs-string">&quot;nav-list&quot;</span>&gt;</span>
            {{ nav_link(&apos;home&apos;, &apos;Home&apos;) }}
            {{ nav_link(&apos;about&apos;, &apos;About&apos;) }}
            {{ nav_link(&apos;contact&apos;, &apos;Get in touch&apos;) }}
        <span class="hljs-tag">&lt;/<span class="hljs-name">ul</span>&gt;</span>
    {% block body %}
    {% endblock %}
    <span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">html</span>&gt;</span>
</code></pre>
<p>&#x645;&#x627; &#x642;&#x64F;&#x645;&#x646;&#x627; &#x628;&#x647; &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x645;&#x627;&#x643;&#x631;&#x648; &#x63A;&#x64A;&#x631; &#x645;&#x64F;&#x639;&#x631;&#x651;&#x64E;&#x641; (&#x648;&#x647;&#x648; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; <code>nav_link</code>) &#x648;&#x62A;&#x645;&#x631;&#x64A;&#x631; &#x645;&#x639;&#x627;&#x645;&#x644;&#x64A;&#x646; &#x644;&#x647;: &#x627;&#x644;&#x623;&#x648;&#x644; &#x627;&#x633;&#x645; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x647;&#x62F;&#x641; (&#x623;&#x64A; &#x627;&#x633;&#x645; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x639;&#x631;&#x636; &#x627;&#x644;&#x645;&#x633;&#x62A;&#x647;&#x62F;&#x641;&#x629;) &#x648;&#x627;&#x644;&#x646;&#x635; &#x627;&#x644;&#x630;&#x64A; &#x646;&#x631;&#x64A;&#x62F; &#x625;&#x638;&#x647;&#x627;&#x631;&#x647;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x642;&#x62F; &#x62A;&#x643;&#x648;&#x646; &#x644;&#x627;&#x62D;&#x638;&#x62A; &#x623;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x646;&#x627; <code>with context</code> &#x641;&#x64A; &#x639;&#x628;&#x627;&#x631;&#x629; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621;. &#x64A;&#x62A;&#x643;&#x648;&#x646; <b>&#x633;&#x64A;&#x627;&#x642;</b> (Context) &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x645;&#x646; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x629; &#x627;&#x644;&#x645;&#x639;&#x627;&#x645;&#x644;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x64F;&#x645;&#x631;&#x631;&#x629; &#x625;&#x644;&#x649; &#x62F;&#x627;&#x644;&#x629; <code>()rendrer_template</code> &#x648;&#x625;&#x644;&#x649; &#x633;&#x64A;&#x627;&#x642; &#x628;&#x64A;&#x626;&#x629; &#x62C;&#x64A;&#x646;&#x62C;&#x627; (Jinja environment context) &#x645;&#x646; &#x627;&#x644;&#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x628;&#x631;&#x645;&#x62C;&#x64A;&#x629;. &#x62A;&#x64F;&#x635;&#x628;&#x62D; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x645;&#x62A;&#x648;&#x641;&#x631;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x62C;&#x631;&#x64A; &#x639;&#x631;&#x636;&#x647;.
<br><br>
&#x628;&#x639;&#x636; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x62A;&#x64F;&#x645;&#x631;&#x631; &#x628;&#x634;&#x643;&#x644; &#x62C;&#x644;&#x64A; &#x628;&#x648;&#x627;&#x633;&#x637;&#x62A;&#x646;&#x627;&#x60C; &#x645;&#x62B;&#x644; <code>render_template(&quot;index.html&quot;, color=&quot;red&quot;)</code>&#x60C; &#x648;&#x644;&#x643;&#x646; &#x64A;&#x648;&#x62C;&#x62F; &#x628;&#x639;&#x636; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x648;&#x627;&#x644;&#x62F;&#x648;&#x627;&#x644; &#x62A;&#x64F;&#x636;&#x645;&#x64E;&#x646; &#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x627;&#x64B; &#x628;&#x648;&#x627;&#x633;&#x637;&#x629; &#x625;&#x637;&#x627;&#x631; &#x641;&#x644;&#x627;&#x633;&#x643;&#x60C; &#x645;&#x62B;&#x644; <code>request</code> &#x648; <code>g</code> &#x648; <code>session</code>. &#x641;&#x639;&#x646;&#x62F;&#x645;&#x627; &#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; <code>{% from ... import ... with context %}</code> &#x646;&#x62D;&#x646; &#x646;&#x62E;&#x628;&#x631; &#x645;&#x64F;&#x62D;&#x631;&#x650;&#x643; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x623;&#x646; &#x64A;&#x62C;&#x639;&#x644; &#x62C;&#x645;&#x64A;&#x639; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x645;&#x62A;&#x648;&#x641;&#x631; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648;.
</blockquote>

<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
<ul style="list-style-type: disc; list-style-position: inside;">
<li>&#x64A;&#x645;&#x643;&#x646;&#x643; &#x625;&#x64A;&#x62C;&#x627;&#x62F; &#x62C;&#x645;&#x64A;&#x639; &#x627;&#x644;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x627;&#x644;&#x639;&#x645;&#x648;&#x645;&#x64A;&#x629; (global) &#x627;&#x644;&#x645;&#x64F;&#x645;&#x631;&#x651;&#x631;&#x629; &#x625;&#x644;&#x649; &#x633;&#x64A;&#x627;&#x642; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x62A;&#x644;&#x642;&#x627;&#x626;&#x64A;&#x627;&#x64B; &#x645;&#x646; <a href="http://flask.pocoo.org/docs/templating/#standard-context" target="_blank">&#x647;&#x646;&#x627;</a>.</li>
<li>&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x62F;&#x648;&#x627;&#x644; &#x648;&#x645;&#x62A;&#x63A;&#x64A;&#x631;&#x627;&#x62A; &#x646;&#x631;&#x64A;&#x62F; &#x62F;&#x645;&#x62C;&#x647;&#x627; &#x641;&#x64A; &#x633;&#x64A;&#x627;&#x642; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <a href="http://flask.pocoo.org/docs/templating/#context-processors" target="_blank">&#x645;&#x639;&#x627;&#x644;&#x62C;&#x627;&#x62A; &#x627;&#x644;&#x633;&#x64A;&#x627;&#x642;</a>.</li>
</ul>
</blockquote>

<p>&#x627;&#x644;&#x622;&#x646; &#x62D;&#x627;&#x646; &#x648;&#x642;&#x62A; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; <code>nav_link</code> &#x627;&#x644;&#x630;&#x64A; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645;&#x646;&#x627;&#x647; &#x641;&#x64A; &#x630;&#x644;&#x643; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;.</p>
<pre><code class="lang-html">{# myapp/templates/macros.html #}

{% macro nav_link(endpoint, text) %}
{% if request.endpoint.endswith(endpoint) %}
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span> <span class="hljs-attr">class</span>=<span class="hljs-string">&quot;active&quot;</span>&gt;</span><span class="hljs-tag">&lt;<span class="hljs-name">a</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;{{ url_for(endpoint) }}&quot;</span>&gt;</span>{{text}}<span class="hljs-tag">&lt;/<span class="hljs-name">a</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
{% else %}
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span><span class="hljs-tag">&lt;<span class="hljs-name">a</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;{{ url_for(endpoint) }}&quot;</span>&gt;</span>{{text}}<span class="hljs-tag">&lt;/<span class="hljs-name">a</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
{% endif %}
{% endmacro %}
</code></pre>
<p>&#x627;&#x644;&#x622;&#x646; &#x642;&#x645;&#x646;&#x627; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631; <em>myapp/templates/macros.html</em>. &#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; &#x642;&#x645;&#x646;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x643;&#x627;&#x626;&#x646; <code>request</code> - &#x648;&#x627;&#x644;&#x630;&#x64A; &#x64A;&#x643;&#x648;&#x646; &#x645;&#x62A;&#x648;&#x641;&#x631; &#x625;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A;&#x627;&#x64B; &#x641;&#x64A; &#x633;&#x64A;&#x627;&#x642; &#x62C;&#x64A;&#x646;&#x62C;&#x627; - &#x644;&#x644;&#x62A;&#x623;&#x643;&#x62F; &#x645;&#x645;&#x627; &#x625;&#x630;&#x627; &#x643;&#x627;&#x646; &#x627;&#x644;&#x637;&#x644;&#x628; &#x627;&#x644;&#x62D;&#x627;&#x644;&#x64A; &#x642;&#x62F; &#x648;&#x64F;&#x62C;&#x651;&#x650;&#x647;&#x64E; &#x625;&#x644;&#x649; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x627;&#x644;&#x645;&#x64F;&#x645;&#x631;&#x651;&#x631;&#x629; &#x625;&#x644;&#x649; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; <code>nav_link</code>. &#x625;&#x646; &#x643;&#x627;&#x646;&#x60C; &#x641;&#x628;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A; &#x646;&#x62D;&#x646; &#x641;&#x64A; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x635;&#x641;&#x62D;&#x629; &#x648;&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x644;&#x64A;&#x645; &#x631;&#x627;&#x628;&#x637;&#x647;&#x627; &#x643;&#x631;&#x627;&#x628;&#x637; &#x646;&#x634;&#x637;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x639;&#x628;&#x627;&#x631;&#x629; <code>from x import y</code> &#x62A;&#x623;&#x62E;&#x630; &#x642;&#x64A;&#x645;&#x629; x &#x643;&#x645;&#x633;&#x627;&#x631; &#x646;&#x633;&#x628;&#x64A;. &#x628;&#x62D;&#x64A;&#x62B; &#x625;&#x630;&#x627; &#x643;&#x627;&#x646; &#x642;&#x627;&#x644;&#x628;&#x646;&#x627; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631; <i>myapp/templates/user/blog.html</i> &#x641;&#x633;&#x646;&#x633;&#x62A;&#x62E;&#x62F;&#x645; <code>from &quot;../macros.html&quot; import nav_link with context</code>.
</blockquote>

<h2 id="&#x645;&#x631;&#x634;&#x62D;&#x627;&#x62A;-&#x645;&#x62E;&#x635;&#x635;&#x629;">&#x645;&#x631;&#x634;&#x62D;&#x627;&#x62A; &#x645;&#x62E;&#x635;&#x635;&#x629;</h2>
<p>&#x645;&#x631;&#x634;&#x62D;&#x627;&#x62A; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x647;&#x64A; &#x639;&#x628;&#x627;&#x631;&#x629; &#x639;&#x646; &#x62F;&#x648;&#x627;&#x644; &#x64A;&#x64F;&#x645;&#x643;&#x650;&#x646; &#x62A;&#x637;&#x628;&#x64A;&#x642;&#x647;&#x627; &#x639;&#x644;&#x649; &#x646;&#x62A;&#x627;&#x626;&#x62C; &#x627;&#x644;&#x639;&#x628;&#x627;&#x631;&#x629; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x62D;&#x62F;&#x62F; <code>{{ ... }}</code>. &#x628;&#x62D;&#x64A;&#x62B; &#x62A;&#x64F;&#x637;&#x628;&#x64E;&#x642; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x64F;&#x631;&#x634;&#x62D;&#x627;&#x62A; &#x642;&#x628;&#x644; &#x637;&#x628;&#x627;&#x639;&#x629; &#x647;&#x630;&#x647; &#x627;&#x644;&#x646;&#x62A;&#x627;&#x626;&#x62C; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;.</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">h2</span>&gt;</span>{{ article.title|title }}<span class="hljs-tag">&lt;/<span class="hljs-name">h2</span>&gt;</span>
</code></pre>
<p>&#x641;&#x64A; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x623;&#x639;&#x644;&#x627;&#x647;&#x60C; &#x627;&#x644;&#x645;&#x631;&#x634;&#x62D; <code>title</code> &#x633;&#x64A;&#x623;&#x62E;&#x630; <code>article.title</code> &#x648;&#x64A;&#x639;&#x64A;&#x62F; &#x627;&#x644;&#x646;&#x633;&#x62E;&#x629; &#x627;&#x644;&#x645;&#x639;&#x646;&#x648;&#x646;&#x629; &#x62D;&#x631;&#x641;&#x64A;&#x627;&#x64B; (title cased) &#x645;&#x646;&#x647;&#x60C; &#x648;&#x627;&#x644;&#x62A;&#x64A; &#x645;&#x646; &#x62B;&#x645; &#x633;&#x62A;&#x64F;&#x637;&#x628;&#x64E;&#x639; &#x625;&#x644;&#x649; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;. &#x62A;&#x634;&#x628;&#x647; &#x622;&#x644;&#x64A;&#x629; &#x639;&#x645;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x62E;&#x627;&#x635;&#x64A;&#x629; &#x625;&#x644;&#x649; &#x62D;&#x62F;&#x64D; &#x643;&#x628;&#x64A;&#x631; &#x622;&#x644;&#x64A;&#x629; &#x639;&#x645;&#x644; &quot;&#x636;&#x62E; (piping)&quot; &#x645;&#x64F;&#x62E;&#x631;&#x62C; &#x628;&#x631;&#x646;&#x627;&#x645;&#x62C; &#x625;&#x644;&#x649; &#x645;&#x62F;&#x62E;&#x644;&#x627;&#x62A; &#x628;&#x631;&#x646;&#x627;&#x645;&#x62C; &#x622;&#x62E;&#x631; &#x641;&#x64A; &#x623;&#x646;&#x638;&#x645;&#x629; &#x64A;&#x648;&#x646;&#x643;&#x633;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x62A;&#x648;&#x62C;&#x62F; &#x62D;&#x641;&#x646;&#x629; &#x645;&#x646; &#x627;&#x644;&#x645;&#x64F;&#x631;&#x634;&#x62D;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x628;&#x646;&#x64A;&#x629; &#x636;&#x645;&#x646;&#x64A;&#x627;&#x64B; &#x641;&#x64A; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x645;&#x646; &#x645;&#x62B;&#x644; <code>title</code>. &#x64A;&#x645;&#x643;&#x646;&#x643; &#x631;&#x624;&#x64A;&#x629; <a href="http://jinja.pocoo.org/docs/templates/#builtin-filters" target="_blank">&#x627;&#x644;&#x642;&#x627;&#x626;&#x645;&#x629; &#x627;&#x644;&#x643;&#x627;&#x645;&#x644;&#x629;</a> &#x641;&#x64A; &#x62A;&#x648;&#x62B;&#x64A;&#x642;&#x627;&#x62A; &#x62C;&#x64A;&#x646;&#x62C;&#x627;.
</blockquote>

<p>&#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x639;&#x631;&#x64A;&#x641; &#x645;&#x64F;&#x631;&#x634;&#x650;&#x62D;&#x627;&#x62A; &#x62E;&#x627;&#x635;&#x629; &#x628;&#x646;&#x627; &#x644;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645;&#x647;&#x627; &#x641;&#x64A; &#x642;&#x648;&#x627;&#x644;&#x628; &#x62C;&#x64A;&#x646;&#x62C;&#x627;. &#x643;&#x645;&#x62B;&#x627;&#x644;&#x60C; &#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x646;&#x641;&#x64A;&#x630; &#x645;&#x631;&#x634;&#x62D; &#x628;&#x633;&#x64A;&#x637; &#x628;&#x627;&#x633;&#x645; <code>caps</code> &#x64A;&#x642;&#x648;&#x645; &#x628;&#x62C;&#x639;&#x644; &#x62C;&#x645;&#x64A;&#x639; &#x623;&#x62D;&#x631;&#x641; &#x627;&#x644;&#x633;&#x644;&#x633;&#x644;&#x629; &#x627;&#x644;&#x646;&#x635;&#x64A;&#x629; &#x643;&#x628;&#x64A;&#x631;&#x629;.</p>
<blockquote>
<b>&#x645;&#x644;&#x627;&#x62D;&#x638;&#x629;</b><br>
&#x64A;&#x645;&#x644;&#x643; &#x645;&#x62D;&#x631;&#x643; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x628;&#x627;&#x644;&#x641;&#x639;&#x644; &#x645;&#x631;&#x634;&#x62D; &#x64A;&#x633;&#x645;&#x649; <code>upper</code> &#x648;&#x647;&#x648; &#x64A;&#x624;&#x62F;&#x64A; &#x62A;&#x644;&#x643; &#x627;&#x644;&#x648;&#x638;&#x64A;&#x641;&#x629;&#x60C; &#x643;&#x645;&#x627; &#x64A;&#x645;&#x644;&#x643; &#x627;&#x644;&#x645;&#x631;&#x634;&#x62D; <code>capitalize</code> &#x627;&#x644;&#x630;&#x64A; &#x64A;&#x642;&#x648;&#x645; &#x628;&#x62C;&#x639;&#x644; &#x627;&#x644;&#x62D;&#x631;&#x641; &#x627;&#x644;&#x623;&#x648;&#x644; &#x628;&#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; &#x627;&#x644;&#x643;&#x628;&#x64A;&#x631;&#x629; &#x648;&#x628;&#x627;&#x642;&#x64A; &#x627;&#x644;&#x623;&#x62D;&#x631;&#x641; &#x628;&#x627;&#x644;&#x62D;&#x627;&#x644;&#x629; &#x627;&#x644;&#x635;&#x63A;&#x64A;&#x631;&#x629;. &#x62A;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x647;&#x630;&#x647; &#x627;&#x644;&#x645;&#x631;&#x634;&#x62D;&#x627;&#x62A; &#x623;&#x64A;&#x636;&#x627;&#x64B; &#x645;&#x639; &#x62A;&#x62D;&#x648;&#x64A;&#x644;&#x627;&#x62A; &#x627;&#x644;&#x64A;&#x648;&#x646;&#x64A;&#x643;&#x648;&#x62F; (Unicode)&#x60C; &#x648;&#x644;&#x643;&#x646;&#x646;&#x627; &#x633;&#x646;&#x628;&#x642;&#x64A; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x628;&#x633;&#x64A;&#x637;&#x627;&#x64B; &#x644;&#x62A;&#x633;&#x644;&#x64A;&#x637; &#x627;&#x644;&#x636;&#x648;&#x621; &#x639;&#x644;&#x649; &#x627;&#x644;&#x641;&#x643;&#x631;&#x629;.
</blockquote>

<p>&#x633;&#x646;&#x642;&#x648;&#x645; &#x628;&#x62A;&#x639;&#x631;&#x64A;&#x641; &#x627;&#x644;&#x645;&#x631;&#x634;&#x62D; &#x641;&#x64A; &#x648;&#x62D;&#x62F;&#x629; &#x62A;&#x62A;&#x648;&#x636;&#x639; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x633;&#x627;&#x631; <em>myapp/util/filters.py</em>. &#x623;&#x64A; &#x633;&#x64A;&#x635;&#x628;&#x62D; &#x644;&#x62F;&#x64A;&#x646;&#x627; &#x627;&#x644;&#x62D;&#x632;&#x645;&#x629; <code>util</code> &#x648;&#x627;&#x644;&#x62A;&#x64A; &#x633;&#x646;&#x636;&#x639; &#x641;&#x64A;&#x647;&#x627; &#x627;&#x644;&#x648;&#x62D;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x623;&#x62E;&#x631;&#x649; &#x627;&#x644;&#x645;&#x62A;&#x646;&#x648;&#x639;&#x629;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># myapp/util/filters.py</span>

<span class="hljs-keyword">from</span> .. <span class="hljs-keyword">import</span> app

<span class="hljs-meta">@app.template_filter()</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">caps</span><span class="hljs-params">(text)</span>:</span>
    <span class="hljs-string">&quot;&quot;&quot;Convert a string to all caps.&quot;&quot;&quot;</span>
    <span class="hljs-keyword">return</span> text.uppercase()
</code></pre>
<p>&#x641;&#x64A; &#x647;&#x630;&#x627; &#x627;&#x644;&#x645;&#x62B;&#x627;&#x644; &#x642;&#x645;&#x646;&#x627; &#x628;&#x62A;&#x633;&#x62C;&#x64A;&#x644; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629; &#x643;&#x645;&#x631;&#x634;&#x62D; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x628;&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; &#x627;&#x644;&#x645;&#x64F;&#x632;&#x62E;&#x631;&#x650;&#x641; <code>()app.template_filter@</code>. &#x64A;&#x623;&#x62E;&#x630; &#x627;&#x644;&#x645;&#x631;&#x634;&#x62D; &#x627;&#x633;&#x645;&#x647; &#x627;&#x644;&#x625;&#x641;&#x62A;&#x631;&#x627;&#x636;&#x64A; &#x645;&#x646; &#x627;&#x633;&#x645; &#x627;&#x644;&#x62F;&#x627;&#x644;&#x629;&#x60C; &#x648;&#x644;&#x643;&#x646; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x62A;&#x63A;&#x64A;&#x64A;&#x631; &#x630;&#x644;&#x643; &#x639;&#x646; &#x637;&#x631;&#x64A;&#x642; &#x62A;&#x645;&#x631;&#x64A;&#x631; &#x645;&#x639;&#x627;&#x645;&#x644; &#x644;&#x644;&#x645;&#x64F;&#x632;&#x62E;&#x631;&#x650;&#x641;.</p>
<pre><code class="lang-python"><span class="hljs-meta">@app.template_filter(&apos;make_caps&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">caps</span><span class="hljs-params">(text)</span>:</span>
    <span class="hljs-string">&quot;&quot;&quot;Convert a string to all caps.&quot;&quot;&quot;</span>
    <span class="hljs-keyword">return</span> text.uppercase()
</code></pre>
<p>&#x627;&#x644;&#x622;&#x646; &#x64A;&#x645;&#x643;&#x646;&#x646;&#x627; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621; &#x627;&#x644;&#x645;&#x631;&#x634;&#x62D; &#x628;&#x627;&#x644;&#x627;&#x633;&#x645; <code>make_caps</code> &#x641;&#x64A; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628; &#x628;&#x62F;&#x644;&#x627;&#x64B; &#x645;&#x646; &#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x627;&#x645; <code>caps</code> &#x643;&#x627;&#x644;&#x62A;&#x627;&#x644;&#x64A;: <code>{{ &quot;hello world!&quot;|make_caps }}</code>.</p>
<p>&#x644;&#x62C;&#x639;&#x644; &#x627;&#x644;&#x645;&#x634;&#x631;&#x62D; &#x645;&#x62A;&#x627;&#x62D;&#x627;&#x64B; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;&#x60C; &#x643;&#x644; &#x645;&#x627; &#x639;&#x644;&#x64A;&#x646;&#x627; &#x627;&#x644;&#x642;&#x64A;&#x627;&#x645; &#x628;&#x647; &#x647;&#x648; &#x627;&#x633;&#x62A;&#x62F;&#x639;&#x627;&#x621;&#x647; &#x641;&#x64A; &#x645;&#x644;&#x641; <i>init</i><i>__</i><i>.py</i><i>__</i> &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A;.</p>
<pre><code class="lang-python"><span class="hljs-comment"># myapp/__init__.py</span>

<span class="hljs-comment"># &#x62A;&#x623;&#x643;&#x62F; &#x623;&#x646;&#x647; &#x62A;&#x645; &#x627;&#x633;&#x62A;&#x647;&#x644;&#x627;&#x644; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642; &#x623;&#x648;&#x644;&#x627;&#x64B; &#x644;&#x645;&#x646;&#x639; &#x645;&#x634;&#x627;&#x643;&#x644; &#x627;&#x644;&#x627;&#x633;&#x62A;&#x64A;&#x631;&#x627;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x62D;&#x644;&#x642;&#x64A;&#x629;.</span>
<span class="hljs-keyword">from</span> .util <span class="hljs-keyword">import</span> filters
</code></pre>
<h2 id="&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;">&#x627;&#x644;&#x62E;&#x644;&#x627;&#x635;&#x629;</h2>
<ul style="list-style-type: disc; list-style-position: inside;">
<li>&#x627;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x62C;&#x64A;&#x646;&#x62C;&#x627; &#x644;&#x644;&#x62A;&#x639;&#x627;&#x645;&#x644; &#x645;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;.</li>
<li>&#x64A;&#x648;&#x62C;&#x62F; &#x646;&#x648;&#x639;&#x627;&#x646; &#x645;&#x646; &#x627;&#x644;&#x645;&#x62D;&#x62F;&#x62F;&#x627;&#x62A; &#x641;&#x64A; &#x645;&#x62D;&#x631;&#x643; &#x62C;&#x64A;&#x646;&#x62C;&#x627;: <code>{% ... %}</code> &#x648; <code>{{ ... }}</code>. &#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x627;&#x644;&#x623;&#x648;&#x644; &#x644;&#x62A;&#x646;&#x641;&#x64A;&#x630; &#x627;&#x644;&#x62C;&#x645;&#x644; (Statements) &#x645;&#x62B;&#x644; &#x62D;&#x644;&#x642;&#x629; for &#x623;&#x648; &#x644;&#x625;&#x633;&#x646;&#x627;&#x62F; &#x627;&#x644;&#x642;&#x64A;&#x645;&#x60C; &#x623;&#x645;&#x627; &#x627;&#x644;&#x62B;&#x627;&#x646;&#x64A; &#x641;&#x64A;&#x64F;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x644;&#x637;&#x628;&#x627;&#x639;&#x629; &#x646;&#x62A;&#x64A;&#x62C;&#x629; &#x62A;&#x639;&#x628;&#x64A;&#x631; &#x625;&#x644;&#x649; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;.</li>
<li>&#x64A;&#x646;&#x635;&#x62D; &#x628;&#x623;&#x646; &#x62A;&#x648;&#x636;&#x639; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <i>myapp/templates/</i> &#x623;&#x64A; &#x641;&#x64A; &#x62F;&#x644;&#x64A;&#x644; &#x628;&#x62F;&#x627;&#x62E;&#x644; &#x62D;&#x632;&#x645;&#x629; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;.</li>
<li>&#x623;&#x646;&#x635;&#x62D; &#x628;&#x623;&#x646; &#x62A;&#x639;&#x643;&#x633; &#x647;&#x64A;&#x643;&#x644;&#x629; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <i>templates/</i> &#x647;&#x64A;&#x643;&#x644;&#x629; &#x639;&#x646;&#x627;&#x648;&#x64A;&#x646; &#x627;&#x644;&#x631;&#x648;&#x627;&#x628;&#x637; &#x641;&#x64A; &#x627;&#x644;&#x62A;&#x637;&#x628;&#x64A;&#x642;.</li>
<li>&#x623;&#x646;&#x635;&#x62D; &#x628;&#x623;&#x646; &#x62A;&#x645;&#x644;&#x643; &#x645;&#x644;&#x641; <i>layout.html</i> &#x631;&#x626;&#x64A;&#x633;&#x64A; &#x641;&#x64A; &#x627;&#x644;&#x62F;&#x644;&#x64A;&#x644; <i>myapp/templates</i> &#x648;&#x645;&#x644;&#x641; &#x62E;&#x627;&#x635; &#x644;&#x643;&#x644; &#x642;&#x633;&#x645; &#x641;&#x64A; &#x627;&#x644;&#x645;&#x648;&#x642;&#x639;. &#x648;&#x639;&#x644;&#x64A;&#x643; &#x623;&#x646; &#x62A;&#x62D;&#x631;&#x635; &#x639;&#x644;&#x649; &#x623;&#x646; &#x64A;&#x633;&#x62A;&#x62F;&#x639;&#x64A; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x645;&#x62E;&#x635;&#x635; &#x644;&#x642;&#x633;&#x645; &#x645;&#x639;&#x64A;&#x646; &#x627;&#x644;&#x645;&#x644;&#x641; &#x627;&#x644;&#x631;&#x626;&#x64A;&#x633;&#x64A;.</li>
<li>&#x648;&#x62D;&#x62F;&#x627;&#x62A; &#x627;&#x644;&#x645;&#x627;&#x643;&#x631;&#x648; &#x647;&#x64A; &#x645;&#x62B;&#x644; &#x627;&#x644;&#x62F;&#x648;&#x627;&#x644; &#x645;&#x635;&#x646;&#x648;&#x639;&#x629; &#x645;&#x646; &#x634;&#x64A;&#x641;&#x631;&#x629; &#x627;&#x644;&#x642;&#x627;&#x644;&#x628;.</li>
<li>&#x627;&#x644;&#x645;&#x631;&#x634;&#x62D;&#x627;&#x62A; &#x647;&#x64A; &#x62F;&#x648;&#x627;&#x644; &#x645;&#x635;&#x646;&#x648;&#x639;&#x629; &#x645;&#x646; &#x634;&#x64A;&#x641;&#x631;&#x629; &#x628;&#x627;&#x64A;&#x62B;&#x648;&#x646; &#x648;&#x62A;&#x633;&#x62A;&#x62E;&#x62F;&#x645; &#x641;&#x64A; &#x627;&#x644;&#x642;&#x648;&#x627;&#x644;&#x628;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="blueprints.html" class="navigation navigation-prev " aria-label="Previous page: المخططات">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="static.html" class="navigation navigation-next " aria-label="Next page: الملفات الساكنة">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"القوالب","level":"1.9","depth":1,"next":{"title":"الملفات الساكنة","level":"1.10","depth":1,"path":"docs/static.md","ref":"docs/static.md","articles":[]},"previous":{"title":"المخططات","level":"1.8","depth":1,"path":"docs/blueprints.md","ref":"docs/blueprints.md","articles":[]},"dir":"rtl"},"config":{"plugins":["favicon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"favicon":{"shortcut":"images/flask.png","bookmark":"images/flask.png"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"استكشف فلاسك","language":"ar","gitbook":"*","direction":"rtl"},"file":{"path":"docs/templates.md","mtime":"2018-05-08T14:04:53.600Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-12T14:55:55.406Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

